<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
</head>
<body>
<h2 id="&#21442;&#32771;">&#21442;&#32771;</h2>
<ul>
<li><a href="http://hahack.com/codes/local-search-engine-for-hexo/#%E5%AE%89%E8%A3%85%E5%92%8C%E9%85%8D%E7%BD%AE-hexo-generator-search">jQuery-based Local Search Engine for Hexo | HaHack</a></li>
<li><a href="https://github.com/PaicHyperionDev/hexo-generator-search">PaicHyperionDev/hexo-generator-search: A plugin to generate the site&#8217;s search data</a></li>
</ul>
<h2 id="sample-notes">Sample Notes</h2>
<ul>
<li><p><a href="http://www.guancha.cn/america/2016_11_22_381363.shtml">&#32654;&#23186;&#65306;&#29305;&#26391;&#26222;&#36992;&#23186;&#20307;&#39640;&#23618;&#20030;&#34892;&#24231;&#35848;&#20250; &#25351;&#36131;&#23545;&#26041;&#37117;&#26159;&#39575;&#23376;</a></p></li>
<li><p><a href="https://lapinozz.github.io/learning/2016/11/19/calculator-with-caordboard-and-marbles.html">A 4-bit Calculator made in cardboard and marble</a></p></li>
<li><dl>
<dt><a href="https://www.douban.com/people/sting999/status/1918804013/">sting &#30340;&#24191;&#25773;&#65306;&#21338;&#22763;&#21518;</a> -&lt;</dt>
<dd><p>&#29616;&#22312;&#22269;&#20869;&#39640;&#26657;&#37117;&#22312;&#22823;&#32902;&#25193;&#24352;&#21338;&#22763;&#21518;&#25110;&#32773;&#8220;&#24072;&#36164;&#8221;&#21338;&#22763;&#21518;&#65292;&#25104;&#30334;&#19978;&#21315;&#30340;&#25307;&#21338;&#22763;&#21518;&#65292;&#23454; &#38469;&#19978;&#26159;&#21464;&#30456;&#30340;&#23558;&#38738;&#24180;&#21338;&#22763;&#22900;&#24037;&#21270;&#30340;&#26041;&#24335;&#65292;&#33021;&#22815;&#20570;&#23436;&#21338;&#22763;&#21518;&#30041;&#19979;&#25104;&#20026;&#27491;&#24335;&#25945;&#24072;&#30340;&#20154; &#25968;&#38750;&#24120;&#30340;&#23569;&#65292;&#32780;&#19988;&#36234;&#26469;&#36234;&#23569;&#12290;&#21482;&#35201;&#25171;&#21548;&#19968;&#19979;&#35813;&#26657;&#30340;&#25945;&#24072;&#32534;&#21046;&#21644;&#27491;&#22312;&#25307;&#30340;&#21338;&#22763;&#21518;&#20154; &#25968;&#30340;&#27604;&#20363;&#23601;&#19981;&#38590;&#30475;&#20986;&#26469;&#12290;&#21363;&#23558;&#25214;&#24037;&#20316;&#30340;&#21516;&#23398;&#20204;&#24910;&#20043;&#12290;</p>
<p>&#29616;&#21338;&#22763;&#27605;&#19994;&#25214;&#21040;&#22266;&#23450;&#32844;&#20301;&#30830;&#23454;&#38750;&#24120;&#38590;&#20102;&#65292;&#26377;&#23398;&#26657;&#24191;&#25746;&#32593;&#25307;&#25910;&#21338;&#21518;&#65288;&#22914;&#24191;&#19996;&#26576;&#26657;&#65289;&#65292; &#26377;&#20123;&#23398;&#26657;&#24191;&#25746;&#32593;&#25307;&#19987;&#32844;&#31185;&#30740;&#23703;&#65288;&#22914;&#21335;&#20140;&#26576;&#26657;&#65289;&#65292;&#24448;&#24448;&#32473;&#30340;&#24453;&#36935;&#30830;&#23454;&#24456;&#39640;&#65292;&#20294;&#26159;&#22522; &#26412;&#22823;&#37096;&#20998;&#37117;&#24456;&#38590;&#30041;&#19979;&#65292;&#19968;&#25343;&#21040;&#38754;&#19978;&#22522;&#37329;&#30340;&#24072;&#22992;&#20063;&#24551;&#24515;&#24545;&#24545;&#25285;&#24515;&#33021;&#19981;&#33021;&#30041;&#19979;&#65292;&#22522;&#26412; &#19978;&#21338;&#22763;&#37117;&#34987;&#24403;&#35770;&#25991;&#29399;&#26469;&#20351;&#29992;&#65292;&#22909;&#22810;&#20154;&#21338;&#21518;&#21518;&#32773;&#19987;&#32844;&#30041;&#19981;&#19979;&#65292;&#28982;&#21518;&#24754;&#20652;&#20154;&#29983;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt>&#32593;&#32476;&#35774;&#32622; -&lt;</dt>
<dd><p>url: <code>ms-settings:network-proxy</code></p>
<p>&#33050;&#26412;&#22320;&#22336;&#65306;</p>
<pre><code>http://127.0.0.1:1080/pac?t=20161203153117736</code></pre>
<dl>
<dt>500 Internal Privoxy Error</dt>
<dd><p>Privoxy encountered an error while processing your request:</p>
<p>Could not load template file no-server-data or one of its included components.</p>
<p>Please contact your proxy administrator.</p>
<p>If you are the proxy administrator, please put the required file(s)in the (confdir)/templates directory. The location of the (confdir) directory is specified in the main Privoxy config file. (It&#8217;s typically the Privoxy install directory).</p>
</dd>
</dl>
</dd>
</dl></li>
<li><p><a href="https://github.com/shadowsocks/shadowsocks-windows/releases">Releases &#183; shadowsocks/shadowsocks-windows</a></p></li>
<li><p><a href="https://www.zhihu.com/question/36505902">&#22914;&#20309;&#35780;&#20215;&#38899;&#20048;&#21095;&#12298;&#27721;&#23494;&#23572;&#39039;&#12299;(Hamilton)&#65311; - &#30693;&#20046;</a></p></li>
</ul>
</body>
</html>
