<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <meta http-equiv="x-ua-compatible" content="ie=edge" />
    <meta http-equiv="Content-Style-Type" content="text/css" />
    <meta name="author" content="district10" />
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Working Notes</title>
    <link rel="stylesheet" href="../github-markdown.css" type="text/css" />
    <link rel="stylesheet" href="../highlight.css" type="text/css" />
    <link rel="stylesheet" href="../notes.css" type="text/css" />
</head>
<body class="markdown-body">
<a href="https://github.com/district10/notes">
    <img
        style="position: absolute; top: 0; right: 0; border: 0; width: 149px; height: 149px;"
        src="../fork-me-on-github.png" alt="Fork me on GitHub"></a>
<div id="navigator">
    <a id="gotoindex" href="index.html" title="&#12304;&#22238;&#21040;&#31508;&#35760;&#32034;&#24341; | Back to Index&#12305;">&#9763;</a></div>
<span id="help">&#25353;&#19979; "h" &#33719;&#21462;&#39029;&#38754;&#24110;&#21161;&#12290;</span>
<ul>
<li><p><a href="http://www.guancha.cn/america/2016_11_22_381363.shtml">&#32654;&#23186;&#65306;&#29305;&#26391;&#26222;&#36992;&#23186;&#20307;&#39640;&#23618;&#20030;&#34892;&#24231;&#35848;&#20250; &#25351;&#36131;&#23545;&#26041;&#37117;&#26159;&#39575;&#23376;</a></p></li>
<li><p><a href="https://lapinozz.github.io/learning/2016/11/19/calculator-with-caordboard-and-marbles.html">A 4-bit Calculator made in cardboard and marble</a></p></li>
<li><dl>
<dt><a href="https://www.douban.com/people/sting999/status/1918804013/">sting &#30340;&#24191;&#25773;&#65306;&#21338;&#22763;&#21518;</a> <code class="fold">@</code></dt>
<dd><p>&#29616;&#22312;&#22269;&#20869;&#39640;&#26657;&#37117;&#22312;&#22823;&#32902;&#25193;&#24352;&#21338;&#22763;&#21518;&#25110;&#32773;&#8220;&#24072;&#36164;&#8221;&#21338;&#22763;&#21518;&#65292;&#25104;&#30334;&#19978;&#21315;&#30340;&#25307;&#21338;&#22763;&#21518;&#65292;&#23454;&#38469;&#19978;&#26159;&#21464;&#30456;&#30340;&#23558;&#38738;&#24180;&#21338;&#22763;&#22900;&#24037;&#21270;&#30340;&#26041;&#24335;&#65292;&#33021;&#22815;&#20570;&#23436;&#21338;&#22763;&#21518;&#30041;&#19979;&#25104;&#20026;&#27491;&#24335;&#25945;&#24072;&#30340;&#20154;&#25968;&#38750;&#24120;&#30340;&#23569;&#65292;&#32780;&#19988;&#36234;&#26469;&#36234;&#23569;&#12290;&#21482;&#35201;&#25171;&#21548;&#19968;&#19979;&#35813;&#26657;&#30340;&#25945;&#24072;&#32534;&#21046;&#21644;&#27491;&#22312;&#25307;&#30340;&#21338;&#22763;&#21518;&#20154;&#25968;&#30340;&#27604;&#20363;&#23601;&#19981;&#38590;&#30475;&#20986;&#26469;&#12290;&#21363;&#23558;&#25214;&#24037;&#20316;&#30340;&#21516;&#23398;&#20204;&#24910;&#20043;&#12290;</p>
<p>&#29616;&#21338;&#22763;&#27605;&#19994;&#25214;&#21040;&#22266;&#23450;&#32844;&#20301;&#30830;&#23454;&#38750;&#24120;&#38590;&#20102;&#65292;&#26377;&#23398;&#26657;&#24191;&#25746;&#32593;&#25307;&#25910;&#21338;&#21518;&#65288;&#22914;&#24191;&#19996;&#26576;&#26657;&#65289;&#65292;&#26377;&#20123;&#23398;&#26657;&#24191;&#25746;&#32593;&#25307;&#19987;&#32844;&#31185;&#30740;&#23703;&#65288;&#22914;&#21335;&#20140;&#26576;&#26657;&#65289;&#65292;&#24448;&#24448;&#32473;&#30340;&#24453;&#36935;&#30830;&#23454;&#24456;&#39640;&#65292;&#20294;&#26159;&#22522;&#26412;&#22823;&#37096;&#20998;&#37117;&#24456;&#38590;&#30041;&#19979;&#65292;&#19968;&#25343;&#21040;&#38754;&#19978;&#22522;&#37329;&#30340;&#24072;&#22992;&#20063;&#24551;&#24515;&#24545;&#24545;&#25285;&#24515;&#33021;&#19981;&#33021;&#30041;&#19979;&#65292;&#22522;&#26412;&#19978;&#21338;&#22763;&#37117;&#34987;&#24403;&#35770;&#25991;&#29399;&#26469;&#20351;&#29992;&#65292;&#22909;&#22810;&#20154;&#21338;&#21518;&#21518;&#32773;&#19987;&#32844;&#30041;&#19981;&#19979;&#65292;&#28982;&#21518;&#24754;&#20652;&#20154;&#29983;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.douban.com/people/weinanli/status/1918803554/">&#38463;&#30007;&#30340;&#24191;&#25773;&#65306;tinyfool</a> <code class="fold">@</code></dt>
<dd><ul>
<li>tinyfool &#37117;&#22810;&#22823;&#20102;&#65292;&#36824;&#20026;&#23398;&#36825;&#20960;&#38376;&#28866;&#22823;&#23478;&#30340;&#22522;&#30784;&#35838;&#39556;&#20658;&#12290;&#12290;&#12290;</li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://coolwanglu.blogspot.jp/2016/10/blog-post.html?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed:+coolwanglu+(WangLu%27s+Tech+Blog)">WangLu&#8217;s Tech Notes: &#35760;&#24518;&#20013;&#30340;&#38899;&#20048;&#23547;&#23453;</a> <code class="fold">@</code></dt>
<dd><p>&#32534;&#31243;&#30340;&#21508;&#20010;&#29615;&#33410;&#20013;&#65292;&#25105;&#26368;&#21916;&#27426;&#30340;&#24656;&#24597;&#26159;&#35843;&#35797;&#65292;&#23588;&#20854;&#26159;&#35843;&#35797;&#19981;&#29087;&#24713;&#30340;&#20195;&#30721;&#65292;&#27604;&#22914;&#36870;&#21521;&#24037;&#31243;&#12290;&#20174;&#26576;&#20123;&#26041;&#38754;&#26469;&#35828;&#65292;&#35843;&#35797;&#23601;&#26159;&#20390;&#25506;&#30340;&#24037;&#20316;&#65292;&#24930;&#24930;&#25910;&#38598;&#32447;&#32034;&#65292;&#25972;&#29702;&#24605;&#32490;&#65292;&#21033;&#29992;&#25512;&#29702;&#21644;&#24819;&#35937;&#21147;&#25214;&#21040;&#30495;&#30456;&#12290;&#25105;&#24456;&#20139;&#21463;&#25910;&#38598;&#24773;&#25253;&#65292;&#28982;&#21518;&#36880;&#28176;&#20174;&#26080;&#24207;&#21464;&#25104;&#26377;&#24207;&#30340;&#36807;&#31243;&#12290;</p>
<p>&#20915;&#23450;&#35797;&#19968;&#19979;&#20877;&#27425;&#25361;&#25112;&#65292;&#22240;&#20026;&#25105;&#35273;&#24471;&#22914;&#26524;&#33021;&#20877;&#27425;&#25214;&#21040;&#36825;&#20010;&#38899;&#20048;&#65292;Google App&#20843;&#25104;&#33021;&#25628;&#20986;&#26469;&#21517;&#23383;&#12290;</p>
<p>&#19968;&#24320;&#22987;&#21457;&#25955;&#24605;&#32500;&#65292;&#22238;&#24819;&#26159;&#21738;&#37324;&#21548;&#21040;&#30340;&#12290;&#36825;&#26159;&#26368;&#38590;&#30340;&#19968;&#27493;&#12290;&#20919;&#38745;&#20102;&#19968;&#20250;&#20799;&#24819;&#21040;&#37027;&#26159;&#19968;&#20010;&#25214;&#19981;&#21516;&#30340;&#28216;&#25103;&#12290;&#20110;&#26159;&#31532;&#19968;&#21453;&#24212;&#26159;&#21435; Kongregate &#19978;&#25214;&#65292;&#25628;&#21040;&#30340;&#25214;&#19981;&#21516;&#28216;&#25103;&#21482;&#26377;&#19977;&#20010;&#65288;&#21035;&#30340;&#37117;&#19981;&#22826;&#20687;&#65289;&#65292;&#20026;&#20102;&#25214;&#21040; BGM &#20063;&#21482;&#33021;&#20840;&#37117;&#36890;&#20851;&#19968;&#36941;&#12290;&#22909;&#22312;&#28216;&#25103;&#37117;&#19981;&#22826;&#38271;&#65292;&#24182;&#19988;&#28216;&#25103;&#20063;&#19981;&#38169;&#12290;&#39034;&#20415;&#20063;&#25628;&#20102;&#19968;&#19979;&#28216;&#25103;&#30340; BGM&#65292;&#24456;&#26377;&#36259;&#12290;&#19981;&#36807;&#19981;&#24184;&#30340;&#26159;&#37027;&#27573;&#38899;&#20048;&#19981;&#22312;&#36825;&#20960;&#20010;&#28216;&#25103;&#20013;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="http://mp.weixin.qq.com/s/DMRoZSgI4XFkNiWnXUa7Mw">&#36867;&#31163;&#20320;&#32456;&#23558;&#34928;&#33853;&#30340;&#23478;&#20065;&#65306;&#22823;&#25968;&#25454;&#22478;&#24066;&#20154;&#21475;&#20998;&#26512;</a></p></li>
<li><p><a href="https://zhuanlan.zhihu.com/p/23712174">&#26417;&#33258;&#28165;&#20808;&#29983;&#30340;&#25991;&#31456;&#65292;&#24590;&#20040;&#20010;&#22909;&#27861; - &#24352;&#20339;&#29614;&#20889;&#23383;&#30340;&#22320;&#26041; - &#30693;&#20046;&#19987;&#26639;</a></p></li>
<li><dl>
<dt><a href="http://baike.baidu.com/link?url=hnY-Da2zsZvgkF2YCIUGeCl--s2HxjO-DGj0zw3Q6hgcUwkJ-qMK0aDDk4lUuOHH7EEyfsJjQ8sqCi-fFKqtmwaWR4-Cq3V8016_mqkuX_Xg2sOB8gl5T6ms-5DzluMQ">&#26032;&#19977;&#26495;_&#30334;&#24230;&#30334;&#31185;</a> <code class="fold">@</code></dt>
<dd><p>&#22269;&#21153;&#38498;&#21482;&#25209;&#20102; 8 &#23478;&#20132;&#26131;&#25152;&#65292;&#20854;&#23427;&#30340;&#19981;&#26159;&#39575;&#23376;&#23601;&#26159;&#39575;&#23376;&#65281; http://t.cn/RfVcz5V</p>
<p>&#19978;&#20132;&#25152;&#65292;&#28145;&#20132;&#25152;&#65292;&#26032;&#19977;&#26495;&#65292;&#20013;&#26399;&#25152;&#65292;&#19978;&#26399;&#25152;&#65292;&#22823;&#21830;&#25152;&#65292;&#37073;&#21830;&#25152;&#65292;&#19978;&#37329;&#25152;&#65292;&#23601;&#36825;&#20843;&#23478;&#12290;&#36817;&#26469;&#21457;&#29616;&#26377;&#26379;&#21451;&#28818;&#29616;&#36135;&#20043;&#31867;&#30340;&#65292;&#34987;&#33945;&#39057;&#32321;&#20132;&#26131;&#65292;&#20111;&#25163;&#32493;&#36153;&#19981;&#35828;&#65292;&#26681;&#26412;&#21487;&#33021;&#23601;&#26159;&#21644;&#24179;&#21488;&#23545;&#36172;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.douban.com/people/simply8023yoga/status/1904127800/" class="hearts">&#27874;&#20239;&#23043;&#65306;&#30007;&#20154; &amp; &#22899;&#20154;</a> <code class="fold">@</code></dt>
<dd><p>&#27874;&#20239;&#23043;&#65306;</p>
<blockquote>
<p>&#30007;&#20154;&#30340;&#26497;&#22823;&#24184;&#36816;&#22312;&#20110;&#65292;&#20182;&#19981;&#35770;&#22312;&#25104;&#24180;&#36824;&#26159;&#22312;&#23567;&#26102;&#20505;&#65292;&#24517;&#39035;&#36367;&#19978;&#19968;&#26465;&#26497;&#20026;&#33392;&#33510;&#30340;&#36947;&#36335;&#65292;&#19981;&#36807;&#36825;&#26159;&#19968;&#26465;&#26368;&#21487;&#38752;&#30340;&#36947;&#36335;&#65307;&#22899;&#20154;&#30340;&#19981;&#24184;&#21017;&#22312;&#20110;&#34987;&#20960;&#20046;&#19981;&#21487;&#25239;&#25298;&#30340;&#35825;&#24785;&#21253;&#22260;&#30528;&#65307;&#22905;&#19981;&#34987;&#35201;&#27714;&#22859;&#21457;&#21521;&#19978;&#65292;&#21482;&#34987;&#40723;&#21169;&#28369;&#19979;&#21435;&#21040;&#36798;&#26497;&#20048;&#12290;&#24403;&#22905;&#21457;&#35273;&#33258;&#24049;&#34987;&#28023;&#24066;&#34563;&#27004;&#24858;&#24324;&#26102;&#65292;&#24050;&#32463;&#20026;&#26102;&#22826;&#26202;&#65292;&#22905;&#30340;&#21147;&#37327;&#22312;&#22833;&#36133;&#30340;&#20882;&#38505;&#20013;&#24050;&#34987;&#32791;&#23613;&#12290;</p>
</blockquote>
<p>refs and see also</p>
<ul>
<li><a href="http://baike.baidu.com/view/707050.htm">&#35199;&#33945;&#23068;&#183;&#24503;&#183;&#27874;&#20239;&#23043;_&#30334;&#24230;&#30334;&#31185;</a></li>
</ul>
</dd>
</dl></li>
<li><p><a href="https://www.engadget.com/2016/11/23/hijacked-headphones-could-be-used-to-listen-in-on-your-life/">Hijacked headphones could be used to listen in on your life</a></p></li>
<li><dl>
<dt><a href="https://en.wikipedia.org/wiki/Financial_technology">FinTech&#65306;Financial technology - Wikipedia</a> <code class="fold">@</code></dt>
<dd><p>Financial technology, also known as FinTech, is an industry composed of companies that use technology to make financial services, enable provision of financial services (through utilization of technology) or drive technological innovation in provision of financial services. Financial technology companies are startups or already established technology companies trying to replace or enhance the usage of financial services of incumbent companies.</p>
</dd>
</dl></li>
<li><dl>
<dt>&#21507;&#23608;&#20307; <code class="fold">@</code></dt>
<dd><p>&#27604;&#22914;&#35828;&#65292;&#22312;&#38271;&#26399;&#33322;&#34892;&#26399;&#38388;&#21507;&#23608;&#20307;&#20250;&#25104;&#20026;&#26085;&#24120;&#30340;&#20262;&#29702;&#12290;//Pioneer&#33457;&#21307;&#29983;: &#21999;&#19977;&#20307;&#23567;&#35828;&#65292;&#20197;&#21450;&#21518;&#26469;&#30340;&#32654;&#21095;&#21319;&#22825;&#21495; &#65292;&#37117;&#28041;&#21450;&#36825;&#20010;&#38382;&#39064;&#65306;&#28459;&#38271;&#26102;&#38388;&#29421;&#23567;&#31354;&#38388;&#65292;&#20154;&#31867;&#35760;&#24518;&#30340;&#25913;&#21464;&#24433;&#21709;&#29983;&#23384;&#20262;&#29702;&#12290; RT &#35199;&#29916;&#22823;&#20024;&#23376;&#27748;:&#20154;&#31867;&#19981;&#20165;&#32905;&#20307;&#19981;&#26159;&#20026;&#38271;&#26399;&#23431;&#33322;&#35774;&#35745;&#30340;&#65292;&#31934;&#31070;&#20063;&#19981;&#26159;&#12290;&#25968;&#21313;&#24180;&#20197;&#19978;&#30340;&#23431;&#23449;&#33322;&#34892;&#23558;&#25703;&#27585;&#24819;&#35937;&#30340;&#20849;&#21516;&#20307;&#12290;&#22823;&#22810;&#25968;&#20154;&#30340;&#31038;&#20250;&#35760;&#24518;&#19981;&#36807;&#21313;&#24180;&#65292;&#26497;&#23569;&#25968;&#20154;&#29702;&#35299;&#19977;&#21313;&#24180;&#21069;&#12290;&#33322;&#34892;&#32773;&#31163;&#24320;&#22320;&#29699;&#65292;&#21452;&#26041;&#30340;&#21382;&#21490;&#23601;&#20998;&#23700;&#20102;&#12290;&#22320;&#29699;&#24555;&#36895;&#21069;&#36827;&#65292;&#39134;&#33337;&#25104;&#20026;&#26102;&#38388;&#33014;&#22218;&#12290;&#20197;&#20154;&#31867;&#36804;&#20170;&#20026;&#34920;&#29616;&#20986;&#26469;&#30340;&#26234;&#24935;&#21644;&#32784;&#24515;&#65292;&#25919;&#27835;&#20998;&#35010;&#19981;&#21487;&#36991;&#20813;</p>
</dd>
</dl></li>
<li><p><a href="https://36kr.com/p/5057028.html">&#12304;AI &#183;&#22823;&#20844;&#21496;&#26376;&#25253;&#12305;AI&#34892;&#19994;&#30340;&#30495;&#23454;&#36827;&#23637;&#25110;&#35768;&#36828;&#36229;&#24819;&#35937;</a></p></li>
<li><p><a href="http://news.mit.edu/2016/apollo-code-developer-margaret-hamilton-receives-presidential-medal-of-freedom-1117">Apollo code developer Margaret Hamilton receives Presidential Medal of Freedom | MIT News</a></p></li>
<li><p><a href="https://www.washingtonpost.com/news/the-switch/wp/2016/11/21/the-secretive-brain-trust-of-silicon-valley-insiders-who-are-helping-trump/">The secretive brain trust of Silicon Valley insiders who are helping Trump - The Washington Post</a></p></li>
<li><dl>
<dt><a href="https://en.wikipedia.org/wiki/Zika_virus">Zika virus - Wikipedia</a> <code class="fold">@</code></dt>
<dd><p>CHICAGO/BANGKOK(Reuters) - Zika&#8217;s rampage last year in Brazil caused an explosion of infections and inflicted a crippling neurological defect on thousands of babies &#8211; an effect never seen in a mosquito-borne virus.</p>
<p>Zika virus (ZIKV) is a member of the virus family Flaviviridae.[3] It is spread by daytime-active Aedes mosquitoes, such as A. aegypti and A. albopictus.[3] Its name comes from the Zika Forest of Uganda, where the virus was first isolated in 1947.[4] Zika virus is related to the dengue, yellow fever, Japanese encephalitis, and West Nile viruses.[4] Since the 1950s, it has been known to occur within a narrow equatorial belt from Africa to Asia. From 2007 to 2016, the virus spread eastward, across the Pacific Ocean to the Americas, leading to the 2015&#8211;16 Zika virus epidemic.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://en.wikipedia.org/wiki/South_Dakota">South Dakota - Wikipedia</a> <code class="fold">@</code></dt>
<dd><p>South Dakota (<code>/&#716;sa&#650;&#952; d&#601;&#712;ko&#650;t&#601;/</code>) is a state located in the Midwestern region of the United States. It is named after the Lakota and Dakota Sioux Native American tribes, who compose a significant portion of the population and historically dominated the entire territory. South Dakota is the 17th most expansive, but the 5th least populous and the 5th least densely populated of the 50 United States. Once the southern portion of the Dakota Territory, South Dakota became a state on November 2, 1889, simultaneously with North Dakota. Pierre is the state capital and Sioux Falls, with a population of about 171,000, is South Dakota&#8217;s largest city.</p>
</dd>
</dl></li>
<li><p><a href="http://blogs.microsoft.com/next/2016/11/20/microsoft-doubles-quantum-computing-bet/#sm.00003sz9c9e90efgvd01ek6egvg7p">Microsoft doubles down on quantum computing bet - Next at Microsoft</a></p></li>
<li><dl>
<dt>&#26102;&#20195;&#22914;&#39123;&#39118; &#28526;&#27969;&#24050;&#36716;&#21464; <code class="fold">@</code></dt>
<dd><p>&#26102;&#20195;&#22914;&#39123;&#39118; &#28526;&#27969;&#24050;&#36716;&#21464; //<span class="citation">@&#19975;&#21270;&#27714;&#35878;</span>&#65306;&#24403;&#24180;&#24180;&#32423;&#37324;&#30340;&#22825;&#29275;&#12290;&#27604;&#20320;&#24072;&#24351;&#23398;&#26657;&#22909;&#65292;&#23398;&#30340;&#22909;&#12290;&#24046;&#19981;&#22810;&#24180;&#32426;&#65292;&#25343;&#36941;&#22269;&#20869;&#19968;&#32447; it &#20844;&#21496; offer, &#38597;&#34382;&#32473;&#20102; global offer &#21435;&#21152;&#24030;&#24635;&#37096;&#65292;&#26412;&#31185;&#36215;&#34218; 10 &#19975;&#20992;&#65292;&#32473; h1b &#24403;&#24180;&#26159;&#36720;&#21160;&#19968;&#26102;&#12290;&#23094;&#20102;&#24403;&#24180;&#26657;&#33457;&#29616;&#22312;&#38597;&#34382;&#19981;&#27515;&#19981;&#27963;&#65292;&#24819;&#22238;&#38463;&#37324;&#21482;&#33021;&#20570;&#25216;&#26415;&#20294;&#26159;&#31649;&#29702;&#21644;&#32929;&#31080;&#39069;&#24230;&#19981;&#35201;&#25552;&#12290;&#19968;&#21629;&#20108;&#36816;&#65292;&#21476;&#20154;&#35802;&#19981;&#27450;&#25105;&#12290; RT <span class="citation">@&#21271;&#20140;&#22823;&#22303;&#35910;</span>: &#26576;&#24072;&#24351;&#65292;06 &#24180;&#26412;&#31185;&#27605;&#19994;&#22238;&#26477;&#24030;&#32769;&#23478;&#25214;&#24037;&#20316;&#65292;&#20808;&#22312;&#19968;&#20010;&#23567;&#20844;&#21496;&#24178;&#20102;&#19981;&#21040;&#19968;&#24180;&#65292;&#28982;&#21518;&#36339;&#21435;&#20102;&#24403;&#26102;&#30340;&#28120;&#23453;&#32593;&#65292;&#19968;&#20010;&#26376; 4500&#65292;&#36825;&#20123;&#24180;&#22312;&#20844;&#21496;&#31639;&#26159;&#20834;&#20834;&#19994;&#19994;&#65292;&#20170;&#24180;&#24050;&#32463;&#34987;&#25552;&#25300;&#21040; P8 &#20102;&#65292;&#25163;&#19979;&#26032;&#25307;&#30340;&#23567;&#24351;&#37117;&#26159;&#27993;&#22823;&#20132;&#22823;&#27605;&#19994;&#30340;&#30805;&#22763;&#21338;&#22763;&#65292;&#24180;&#34218; 100 &#22810;&#19975;&#65292;&#32929;&#31080;&#36817;&#21315;&#19975;&#65292;&#26477;&#24030;&#20004;&#22871;&#22823;&#25143;&#22411;&#12290;&#20182;&#35828;&#65292;&#38500;&#20102;&#21334;&#21147;&#27668;&#65292;&#20027;&#35201;&#36824;&#26159;&#36816;&#27668;&#22909;&#65292;&#34892;&#19994;&#21457;&#23637;&#30340;&#24555;&#65292;&#21448;&#36214;&#19978;&#20844;&#21496;&#19978;&#24066;&#22823;&#35268;&#27169;&#25307;&#20154;&#65292;&#37027;&#20123;&#24403;&#24180;&#27605;&#19994;&#21435;&#36816;&#33829;&#21830;&#21507;&#30343;&#31918;&#30340;&#29616;&#22312;&#37117;&#24456;&#19968;&#33324;&#65292;&#20294;&#26159;&#24403;&#26102;&#25402;&#35753;&#20154;&#32673;&#24917;&#30340;&#65292;&#21453;&#20498;&#26159;&#20182;&#36825;&#20010;&#24403;&#24180;&#21738;&#37117;&#27809;&#20154;&#35201;&#30340; loser &#29616;&#22312;&#21457;&#23637;&#30340;&#26368;&#22909;&#12290;&#25152;&#20197;&#35828;&#65292;&#20154;&#21834;&#65292;&#24403;&#28982;&#35201;&#38752;&#33258;&#25105;&#30340;&#22859;&#26007;&#65292;&#20294;&#26159;&#20063;&#35201;&#32771;&#34385;&#21040;&#21382;&#21490;&#30340;&#34892;&#31243;&#12290;</p>
<p>&#29616;&#22312;&#19981;&#21516;&#20102;&#12290;&#29616;&#22312;&#30340; 70&#12289;80 &#21518;&#29238;&#27597;&#65292;&#21892;&#29992;&#20114;&#32852;&#32593;&#65292;&#33021;&#25509;&#21463;&#21040;&#26368;&#20808;&#36827;&#30340;&#32946;&#20799;&#29702;&#24565;&#65292;&#29616;&#22312;&#30340;&#23401;&#23376;&#25171;&#23064;&#32974;&#37324;&#23601;&#21548;&#21476;&#20856;&#20048;&#65292;&#20986;&#29983;&#23601;&#28216;&#27891;&#65292;&#19977;&#23681;&#23398;&#33521;&#35821;&#65292;&#20116;&#23681;&#23601;&#26377;&#19968;&#25972;&#22871;&#32784;&#20811;&#26381;&#35013;&#65292;&#20294;&#20173;&#26377;&#37027;&#20040;&#22810;&#20154;&#35273;&#24471;&#65292;&#30005;&#35270;&#19978;&#24188;&#22899;&#36319;&#25104;&#24180;&#30007;&#23376;&#21516;&#21507;&#21516;&#30561;&#30340;&#8220;cp&#8221;&#20165;&#20165;&#26159;&#8220;&#22909;&#26377;&#29233;&#8221;&#65292;&#22914;&#26524;&#26377;&#20154;&#36136;&#30097;&#36825;&#31181;&#23089;&#20048;&#33410;&#30446;&#25152;&#24102;&#32473;&#23567;&#26379;&#21451;&#20204;&#30340;&#31967;&#31957;&#30340;&#31034;&#33539;&#20316;&#29992;&#23601;&#26159;&#8220;&#33829;&#38144;&#21495;&#22312;&#40657;&#8221;&#12290;</p>
<p>&#25105;&#21435;&#20320;&#22920;&#30340;&#65292;&#25105;&#26367;&#25968;&#30334;&#19975;&#24050;&#32463;&#25110;&#38505;&#20123;&#36973;&#21463;&#24615;&#20405;&#29359;&#30340;&#24188;&#31461;&#21435;&#20320;&#22920;&#30340;&#12290;&#22914;&#26524;&#22240;&#20026;&#36825;&#31181;&#33410;&#30446;&#65292;&#26377;&#20219;&#20309;&#19968;&#20010;&#23567;&#23401;&#23376;&#20007;&#22833;&#20102;&#23545;&#38476;&#29983;&#30007;&#23376;&#30340;&#25106;&#24515;&#65292;&#20063;&#37197;&#21512;&#32618;&#29359;&#20204;&#27169;&#20223;&#36215;&#8220;&#23454;&#20064;&#29240;&#29240;&#8221;&#30340;&#28216;&#25103;&#32780;&#36973;&#36935;&#20219;&#20309;&#19981;&#27979;&#65292;&#25105;&#24895;&#20182;&#20204;&#21463;&#21040;&#30340;&#20260;&#23475;&#30334;&#20493;&#21152;&#35832;&#32473;&#33410;&#30446;&#32452;&#30340;&#23478;&#20154;&#12290;</p>
<p>&#36824;&#26377;&#20320;&#20204;&#36825;&#20123;&#36319;&#30528;&#29053;&#39118;&#28857;&#28779;&#30340;&#31528;&#34507;&#12290;</p>
<p>&#30495;&#20182;&#22920;&#26159;&#19968;&#20986;&#27963;&#30340;&#31227;&#27665;&#24191;&#21578;&#12290;</p>
<p>&#20197;&#21069;&#22806;&#22269;&#20570;&#20986;&#21385;&#23475;&#30340;&#25104;&#26524;&#65292;&#19981;&#23569;&#26159;&#22522;&#30784;&#30740;&#21457;&#35774;&#22791;&#30340;&#20248;&#21183;&#12290;&#29616;&#22312;&#20013;&#22269;&#26377;&#20102;&#26368;&#29275;&#30340;&#36229;&#31639;&#35774;&#22791;&#65292;&#24212;&#29992;&#24403;&#28982;&#20063;&#23601;&#31361;&#30772;&#20102;&#12290;&#31185;&#30740;&#23601;&#26159;&#36825;&#26679;&#65292;&#38065;&#22810;&#26368;&#37325;&#35201;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="http://tech.sina.cn/it/2016-11-17/detail-ifxxwrwk1311750.d.html?pos=18&amp;wm=5312_0010">&#29579;&#23567;&#24029;:AI &#26159;&#21542;&#20250;&#26377;&#31532;&#19977;&#27425;&#36864;&#28526;_&#25163;&#26426;&#26032;&#28010;&#32593;</a></p></li>
<li><dl>
<dt><a href="http://oglaf.com/" class="hearts">Pulp and Rind</a> <code class="fold">@</code></dt>
<dd><p>&#24456;&#40644;&#24456;&#26292;&#21147;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt>Spurty McGoo <code class="fold">@</code></dt>
<dd><p>spurt&#8220;&#21943;&#23556;&#8221;goo&#8220;&#31896;&#31264;&#28082;&#20307;&#8221;Mc &#26159;&#22995;&#27663;&#21069;&#32512; (son of) &#36825;&#37324;&#26159;&#32473;&#25784;&#31649;&#23567;&#20249;&#36215;&#22806;&#21495;&#65292;&#31867;&#20284;&#8220;&#37329;&#21943;&#31038;/ &#40065;&#30333;&#27743; / &#35874;&#24180;&#22812;&#8221;# &#35797;&#35797;&#25628;&#29399; # &#27963;&#21160;&#36824;&#22312;&#32487;&#32493;&#65292;&#26377;&#38382;&#39064;&#21435; <span class="citation">@&#25628;&#29399;</span>&#25628;&#32034; &#33521;&#25991;&#39057;&#36947;&#23547;&#27714;&#31572;&#26696;&#21543;~//<span class="citation">@&#26519;&#23478;&#38663;</span>&#65306;# &#35797;&#35797;&#25628;&#29399; # &#22312;&#40657;&#38236; 303&#65292;&#27874;&#38534;&#35828;&#26381;&#30007;&#20027;&#25250;&#38134;&#34892;&#26102;&#25552;&#21040; Spurty McGoo &#36825;&#20010;&#35789;&#65292;&#22312;&#32593;&#19978;&#26597;&#19981;&#21040;&#20855;&#20307;&#37322;&#20041;&#65292;&#27714;&#35299;&#12290;</p>
<p>&#12304;spectrophobia&#12305;n. &#38236;&#23376;&#24656;&#24807;&#30151; spectrum+phobia&#65292;&#20063;&#21483; catoptrophobia&#12290;&#36890;&#24120;&#23475;&#24597;&#30340;&#26159;&#38236;&#20013;&#35265;&#39740;&#65292;&#23475;&#24597;&#38236;&#23376;&#36890;&#21521;&#21478;&#19968;&#20010;&#19990;&#30028;&#65292;&#24597;&#34987;&#39740;&#25235;&#36827;&#38236;&#23376;&#65292;&#24597;&#22312;&#40657;&#26263;&#20013;&#30475;&#21040;&#38236;&#20013;&#30340;&#33258;&#24049;&#65292;&#25110;&#24597;&#38236;&#23376;&#30862;&#25481;&#24102;&#26469;&#22121;&#36816;&#12290;&#31867;&#20284;&#35789;&#27719;&#36824;&#26377; eisoptrophobia&#65292;&#23545;&#33258;&#24049;&#26144;&#20687;&#30340;&#24656;&#24807;&#30151; (&#27604;&#22914;&#24597;&#30475;&#21040;&#38236;&#20013;&#30340;&#33258;&#24049;)&#12290;</p>
<p>&#32769;&#21496;&#26426; &#33521;&#25991;&#65311;chronic masturbator / old wanker //<span class="citation">@&#20320;&#29468;&#29468;&#29468;&#19981;&#30528;</span>&#65306;&#25720;&#24744;&#65292;&#26089;&#19978;&#30340;&#32769;&#21496;&#26426;&#33521;&#25991;&#22046;&#65311; RT <span class="citation">@&#35895;&#22823;&#30333;&#35805;</span>: &#27599;&#22825;&#37117;&#22312;&#30382;&#30382;&#30340;&#32993;&#35328;&#20081;&#35821;&#21644;&#25331;&#25171;&#33050;&#36386;&#19979;&#37266;&#26469; # &#25720;&#24744;</p>
<h1 id="&#27599;&#26085;&#19968;&#35789;-evan-rachel-wood&#25552;&#21040;&#35199;&#37096;&#19990;&#30028;&#31532;&#20116;&#38598;&#21095;&#24773;&#22823;&#29190;&#21457;&#26102;&#29992;&#30340;&#26159;up-to">&#27599;&#26085;&#19968;&#35789;# Evan Rachel Wood&#25552;&#21040;&#12298;&#35199;&#37096;&#19990;&#30028;&#12299;&#31532;&#20116;&#38598;&#21095;&#24773;&#22823;&#29190;&#21457;&#26102;&#29992;&#30340;&#26159;&#12304;up to</h1>
<p>eleven&#12305;&#24847;&#20026;&#8220;&#36229;&#36234;&#26497;&#38480;/&#29190;&#34920;&#8221;&#12290;&#28304;&#33258;&#30005;&#24433;&#12298;This Is Spinal Tap&#12299;&#30340;&#25918;&#22823;&#22120;&#26723;&#20301;&#26159;&#20174;0-11&#65292;&#36229;&#36234;&#20102;&#27491;&#24120;&#30340;0-10 http://t.cn/RVH44IF RT <span class="citation">@&#35895;&#22823;&#30333;&#35805;:&#22312;</span>&#12298;&#35199;&#37096;&#19990;&#30028;&#12299;&#20013;&#34920;&#29616;&#20986;&#33394;&#30340; &#8220;Dolores&#8221;Evan Rachel Wood&#20570;&#23458;&#32933;&#20262;&#20170;&#22812;&#31168;&#65292;&#32842;&#21040;&#28436;&#26426;&#22120;&#20154;&#30340;&#38590;&#22788;&#65292;&#35828;&#28436;&#21592;&#35201;&#21435;&#24605;&#32771;&#20123;&#19981;&#22826;&#19968;&#26679;&#30340;&#38382;&#39064;&#12290;&#27604;&#22914;&#65292;&#22312;&#22826;&#38451;&#24213;&#19979;&#35201;&#19981;&#35201;&#30511;&#30524;&#65292;&#20182;&#20204;&#31649;&#36825;&#31181;&#38382;&#39064;&#21483;&#8220;bot thought&#8221;&#12290;&#37319;&#35775;&#20013;&#36824;&#25918;&#20102;&#31532;&#20116;&#38598;&#29255;&#27573;&#12290;Evan&#35828;&#19979;&#38598;&#21095;&#24773;&#35201;&#22823;&#29190;&#21457;&#12290;&#21518;&#38754;&#25552;&#20102;&#19979;&#33258;&#24049;&#30340;&#20048;&#38431;&#12290; http://t.cn/RVTAfuV</p>
<p>shitshit.</p>
</dd>
</dl></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzAxMjc1NjIxNQ==&amp;mid=2650169153&amp;idx=1&amp;sn=df1ef2a77309ef2d0f88416e06814d96&amp;chksm=83ae0ad9b4d983cf1db5df9747775f11b5c33e839fab8cebf7aac2d01a50468058e4e193e762&amp;mpshare=1&amp;scene=2&amp;srcid=1114zJOvSyX3wJotzhTTJJUD&amp;from=timeline#wechat_redirect">&#20320;&#20204;&#30524;&#20013;&#32593;&#32476;&#22855;&#24046;&#30340;&#21360;&#24230;&#20114;&#32852;&#32593;&#65292;&#23558;&#22312;&#36825;&#20123;&#22320;&#26041;&#36229;&#36234;&#20013;&#22269;&#65372;&#37325;&#30917;&#25253;&#21578;&#65306;8&#22823;&#39046;&#22495;&#20840;&#38754;&#21078;&#26512;&#20013;&#21360;&#20114;&#32852;&#32593;</a></p></li>
<li><p><a href="https://www.douban.com/note/593443790/">&#29579;&#36335;&#65306;&#24615;&#19982;&#25253;&#22797;</a></p></li>
<li><p>&#24314;&#35758;&#22823;&#23478;&#25226; xargs &#36825;&#20010;&#21629;&#20196;&#30340;&#20351;&#29992;&#23398;&#26126;&#30333;&#65306;man xargs</p></li>
<li><p><a href="http://inhabitat.com/researchers-identify-antibody-that-kills-98-of-hiv-strains/">Researchers identify antibody that kills 98% of HIV strains, which could lead to a vaccine | Inhabitat - Green Design, Innovation, Architecture, Green Building</a></p></li>
<li><p><a href="http://zhibimo.com/explore/books">&#21457;&#29616;&#22270;&#20070; - &#30693;&#31508;&#22696;</a></p></li>
<li><p><a href="https://docs.google.com/presentation/d/1m8WiXodW-Wz78DExjG6SzS_e8rY3oE14u9d9VJ_wJN4/edit#slide=id.p">AngularJS Announcements: December 2014 - Google Slides</a></p></li>
<li><p><a href="https://www.phodal.com/blog/thoughtworks-university-go-to-india/">ThoughtWorks University &#35760;&#20986;&#21457;&#21435;&#21360;&#24230; - Phodal | Phodal - A Growth Engineer</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/9001131?utm_campaign=in_app_share&amp;utm_medium=Android&amp;utm_source=com.ideashower.readitlater.activity.AddActivity">&#23478;&#37324;&#26377;&#23401;&#23376;&#65292;&#21487;&#24471;&#35748;&#30495;&#20102;&#35299;&#19979;&#25163;&#36275;&#21475;&#30149;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8979781?utm_campaign=in_app_share&amp;utm_medium=Android&amp;utm_source=com.ideashower.readitlater.activity.AddActivity">&#23545;&#22899;&#20154;&#26469;&#35828;&#65292;&#24615;&#20063;&#35768;&#26159;&#21830;&#21697;&#32780;&#19981;&#26159;&#26412;&#33021;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8995900">&#19981;&#24471;&#19981;&#25215;&#35748;&#65292;&#26377;&#26102;&#20505;&#30495;&#30340;&#23601;&#26159;&#12300;&#36816;&#27668;&#38382;&#39064;&#12301;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8979781?utm_campaign=in_app_share&amp;utm_medium=Android&amp;utm_source=com.ideashower.readitlater.activity.AddActivity">&#23545;&#22899;&#20154;&#26469;&#35828;&#65292;&#24615;&#20063;&#35768;&#26159;&#21830;&#21697;&#32780;&#19981;&#26159;&#26412;&#33021;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8992510?utm_campaign=in_app_share&amp;utm_medium=Android&amp;utm_source=com.ideashower.readitlater.activity.AddActivity">&#25105;&#20063;&#25226;&#38712;&#36947;&#24635;&#35009;&#29233;&#19978;&#25105;&#30340;&#20107;&#20799;&#20889;&#20102;&#26412;&#20070;&#65292;&#21483;&#12298;&#38899;&#20048;&#20043;&#22768;&#12299;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8986220?utm_campaign=in_app_share&amp;utm_medium=Android&amp;utm_source=com.ideashower.readitlater.activity.AddActivity">&#20154;&#24037;&#26234;&#33021;&#30028;&#30340;&#22823;&#29275;&#26446;&#39134;&#39134;&#21152;&#20837;&#35895;&#27468;&#65292;&#24040;&#22836;&#20204;&#27491;&#22312;&#20105;&#25250;&#20154;&#25165;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8984802">&#19968;&#20010;&#20154;&#36807;&#27809;&#20160;&#20040;&#19981;&#22909;&#30340;&#65292;&#20294;&#26159;&#8230;&#8230;&#20063;&#27809;&#37027;&#20040;&#22909;</a></p></li>
<li><dl>
<dt>&#32593;&#32476;&#35774;&#32622; <code class="fold">@</code></dt>
<dd><p>url: <code>ms-settings:network-proxy</code></p>
<p>&#33050;&#26412;&#22320;&#22336;&#65306;</p>
<pre><code>http://127.0.0.1:1080/pac?t=20161203153117736</code></pre>
<dl>
<dt>500 Internal Privoxy Error</dt>
<dd><p>Privoxy encountered an error while processing your request:</p>
<p>Could not load template file no-server-data or one of its included components.</p>
<p>Please contact your proxy administrator.</p>
<p>If you are the proxy administrator, please put the required file(s)in the (confdir)/templates directory. The location of the (confdir) directory is specified in the main Privoxy config file. (It&#8217;s typically the Privoxy install directory).</p>
</dd>
</dl>
</dd>
</dl></li>
<li><p><a href="https://github.com/shadowsocks/shadowsocks-windows/releases">Releases &#183; shadowsocks/shadowsocks-windows</a></p></li>
<li><p><a href="https://www.zhihu.com/question/36505902">&#22914;&#20309;&#35780;&#20215;&#38899;&#20048;&#21095;&#12298;&#27721;&#23494;&#23572;&#39039;&#12299;(Hamilton)&#65311; - &#30693;&#20046;</a></p></li>
<li><dl>
<dt><a href="https://www.zhihu.com/question/40723999/answer/132865512">&#22914;&#20309;&#35780;&#20215;&#21674;&#33945;&#65311; - &#25366;&#25968;&#30340;&#22238;&#31572; - &#30693;&#20046;</a> <code class="fold">@</code></dt>
<dd><p>&#22810;&#23569;&#20154;&#39554;&#21674;&#33945;&#20026;&#20102;&#36186;&#38065;&#36830;&#33080;&#37117;&#19981;&#35201;&#20102;&#65292;&#29616;&#22312;&#24773;&#20917;&#26159;&#22905;&#20844;&#21496;&#36890;&#36807;&#20844;&#20247;&#21495;&#25991;&#31456;&#19981;&#20165;&#33021;&#36824;&#25237;&#36164;&#20154;&#25237;&#22905;&#31532;&#19968;&#27425;&#21019;&#19994;&#22833;&#36133;&#30340;&#38065;&#65292;&#22905;&#20877;&#24178;&#19968;&#24180;&#21487;&#20197;&#25343;&#30528;&#36825;&#20123;&#22823;&#23478;&#21475;&#20013;&#30340;&#12300;&#36896;&#23421;&#38065;&#12301;&#21435;&#32487;&#32493;&#24178;&#32534;&#21095;&#20174;&#20107;&#24433;&#35270;&#34892;&#19994;&#65292;&#21040;&#26102;&#20505;&#36825;&#21448;&#21464;&#25104;&#20102;&#19968;&#20010;&#34203;&#20043;&#35878;&#33324;&#20026;&#20102;&#23454;&#29616;&#38899;&#20048;&#26790;&#24819;&#32780;&#21162;&#21147;&#36890;&#36807;&#24320;&#28120;&#23453;&#24215;&#12289;&#24494;&#21338;&#21457;&#36719;&#25991;&#12289;&#24320;&#28779;&#38149;&#24215;&#36186;&#38065;&#30340;&#21169;&#24535;&#25925;&#20107;&#12290;&#21482;&#35201;&#22905;&#21442;&#19982;&#20027;&#21019;&#30340;&#26576;&#19968;&#37096;&#24433;&#35270;&#21095;&#29190;&#32418;&#8212;&#8212;&#20197;&#21674;&#33945;&#23545;&#22269;&#20154;&#24515;&#29702;&#30340;&#20102;&#35299;&#21644;&#25805;&#25511;&#65292;&#36825;&#20960;&#20046;&#26159;&#24517;&#28982;&#65292;&#21482;&#26159;&#38656;&#35201;&#26102;&#38388;&#12290;&#22905;&#26082;&#33021;&#38752;&#20844;&#20247;&#21495;&#25345;&#32493;&#36186;&#38065;&#65292;&#21448;&#33021;&#36890;&#36807;&#20570;&#24433;&#35270;&#21095;&#26641;&#31435;&#21475;&#30865;&#21644;&#25193;&#22823;&#33829;&#38144;&#65292;&#20197;&#22269;&#20154;&#30340;&#20581;&#24536;&#31243;&#24230;&#21644;&#23815;&#23578;&#12300;&#32988;&#32773;&#20026;&#29579;&#36133;&#32773;&#20026;&#23495;&#12301;&#30340;&#31038;&#20250;&#36798;&#23572;&#25991;&#20027;&#20041;&#24515;&#24577;&#65292;&#21674;&#33945;&#20877;&#22362;&#25345;&#19977;&#24180;&#65292;&#23601;&#20250;&#21464;&#25104;&#31881;&#19997;&#20204;&#21475;&#20013;&#20026;&#20102;&#36861;&#27714;&#24433;&#35270;&#26790;&#24819;&#32780;&#36890;&#36807;&#33258;&#24049;&#26412;&#20107;&#36186;&#38065;&#30340;&#21169;&#24535;&#20856;&#22411;&#12290;</p>
<p>&#20320;&#21487;&#20197;&#22066;&#31505;&#21674;&#33945;&#20007;&#22833;&#20102;&#33258;&#24049;&#26366;&#32463;&#20316;&#20026;&#19968;&#20010;&#25991;&#21270;&#20154;&#30340;&#36131;&#20219;&#24863;&#21644;&#19968;&#20010;&#30693;&#35782;&#20998;&#23376;&#30340;&#32670;&#32827;&#24515;&#65292;&#20294;&#26159;&#20320;&#26080;&#27861;&#38459;&#27490;&#22905;&#21033;&#29992;&#33258;&#24049;&#30340;&#25165;&#21326;&#36186;&#38065;&#12290;&#22905;&#26366;&#32463;&#26159;&#19968;&#20010;&#28010;&#28459;&#32780;&#21448;&#29702;&#24819;&#30340;&#25991;&#21270;&#20154;&#65292;&#25105;&#19981;&#20250;&#30456;&#20449;&#19968;&#20010;&#33021;&#29702;&#35299;&#37329;&#22307;&#21497;&#25110;&#32773;&#23624;&#21407;&#30340;&#30171;&#33510;&#30340;&#20154;&#19981;&#26366;&#27833;&#28982;&#32780;&#29983;&#19968;&#20123;&#30495;&#25370;&#30340;&#29702;&#24819;&#12290;&#22905;&#21487;&#33021;&#21482;&#26159;&#22312;&#19977;&#21313;&#22810;&#23681;&#20043;&#21518;&#30475;&#35265;&#20102;&#33258;&#24049;&#26366;&#32463;&#29702;&#24819;&#30340;&#24187;&#28781;&#12290;&#25105;&#20204;&#37117;&#21487;&#20197;&#24576;&#24565;&#37027;&#20010;&#26366;&#32463;&#30340;&#21674;&#33945;&#65292;&#19968;&#20010;&#20183;&#20041;&#25191;&#35328;&#30340;&#21191;&#25954;&#22320;&#35828;&#20986;&#30495;&#30456;&#30340;&#21674;&#33945;&#65292;&#20294;&#26159;&#37027;&#24050;&#32463;&#26159;&#36807;&#21435;&#24335;&#20102;&#12290;&#25105;&#20204;&#20063;&#21487;&#20197;&#36873;&#25321;&#21435;&#30171;&#39554;&#22905;&#65292;&#21453;&#22797;&#21578;&#35785;&#33258;&#24049;&#19981;&#35201;&#25104;&#20026;&#19968;&#20010;&#21644;&#22905;&#19968;&#26679;&#30340;&#20154;&#8212;&#8212;&#38754;&#23545;&#27491;&#30830;&#32780;&#33392;&#38590;&#30340;&#36873;&#25321;&#21644;&#36731;&#26494;&#30340;&#36873;&#25321;&#36825;&#20004;&#32773;&#26102;&#65292;&#22905;&#36873;&#25321;&#20102;&#21518;&#32773;&#12290;</p>
<p>&#35753;&#20154;&#24754;&#30171;&#30340;&#19981;&#20165;&#20165;&#26159;&#36896;&#21270;&#24324;&#20154;&#30340;&#24754;&#21095;&#21644;&#20154;&#24615;&#30340;&#24694;&#24847;&#65292;&#32780;&#26159;&#37027;&#20123;&#26366;&#32463;&#22825;&#30495;&#30340;&#29702;&#24819;&#20027;&#20041;&#30340;&#38761;&#26032;&#32773;&#65292;&#20182;&#20204;&#22312;&#22823;&#21414;&#23558;&#20542;&#26102;&#25110;&#29702;&#24819;&#35206;&#28781;&#21518;&#36873;&#25321;&#25104;&#20026;&#20102;&#19968;&#20010;&#35782;&#26102;&#21153;&#32773;&#12290;&#36825;&#20010;&#19990;&#30028;&#26681;&#26412;&#25215;&#21463;&#19981;&#20102;&#37027;&#20040;&#22810;&#26366;&#32463;&#30340;&#29702;&#24819;&#20027;&#20041;&#32773;&#36716;&#22836;&#25104;&#20026;&#20102;&#29356;&#20754;&#20027;&#20041;&#32773;&#65292;&#20182;&#20204;&#26366;&#32463;&#26377;&#29702;&#24819;&#30340;&#26102;&#20505;&#19981;&#20197;&#21517;&#21033;&#20026;&#30446;&#30340;&#22320;&#36129;&#29486;&#20102;&#20182;&#20204;&#30340;&#21147;&#37327;&#65292;&#20294;&#26159;&#24403;&#20182;&#20204;&#22833;&#26395;&#24182;&#20007;&#22833;&#29702;&#24819;&#20043;&#21518;&#65292;&#20182;&#20204;&#30340;&#21467;&#21464;&#26159;&#26368;&#21487;&#24597;&#30340;&#12290;&#24403;&#27946;&#27700;&#26469;&#34989;&#65292;&#26366;&#32463;&#30340;&#31569;&#22681;&#32773;&#21644;&#23432;&#22812;&#20154;&#26159;&#26368;&#29087;&#24713;&#22564;&#22365;&#34180;&#24369;&#22788;&#30340;&#12290;</p>
<p>&#27605;&#31455;&#65292;&#22312;&#26368;&#24320;&#22987;&#65292;&#20239;&#22320;&#39764;&#27599;&#22825;&#22312;&#38669;&#26684;&#27779;&#20857;&#22909;&#22909;&#23398;&#20064;&#20197;&#26045;&#23637;&#20182;&#30340;&#22825;&#36171;&#21644;&#25165;&#21326;&#65292;&#20182;&#30340;&#26790;&#24819;&#26159;&#12300;&#25104;&#20026;&#36825;&#19990;&#30028;&#19978;&#26368;&#20255;&#22823;&#30340;&#24043;&#24072;&#12301;&#12290;</p>
<dl>
<dt>&#21674;&#33945; <code class="fold">@</code></dt>
<dd><p>&#24456;&#22810;&#20154;&#19968;&#26377;&#38065;&#23601;&#21464;&#20102;&#65292;&#24320;&#22987;&#28843;&#32768;&#21644;&#35013;&#36924;&#12290;&#21482;&#26377;&#25105;&#27809;&#21464;&#12290;&#25105;&#27809;&#38065;&#30340;&#26102;&#20505;&#20063;&#28843;&#32768;&#21644;&#35013;&#36924;&#12290;</p>
<p>&#24456;&#22810;&#20154;&#20197;&#20026;&#25105;&#35828;&#23466;&#27861;&#26377;&#36825;&#26465;&#26159;&#39575;&#20154;&#65292;&#32467;&#26524;&#20182;&#20204;&#21435;&#26597;&#20102;&#23466;&#27861;&#65292;&#21457;&#29616;&#25105;&#30495;&#30340;&#26159;&#39575;&#20154;&#12290; RT <span class="citation">@&#21674;</span>&#33945;: &#24819;&#36319;&#28023;&#24213;&#25438;&#35848;&#35848;&#65292;&#20026;&#27611;&#20320;&#23478;&#26381;&#21153;&#21592;&#24635;&#35201;&#35753;&#25105;&#25166;&#22836;&#21457;&#65292;&#36825;&#26159;&#36829;&#27861;&#30340;&#20320;&#30693;&#36947;&#21527;&#12290;&#23466;&#27861;&#31532; 5 &#31456;&#31532; 127 &#26465;&#35268;&#23450;&#65292;&#22823;&#33080; and &#32982;&#23376;&#65292;&#32456;&#36523;&#25317;&#26377;&#25343;&#22836;&#21457;&#26469;&#36974;&#33080;&#30340;&#26435;&#21033;&#65292;&#20854;&#20182;&#20154;&#19981;&#24471;&#24178;&#28041; 88_org.gif</p>
<p><strong>&#21674;&#33945;&#30495;&#30340;&#26159;&#35753;&#25105;&#24819;&#20247;&#31609;&#25171;&#22905;</strong></p>
</dd>
</dl>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://mp.weixin.qq.com/s?__biz=MzI3MTM5ODA0Nw==&amp;mid=100000002&amp;idx=2&amp;sn=32face7f1acb17e07f3c38dde41d880e">&#21021;&#25506;&#35745;&#31639;&#26426;&#35270;&#35273;&#30340;&#19977;&#20010;&#28304;&#22836;&#12289;&#20860;&#35848;&#20154;&#24037;&#26234;&#33021;&#65372;&#27491;&#26412;&#28165;&#28304;</a> <code class="fold">@</code></dt>
<dd><p>Marr 1972 &#24180;&#20174;&#21073;&#26725;&#22823;&#23398;&#27605;&#19994;&#65292;&#21338;&#22763;&#35770;&#25991;&#26159;&#20174;&#29702;&#35770;&#30340;&#35282;&#24230;&#30740;&#31350;&#22823;&#33041;&#21151;&#33021;&#65292;&#20855;&#20307;&#26469;&#35828;&#65292;&#26159;&#30740;&#31350;&#30340;&#23567;&#33041;&#65292; &#20027;&#31649;&#36816;&#21160;&#30340; Cerebellum&#12290;1973 &#24180;&#21463; MIT &#20154;&#24037;&#26234;&#33021;&#23454;&#39564;&#23460;&#20027;&#20219; Minsky &#30340;&#36992;&#35831;&#65292; &#24320;&#22987;&#26159;&#20570;&#35775;&#38382;&#23398;&#32773;&#65288;&#21338;&#22763;&#21518;&#65289;&#12290; 1977 &#24180;&#36716;&#20026;&#25945;&#32844;&#12290; &#21487;&#26159;&#65292; 1978 &#24180;&#20908;&#35786;&#26029;&#24471;&#20102;&#24613;&#24615;&#30333;&#34880;&#30149;&#12290;1980 &#24180;&#36716;&#20026;&#27491;&#25945;&#25480;&#19981;&#20037;&#23601;&#21435;&#19990;&#20102;&#65292; &#26102;&#24180; 35 &#23681;&#12290;&#20182;&#22312;&#24471;&#30693;&#26469;&#26085;&#26080;&#22810;&#21518;&#65292;&#23601;&#36214;&#32039;&#25972;&#29702;&#20102;&#19968;&#26412;&#20070;&#65292;&#23601;&#21483; &#8220;Vision&#65306;A Computational Investigation into the HumanRepresentation and Processing of Visual Information&#8221;, &#12298;&#35270;&#35273;&#65306;&#20174;&#35745;&#31639;&#30340;&#35270;&#35282;&#30740;&#31350;&#20154;&#30340;&#35270;&#35273;&#20449;&#24687;&#34920;&#36798;&#19982;&#22788;&#29702;&#12299;&#12290;&#20182;&#21435;&#19990;&#21518;&#30001;&#23398;&#29983;&#21644;&#21516;&#20107;&#20462;&#35746;&#65292;1982 &#24180;&#20986;&#29256;&#12290;</p>
<p>&#21487;&#24796;&#65292; &#30446;&#21069;&#35745;&#31639;&#26426;&#35270;&#35273;&#36825;&#20010;&#39046;&#22495;&#65292;&#20320;&#22914;&#26524;&#21435;&#38382;&#23398;&#29983;&#30340;&#35805;&#65292;&#20182;&#20204;&#24456;&#22810;&#20154;&#37117;&#27809;&#21548;&#35828;&#36807; David Marr&#12290;&#8220;&#21908;&#65292;&#24819;&#36215;&#26469;&#20102;&#65292;&#22909;&#20687;&#26377;&#20010; Marr &#22870;&#21543;&#8221;&#12290;&#21487;&#26159;&#20320;&#21435;&#38382;&#35748;&#30693;&#31185;&#23398;&#12289;&#31070;&#32463;&#31185;&#23398;&#30340;&#20154;&#65292;&#20182;&#20204;&#22522;&#26412;&#19978;&#23545; Marr &#38750;&#24120;&#30340;&#28165;&#26970;&#12290;&#36825;&#20063;&#26159;&#25105;&#25152;&#25285;&#24515;&#30340;&#65292; &#35745;&#31639;&#26426;&#35270;&#35273;&#30340;&#21457;&#23637;&#22826;&#24037;&#31243;&#21270;&#12289;&#21151;&#21033;&#21270;&#20102;&#65292;&#36880;&#27493;&#33073;&#31163;&#20102;&#31185;&#23398;&#30340;&#33539;&#30068;&#12290;&#36825;&#26159;&#30701;&#35270;&#21644;&#21361;&#38505;&#30340;&#12290;&#26368;&#36817;&#21448;&#21463;&#21040;&#26426;&#22120;&#23398;&#20064;&#26469;&#30340;&#20914;&#20987;&#12290;</p>
<p>2012 &#24180;&#65292;&#25105;&#20316;&#20026;&#22269;&#38469;&#35745;&#31639;&#26426;&#35270;&#35273;&#21644;&#27169;&#24335;&#35782;&#21035;&#24180;&#20250;&#65288;CVPR&#65289;&#30340;&#22823;&#20250;&#20027;&#24109;&#65292; &#23601;&#21457;&#29983;&#19968;&#20010;&#20107;&#20214;&#12290;&#25910;&#21040;&#31070;&#32463;&#32593;&#32476;&#21644;&#26426;&#22120;&#23398;&#20064;&#23398;&#27966;&#30340;&#19968;&#20010;&#39046;&#20891;&#20154;&#29289; LeCun &#30340;&#25265;&#24616;&#20449;&#65292;&#20182;&#30340;&#35770;&#25991;&#25253;&#21578;&#20102;&#24456;&#22909;&#30340;&#23454;&#39564;&#32467;&#26524;&#65292; &#20294;&#26159;&#23457;&#31295;&#30340;&#19977;&#20010;&#20154;&#37117;&#35748;&#20026;&#35770;&#25991;&#35828;&#19981;&#28165;&#26970;&#21040;&#24213;&#20026;&#20160;&#20040;&#26377;&#36825;&#20010;&#32467;&#26524;&#65292;&#23601;&#25298;&#31295;&#12290;&#20182;&#19968;&#27668;&#20043;&#19979;&#23601;&#35828;&#20877;&#20063;&#19981;&#32473; CVPR &#25237;&#31295;&#20102;&#65292;&#25226;&#23457;&#31295;&#24847;&#35265;&#25346;&#22312;&#32593;&#19978;&#20197;&#31034;&#25239;&#35758;&#12290; 2012 &#24180;&#26159;&#20010;&#36716;&#25240;&#28857;&#12290;</p>
<p>&#29616;&#22312;&#21602;&#65311;&#38543;&#30528;&#28145;&#24230;&#23398;&#20064;&#30340;&#32418;&#28779;&#65292; &#36825;&#19977;&#23618;&#23601;&#21448;&#28151;&#22312;&#19968;&#22359;&#21435;&#20102;&#12290; &#19968;&#33324;&#35770;&#25991;&#30452;&#25509;&#23601;&#25253;&#21578;&#32467;&#26524;&#65292; &#19968;&#22534;&#34920;&#26684;&#12289;&#26354;&#32447;&#22270;&#12290;&#25105;&#23601;&#26159;&#36825;&#20040;&#20570;&#65292;&#28982;&#21518;&#20877;&#36825;&#20040;&#20570;&#65292;&#25105;&#22312;&#26576;&#20123;&#20010;&#25968;&#25454;&#38598;&#19978;&#25552;&#39640;&#20102;&#20004;&#20010;&#30334;&#20998;&#28857;&#65292;&#37027;&#23601;&#34892;&#20102;&#12290;&#20320;&#23457;&#31295;&#20154;&#20063;&#21035;&#38382;&#25105;&#36825;&#20010;&#19996;&#35199;&#37324;&#38754;&#26377;&#20160;&#20040;&#36129;&#29486;&#65292;&#21738;&#20010;&#33410;&#28857;&#20195;&#34920;&#26159;&#20160;&#20040;&#24847;&#24605;&#65292;&#20320;&#21035;&#38382;&#65292;&#25105;&#20063;&#19981;&#30693;&#36947;&#12290;&#37027;&#31639;&#27861;&#25910;&#25947;&#20102;&#21527;&#65311;&#26159;&#20840;&#23616;&#25910;&#25947;&#36824;&#26159;&#19968;&#20010;&#23616;&#37096;&#25910;&#25947;&#65311;&#25105;&#20063;&#19981;&#30693;&#36947;&#65292;&#20294;&#26159;&#25105;&#23601;&#25552;&#39640;&#20102;&#20004;&#20010;&#30334;&#20998;&#28857;&#12290;</p>
<p>&#26417;&#65306;&#30340;&#30830;&#12290;&#25105;&#20204;&#24403;&#24180;&#32771;&#33521;&#35821;&#65292; &#22810;&#21322;&#26159;&#35835;&#65292;&#35828;&#21644;&#20889;&#37117;&#19981;&#34892;&#12290;&#25105;&#20204;&#32771; TOEFL&#65292; GRE Verbal &#30340;&#26102;&#20505;&#65292; &#23601;&#31639;&#27809;&#25630;&#25026;&#65292; &#20063;&#33021;&#33945;&#20010; 60%-70%&#12290; &#26032;&#19996;&#26041;&#30340;&#39064;&#28023;&#25112;&#26415;&#20063;&#24456;&#22863;&#25928;&#12290;&#24403;&#20320;&#20570;&#20102;&#22823;&#37327;&#32771;&#39064;&#65292; &#23601;&#31639;&#19981;&#25026;&#65292; &#20063;&#33021;&#32771;&#22909;&#12290;&#24403;&#21069;&#22823;&#25968;&#25454;&#12289;&#26426;&#22120;&#23398;&#20064;&#23601;&#29992;&#39064;&#28023;&#25112;&#26415;&#12290;&#36825;&#20010;&#26041;&#27861;&#24378;&#35843;&#22312;&#23454;&#25112;&#20013;&#26816;&#39564;&#65292;&#32771;&#20160;&#20040;&#23601;&#25340;&#21629;&#22797;&#20064;&#20160;&#20040;&#65292;&#19981;&#32771;&#30340;&#19996;&#35199;&#23601;&#19981;&#23398;&#65292;&#36825;&#20063;&#24456;&#26377;&#36947;&#29702;&#65292;&#24456;&#30452;&#25509;&#65292; &#26469;&#24471;&#24555;&#12290; &#20294;&#26159;&#65292; &#22240;&#20026;&#20320;&#30340;&#27169;&#22411;&#27809;&#26377;&#30495;&#27491;&#29702;&#35299;&#65292; &#27809;&#26377;&#8220;&#30495;&#25026;&#8221;&#65292;&#32771;&#35797;&#22823;&#32434;&#22806;&#38754;&#30340;&#19996;&#35199;&#26356;&#19981;&#25026;&#65292; &#37027;&#20040;&#21518;&#36951;&#30151;&#23601;&#26159;&#65292; &#36935;&#21040;&#26032;&#32771;&#39064;&#65292; &#32570;&#20047;&#27867;&#21270;&#33021;&#21147;&#65292;&#36935;&#21040;&#26032;&#38382;&#39064;&#65292;&#32570;&#20047;&#21019;&#36896;&#21147;&#12290;</p>
<dl>
<dt><a href="https://www.zhihu.com/question/53134248">&#22914;&#20309;&#35780;&#20215; UCLA &#26417;&#26494;&#32431;&#25945;&#25480;&#36817;&#26085;&#35775;&#35848;&#20013;&#23545;&#28145;&#24230;&#23398;&#20064;&#30340;&#25209;&#35780;&#65311; - &#30693;&#20046;</a> <code class="fold">@</code></dt>
<dd><p>&#20316;&#32773;&#65306;&#30000;&#28170;&#26635;</p>
<p>&#26417;&#25945;&#25480;&#35828;&#30340;&#37117;&#26159;&#23545;&#30340;&#65292;&#29616;&#22312;&#30830;&#23454;&#26377;&#36825;&#20010;&#38382;&#39064;&#12290;&#20294;&#29616;&#23454;&#24773;&#20917;&#26159;&#65292;&#20570;&#29702;&#35770;&#38656;&#35201;&#30340;&#22522;&#30784;&#30693;&#35782;&#22810;&#65292;&#22256;&#38590;&#65292;&#21608;&#26399;&#38271;&#65292;&#27809;&#26377;&#30452;&#25509;&#32463;&#27982;&#25928;&#30410;&#65292;&#36824;&#21482;&#33021;&#19968;&#20004;&#20010;&#20154;&#21333;&#25171;&#29420;&#26007;&#19988;&#26080;&#27861;&#20351;&#29992;&#22823;&#37327;&#35745;&#31639;&#36164;&#28304;&#65292;&#27599;&#20010;&#22240;&#32032;&#37117;&#21644;&#29616;&#22312;&#30340;&#20027;&#27969;&#21457;&#23637;&#26041;&#21521;&#65288;&#24378;&#35843;&#22242;&#38431;&#21512;&#20316;&#65292;&#24378;&#35843;&#36895;&#24230;&#21644;&#26032;&#38395;&#24615;&#65292;&#20195;&#30721;&#24320;&#28304;&#65292;&#22823;&#25968;&#25454;&#65292;&#22823;&#37327;&#35745;&#31639;&#36164;&#28304;&#65289;&#32972;&#36947;&#32780;&#39536;&#12290;&#26356;&#40635;&#28902;&#30340;&#26159;&#65292;&#36763;&#33510;&#20960;&#24180;&#20570;&#20986;&#26469;&#20063;&#26410;&#24517;&#20250;&#26377;&#20154;&#27427;&#36175;&#65292;&#20570;&#30340;&#20154;&#32047;&#65292;&#30475;&#30340;&#20154;&#26356;&#32047;&#65292;&#20110;&#26159;&#22909;&#25991;&#23601;&#28153;&#27809;&#22312;&#22823;&#37327;&#30340; Arxiv &#37324;&#38754;&#12290;&#20598;&#23572;&#26377;&#20960;&#20010;&#20154;&#24819;&#21435;&#30475;&#30475;&#65292;&#36153;&#23613;&#21147;&#27668;&#21364;&#21457;&#29616;&#26576;&#20010;&#20551;&#35774;&#22826;&#24378;&#65292;&#23436;&#20840;&#21644;&#29616;&#23454;&#25199;&#19981;&#19978;&#65292;&#19981;&#20813;&#22833;&#26395;&#12290;&#30456;&#27604;&#20043;&#19979;&#20570;&#24212;&#29992;&#30340;&#25991;&#31456;&#23454;&#39564;&#28165;&#26970;&#25928;&#26524;&#26126;&#26174;&#36824;&#31435;&#21363;&#21487;&#29992;&#65292;&#22823;&#23478;&#19968;&#26395;&#20415;&#30693;&#65292;&#21517;&#22768;&#21709;&#65292;&#24341;&#29992;&#22810;&#65292;&#26333;&#20809;&#29575;&#39640;&#12290;</p>
<p>&#25152;&#20197;&#29702;&#35770;&#26159;&#20570;&#32473;&#33258;&#24049;&#30475;&#30340;&#65292;&#26377;&#28857;&#24773;&#24576;&#30340;&#20154;&#25165;&#20570;&#29702;&#35770;&#12290;&#19968;&#19975;&#20010;&#30805;&#22763;&#21338;&#22763;&#37324;&#26377;&#19968;&#20010;&#24576;&#30528;&#36825;&#20010;&#29702;&#24819;&#65292;&#37027;&#36831;&#26089;&#26377;&#19968;&#22825;&#20250;&#20570;&#20986;&#26469;&#30340;&#65292;&#22823;&#37096;&#20998;&#20154;&#19981;&#29992;&#36153;&#36825;&#20010;&#21147;&#27668;&#30340;&#12290;&#36825;&#20063;&#31526;&#21512;&#24066;&#22330;&#38656;&#27714;&#65292;&#27809;&#26377;&#20160;&#20040;&#19981;&#22909;&#12290;&#35201;&#26159;&#22823;&#23478;&#37117;&#21435;&#20570;&#29702;&#35770;&#20102;&#65292;&#37027;&#27809;&#26377;&#24212;&#29992;&#25104;&#26524;&#65292;&#28145;&#24230;&#23398;&#20064;&#36824;&#24590;&#20040;&#28779;&#19979;&#21435;&#65311;&#23545;&#20570;&#29702;&#35770;&#30340;&#20154;&#26469;&#35828;&#65292;&#31454;&#20105;&#28608;&#28872;&#20102;&#65292;&#23601;&#26356;&#27809;&#26377;&#24930;&#24930;&#24819;&#30340;&#26102;&#38388;&#21644;&#31354;&#38388;&#20102;&#12290;</p>
<p>&#21478;&#22806;&#65292;&#26368;&#36817;&#25105;&#25237;&#30340;&#37027;&#31687;&#20108;&#23618; ReLU &#30340;&#29702;&#35770;&#20998;&#26512;&#65292;&#20174;&#26377;&#20102;&#29702;&#35770;&#21040;&#25104;&#31295;&#23601;&#20570;&#20102;&#20004;&#20010;&#26376;&#65292;&#24182;&#27809;&#26377;&#33457;&#20960;&#24180;&#65292;&#20043;&#21069;&#19968;&#30452;&#26041;&#21521;&#19981;&#23545;&#22312;&#30606;&#25630;&#12290;&#12304;&#25105;&#30340;&#24863;&#35302;&#26159;&#65292;&#30495;&#30340;&#26377;&#20102;&#24863;&#35273;&#65292;&#20986;&#25991;&#31456;&#19981;&#20250;&#24930;&#30340;&#65292;&#20294;&#26159;&#22312;&#26377;&#24863;&#35273;&#20043;&#21069;&#65292;&#35201;&#20570;&#24456;&#22810;&#31215;&#32047;&#65292;&#33457;&#25481;&#24456;&#22810;&#26102;&#38388;&#65292;&#36825;&#20010;&#38454;&#27573;&#21448;&#33510;&#21448;&#38590;&#29100;&#65292;&#29616;&#19979;&#24456;&#23569;&#26377;&#20154;&#24895;&#24847;&#12290;&#12305;&#20294;&#33509;&#26159;&#30495;&#24819;&#20570;&#29702;&#35770;&#30340;&#35805;&#65292;&#19981;&#35201;&#34987;&#20960;&#24180;&#36825;&#31181;&#35805;&#21523;&#20303;&#20102;&#65292;&#20687;&#25105;&#36825;&#31181;&#21322;&#36335;&#33258;&#23398;&#65292;&#32943;&#23450;&#26159;&#36208;&#20102;&#24367;&#36335;&#24320;&#24735;&#26202;&#30340;&#65292;&#23601;&#19981;&#29992;&#24403;&#20363;&#23376;&#20102;&#65292;&#31185;&#29677;&#20986;&#36523;&#30340;&#32943;&#23450;&#20250;&#24555;&#24456;&#22810;&#12290;</p>
<p>&#26368;&#21518;&#24863;&#35874;&#19968;&#19979;&#30475;&#36807;&#25105;&#25991;&#31456;&#30340;&#21516;&#23398;&#65292;&#36763;&#33510;&#20102;&#65281;</p>
</dd>
</dl>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://en.wikipedia.org/wiki/Tanenbaum%E2%80%93Torvalds_debate">Tanenbaum&#8211;Torvalds debate - Wikipedia</a> <code class="fold">@</code></dt>
<dd><p>The Tanenbaum&#8211;Torvalds debate was a debate between Andrew S. Tanenbaum and Linus Torvalds, regarding the Linux kernel and kernel architecture in general. Tanenbaum began the debate in 1992 on the Usenet discussion group comp.os.minix, arguing that microkernels are superior to monolithic kernels and therefore Linux was, even in 1992, obsolete. Linux kernel developers Peter MacDonald, David S. Miller and Theodore Ts&#8217;o also joined the debate.</p>
<p>The debate has sometimes been considered <strong>a flame war</strong>.</p>
<div class="figure">
<img src="https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Kernel-monolithic.svg/330px-Kernel-monolithic.svg.png" alt="Graphic of a monolithic kernel running kernel space entirely in supervisor mode" />
<p class="caption">Graphic of a monolithic kernel running kernel space entirely in supervisor mode</p>
</div>
<div class="figure">
<img src="https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Kernel-microkernel.svg/330px-Kernel-microkernel.svg.png" alt="Microkernel architecture relies on user-space server programs" />
<p class="caption">Microkernel architecture relies on user-space server programs</p>
</div>
<p>Despite this debate, Torvalds and Tanenbaum appear to be on good speaking terms; Torvalds wants it understood that he holds no animosity towards Tanenbaum, and Tanenbaum underlines that disagreements about ideas or technical issues should not be interpreted as personal feuds.</p>
</dd>
</dl></li>
<li><p><a href="https://github.com/xiaoweiChen/Cpp_Concurrency_In_Action">xiaoweiChen/Cpp_Concurrency_In_Action: &#20316;&#20026;&#23545;&#12298;C++ Concurrency in Action&#12299;&#33521;&#25991;&#29256;&#30340;&#20013;&#25991;&#32763;&#35793;&#12290;</a></p></li>
<li><p><a href="https://github.com/mrdoob/three.js/wiki/How-to-run-things-locally">How to run things locally &#183; mrdoob/three.js Wiki</a></p></li>
<li><p><a href="http://edutechwiki.unige.ch/en/3D_file_format" class="hearts">3D file format - EduTech Wiki</a></p></li>
<li><dl>
<dt>diff highlight <code class="fold">@</code></dt>
<dd><div class="sourceCode"><pre class="sourceCode diff"><code class="sourceCode diff"><span class="kw">diff --git a/src/nvim/api/ui.c b/src/nvim/api/ui.c</span>
index 56b41f1..9178538 100644
<span class="dt">--- a/src/nvim/api/ui.c</span>
<span class="dt">+++ b/src/nvim/api/ui.c</span></code></pre></div>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.douban.com/people/79049984/status/1920469338/">&#30707;&#33487;&#30340;&#24191;&#25773;&#65306;&#21160;&#33041;&#23376;</a> <code class="fold">@</code></dt>
<dd><p>&#20174;&#25104;&#26412;&#30340;&#35282;&#24230;&#26469;&#35828;&#65292;&#21160;&#33041;&#23376;&#30340;&#25104;&#26412;&#26159;&#26368;&#20302;&#30340;&#12290;&#26368;&#22909;&#30340;&#25237;&#36164;&#26041;&#24335;&#26159;&#65292;&#22823;&#33041;&#21457;&#36798;&#65292;&#31574;&#30053;&#21644;&#39118;&#38505;&#37117;&#24819;&#22909;&#20102;&#65292;&#21160;&#20960;&#19979;&#38190;&#30424;&#65292;&#28982;&#21518;&#31561;&#30528;&#36186;&#38065;&#12290;&#20854;&#20182;&#26102;&#38388;&#20581;&#36523;&#20241;&#24687;&#32654;&#39135;&#12290;&#38500;&#27492;&#20043;&#22806;&#65292;&#25104;&#26412;&#37117;&#27604;&#36825;&#20010;&#39640;&#65292;&#30456;&#23545;&#26469;&#35828;&#65292;&#23545;&#36523;&#20307;&#21644;&#28789;&#39746;&#30340;&#25439;&#32791;&#26356;&#22823;&#12290;&#25439;&#32791;&#26368;&#22823;&#30340;&#65292;&#26159;&#36145;&#19994;&#8230;</p>
<p>&#36731;&#26494;&#65292;&#24320;&#24515;&#65292;&#31526;&#21512;&#39044;&#26399;&#22320;&#36186;&#38065;&#65292;&#26159;&#26368;&#22823;&#30340;&#20462;&#34892;&#8230; ^_^</p>
<p>&#20215;&#20540;&#35266;&#24456;&#37325;&#35201;&#65292;&#23588;&#20854;&#26159;&#22312;&#21830;&#19994;&#36825;&#31181;&#31454;&#20105;&#28608;&#28872;&#30340;&#22320;&#26041;&#65292;&#19968;&#20010;&#32452;&#32455;&#30340;&#20215;&#20540;&#35266;&#26159;&#38656;&#35201;&#28789;&#39746;&#20154;&#29289;&#21453;&#22797;&#20197;&#36523;&#20570;&#21017;&#23454;&#36341;&#40723;&#21160;&#12290;&#20215;&#20540;&#35266;&#21644;&#34892;&#20026;&#24517;&#39035;&#19968;&#33268;&#65292;&#20320;&#27809;&#27861;&#19981;&#19968;&#33268;&#65292;&#20320;&#22914;&#26524;&#23459;&#20256;&#30340;&#20215;&#20540;&#35266;&#21644;&#20320;&#30340;&#34892;&#20026;&#33073;&#33410;&#65292;&#20854;&#20182;&#20154;&#24456;&#23481;&#26131;&#30475;&#22312;&#30524;&#37324;&#65292;&#36319;&#30528;&#20063;&#35013;&#35013;&#26679;&#23376;&#65292;&#25972;&#20010;&#32452;&#32455;&#30340;&#25112;&#26007;&#21147;&#24456;&#24555;&#23601;&#27809;&#20102;&#12290;</p>
<p>&#25105;&#23545;&#20154;&#24615;&#39047;&#19981;&#36866;&#24212;&#65292;&#20063;&#26159;&#25105;&#22353;&#20154;&#30340;&#26102;&#20505;&#21457;&#29616;&#30340;&#12290;&#25105;&#25343;&#21035;&#20154;&#24403;&#26379;&#21451;&#30340;&#26102;&#20505;&#65292;&#36935;&#21040;&#38382;&#39064;&#20250;&#30452;&#25509;&#35828;&#65292;&#25514;&#36766;&#24403;&#28982;&#20250;&#35880;&#24910;&#65292;&#20294;&#24120;&#24120;&#24471;&#32618;&#20154;&#65292;&#21050;&#21040;&#20154;&#12290;&#24403;&#25105;&#20934;&#22791;&#22353;&#20154;&#30340;&#26102;&#20505;&#65292;&#25105;&#22312;&#23427;&#38754;&#21069;&#20250;&#35878;&#34394;&#35013;&#24369;&#23567;&#35013;&#33510;&#36924;&#65292;&#22823;&#25293;&#39532;&#23617;&#65292;&#36855;&#24785;&#23427;&#65292;&#32972;&#22320;&#37324;&#19979;&#29408;&#25163;&#65292;&#20320;&#36947;&#24590;&#26679;&#65311;&#23427;&#24456;&#20139;&#21463;&#36825;&#31181;&#24863;&#35273;&#65292;&#21453;&#32780;&#25226;&#25105;&#24403;&#22909;&#26379;&#21451;&#20160;&#20040;&#37117;&#35828;&#12290;&#25105;&#25805;&#65292;&#21453;&#24046;&#21463;&#19981;&#20102;&#12290;</p>
<p>&#36825;&#21487;&#26159;&#32874;&#26126;&#20154;&#30456;&#23545;&#22810;&#22351;&#20154;&#30456;&#23545;&#22810;&#30340;&#37329;&#34701;&#19994;&#21834;&#65292;&#20063;&#21040;&#22788;&#26159;&#20805;&#28385;&#20154;&#24615;&#24369;&#28857;&#30340;&#31528;&#34507;&#65292;&#19981;&#20998;&#22909;&#22351;&#8230;&#25152;&#20197;&#25105;&#35273;&#24471;&#8230; &#22823;&#37096;&#20998;&#20154;&#30495;&#24515;&#26159;&#32650;&#8230; &#35828;&#35805;&#22909;&#21548;&#30340;&#20154;&#8230;&#19968;&#23450;&#23545;&#20320;&#27809;&#26377;&#22826;&#22810;&#30495;&#24515;&#8230;</p>
<p>&#20294;&#65292;&#22914;&#26524;&#20320;&#23545;&#35841;&#20184;&#20986;&#30495;&#24515;&#65292;&#20320;&#19968;&#23450;&#20250;&#20498;&#38665;&#65292;&#19968;&#23450;&#26159;&#22833;&#21435;&#36825;&#20010;&#20154;&#8230; &#20320;&#20307;&#20250;&#19979;&#8230; &#25152;&#20197;&#65292;&#20154;&#26159;&#24456;&#40635;&#28902;&#30340;&#20667;&#21449;&#21160;&#29289;&#65292;&#31163;&#36828;&#28857;&#8230;&#23613;&#37327;&#20445;&#25345;&#36317;&#31163;&#8230; &#30495;&#30340;&#8230;.</p>
<p>&#22312;&#32844;&#22330;&#65292;&#20320;&#24819;&#24448;&#19978;&#29228;&#32477;&#23545;&#20250;&#24471;&#32618;&#20154;&#65292;&#32477;&#23545;&#20250;&#12290;&#21516;&#20107;&#20132;&#24448;&#20013;&#35268;&#20013;&#30697;&#23601;&#34892;&#20102;&#65292;&#27809;&#20160;&#20040;&#24517;&#35201;&#36319;&#22823;&#23478;&#25171;&#25104;&#19968;&#29255;&#65292;&#36825;&#26159;&#26080;&#29992;&#21151;&#12290;&#20320;&#30340;&#20215;&#20540;&#20307;&#29616;&#22312;&#20320;&#23545;&#19994;&#32489;&#30340;&#36129;&#29486;&#19978;&#12290;&#23601;&#20973;&#31471;&#33590;&#20498;&#27700;&#37027;&#28857;&#23567;&#24681;&#23567;&#24800;&#24819;&#21483;&#20154;&#23478;&#25552;&#25300;&#20320;&#24110;&#20320;&#26159;&#19981;&#21487;&#33021;&#30340;&#65292;&#20320;&#26367;&#20182;&#25343;&#19968;&#30334;&#27425;&#24555;&#36882;&#65292;&#19981;&#22914;&#24110;&#20182;&#35299;&#20915;&#19968;&#27425;&#24037;&#20316;&#38556;&#30861;&#20316;&#29992;&#22823;&#12290;&#19981;&#21892;&#20132;&#38469;&#36825;&#20214;&#20107;&#26159;&#20010;&#24456;&#20013;&#24615;&#30340;&#35789;&#12290;&#20320;&#24819;&#24819;&#12290;</p>
<p>&#35273;&#24471;&#33258;&#24049;&#22312;&#27491;&#33021;&#37327;&#24230;&#20247;&#29983;&#30340;&#65292;&#31934;&#31070;&#30149;&#27010;&#29575;&#27604;&#36739;&#22823;&#65292;&#20837;&#39764;&#27010;&#29575;&#27604;&#36739;&#22823;&#8230;</p>
<p>&#25152;&#20197;&#65292;&#32463;&#27982;&#23398;&#65292;&#30475;&#30475;&#23601;&#22909;&#65292;&#21035;&#24403;&#30495;&#12290;&#22312;&#21746;&#23398;&#19978;&#28431;&#27934;&#30334;&#20986;&#12290;&#22810;&#36186;&#38065;&#22810;&#20570;&#29983;&#24847;&#65292;&#27604;&#25630;&#23398;&#38382;&#30340;&#20154;&#30340;&#29702;&#35299;&#21147;&#20250;&#24378;&#24456;&#22810;&#12290;&#32463;&#27982;&#23398;&#27809;&#21861;&#29992;&#12290;</p>
<p>refs and see also</p>
<ul>
<li><a href="http://mp.weixin.qq.com/s/dUOE74jQhP8ehvU59HH8ww">&#27743;&#21335;&#24868;&#38738;&#65306;&#36186;&#38065;&#65292;&#26159;&#26368;&#22823;&#30340;&#20462;&#34892;&#65281;</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.douban.com/note/593982718/">&#12302;&#38463;&#30007;&#38386;&#32842;&#12303;&#65290;&#23398;&#20064;&#31185;&#23398;&#21746;&#23398;&#26159;&#21487;&#26377;&#21487;&#26080;&#30340;&#21527;&#65311;&#65290;</a> <code class="fold">@</code></dt>
<dd><p>Mathematics is the only true metaphysics.</p>
<p>&#8211; Lord Kelvin</p>
<p>&#22914;&#26524;&#35828;&#31185;&#23398;&#26159;&#30740;&#31350;&#19990;&#30028;&#30340;&#26041;&#27861;&#65292;&#37027;&#20040;&#31185;&#23398;&#21746;&#23398;&#23601;&#26159;&#30740;&#31350;&#26041;&#27861;&#30340;&#26041;&#27861;&#12290;</p>
<p>&#29233;&#22240;&#26031;&#22374;&#20889;&#36807;&#19968;&#26412;&#32463;&#20856;&#30340;&#29289;&#29702;&#23398;&#26041;&#38754;&#30340;&#31185;&#23398;&#21746;&#23398;&#33879;&#20316;&#65306;Evolution of Physics</p>
<p>&#35762;&#30340;&#26159;&#29289;&#29702;&#23398;&#30340;&#29702;&#35770;&#20307;&#31995;&#26159;&#22914;&#20309;&#24314;&#31435;&#36215;&#26469;&#30340;&#65292;&#25991;&#31508;&#38750;&#24120;&#22909;&#65292;&#25512;&#33616;&#32473;&#22823;&#23478;&#12290;</p>
<p>&#22914;&#26524;&#20320;&#24320;&#22987;&#35273;&#24471;&#26377;&#38656;&#35201;&#30340;&#26102;&#20505;&#65292;&#37027;&#23601;&#19981;&#29992;&#29369;&#35947;&#20102;&#65292;&#23398;&#36215;&#26469;&#65281;&#31185;&#23398;&#21746;&#23398;&#39046;&#22495;&#30340;&#33879;&#20316;&#37117;&#38750;&#24120;&#33392;&#28145;&#65292;&#36825;&#26159;&#24456;&#27491;&#24120;&#30340;&#65292;&#22240;&#20026;&#20219;&#20309;&#21644;&#8220;meta&#8221;&#27838;&#36793;&#30340;&#65292;&#27604;&#22914; meta-programming&#65292;&#37117;&#26159;&#39640;&#38454;&#39046;&#22495;&#65292;&#32943;&#23450;&#35201;&#26356;&#25277;&#35937;&#65292;&#26356;&#25277;&#35937;&#23601;&#24847;&#21619;&#30528;&#26356;&#38590;&#12290;&#32780;&#33521;&#25991;&#21448;&#29305;&#21035;&#36866;&#21512;&#36825;&#31181;&#32467;&#26500;&#21270;&#30340;&#39640;&#38454;&#39046;&#22495;&#65292;&#25152;&#20197;&#25361;&#25112;&#20320;&#30340;&#38405;&#35835;&#33021;&#21147;&#30340;&#26102;&#20505;&#23601;&#21040;&#20102;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt>Marc Andreessen &#35821;&#36895;&#24555;&#30340;&#24778;&#20154; <code class="fold">@</code></dt>
<dd><p><a href="https://en.wikipedia.org/wiki/Marc_Andreessen">Marc Andreessen - Wikipedia</a></p>
</dd>
</dl></li>
<li><p><a href="https://www.zhihu.com/question/19586527">Tcl &#21644; TK &#36824;&#26377; Perl &#65292;&#21738;&#20010;&#29992;&#30340;&#27604;&#36739;&#22810;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://douban.fm/?start=63334geeeag26992&amp;cid=2063334">&#33016;&#12364;&#12489;&#12461;&#12489;&#12461; &#31995; MHz</a></p></li>
<li><p><a href="https://www.zhihu.com/question/23427617">&#22914;&#20309;&#26500;&#24314;&#33258;&#24049;&#30340;&#31508;&#35760;&#31995;&#32479;&#65311; - &#30693;&#20046;</a></p></li>
<li><dl>
<dt>&#27573;&#23376;&#20043;&#22235;&#26412;&#20070; <code class="fold">@</code></dt>
<dd><p>&#21508;&#20301;&#27494;&#27721;&#21508;&#20010;&#23398;&#26657;&#30340;&#21516;&#23398;&#65292;&#22914;&#26524;&#20320;&#20204;&#24819;&#36827;&#20837;&#20114;&#32852;&#32593;&#34892;&#19994;&#65292;&#24314;&#35758;&#20320;&#20204;&#35835;&#22914;&#19979;&#22235;&#26412;&#36890;&#20439;&#20837;&#38376;&#35835;&#29289;&#65292;&#22823;&#33268;&#20102;&#35299;&#20114;&#32852;&#32593;&#20844;&#21496;&#30340;&#36816;&#20316;&#12290;&#65288;&#31616;&#21382;&#37324;&#29978;&#33267;&#21487;&#20197;&#19968;&#20123;&#36825;&#20123;&#20070;&#30340;&#35266;&#28857;&#65289;</p>
<ul>
<li>&#31532;&#19968;&#26412;&#65306;&#26080;&#39035;&#31561;&#24453;:YC &#21512;&#20249;&#20154;&#30340;&#21019;&#19994;&#35838;</li>
<li>&#31532;&#20108;&#26412;&#65306;YC &#21019;&#19994;&#33829;: &#30789;&#35895;&#39030;&#32423;&#21019;&#19994;&#23413;&#21270;&#22120;&#22914;&#20309;&#25913;&#21464;&#19990;&#30028;</li>
<li>&#31532;&#19977;&#26412;&#65306;&#31934;&#30410;&#21019;&#19994;: &#26032;&#21019;&#20225;&#19994;&#30340;&#25104;&#38271;&#24605;&#32500;&#65307;</li>
<li>&#31532;&#22235;&#26412;&#65306;&#22235;&#27493;&#21019;&#19994;&#27861;</li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt>Hadoop &amp; MapReduce <code class="fold">@</code></dt>
<dd><p>Apache Hadoop (pronunciation: <code>/h&#601;&#712;du&#720;p/</code>) is an open-source software framework for distributed storage and distributed processing of very large data sets on computer clusters built from commodity hardware. All the modules in Hadoop are designed with a fundamental assumption that hardware failures are common and should be automatically handled by the framework.</p>
<p>refs and see also</p>
<ul>
<li><a href="http://blog.csdn.net/xyilu/article/details/9066973">MapReduce &#23454;&#29616;&#22823;&#30697;&#38453;&#20056;&#27861; - &#33905;&#33905;&#30340;&#22478;&#22561; - &#21338;&#23458;&#39057;&#36947; - CSDN.NET</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://bugzilla.gnome.org/show_bug.cgi?id=675885">Bug 675885 &#8211; Gnome-font-viewer&#8217;s Chinese font-testing sentence needs to be changed</a> <code class="fold">@</code></dt>
<dd><p>&#36319;&#32769;&#22806;&#35762;&#20013;&#25991;&#12290;&#12290;&#12290;&#24863;&#35273;&#22909;&#29275;&#36924;&#12290;&#34429;&#28982;&#20013;&#25991;&#19981;&#36866;&#21512;&#20351;&#29992;&#21644;&#23398;&#20064;&#65292;&#20294;&#26159;&#35013;&#36924;&#36215;&#26469;&#30830;&#23454;&#24456;&#36190;&#65288;&#25105;&#23601;&#19981;@&#34382;&#22522;&#20102;&#65289;</p>
</dd>
</dl></li>
<li><p><a href="https://zhuanlan.zhihu.com/p/19901454?columnSlug=junoma">Bridge&#8212;&#8212;&#35774;&#35745;&#24072; Juno &#30340;&#32456;&#26497;&#22270;&#20687;&#31649;&#29702;&#26415; - &#35774;&#35745;&#24072; Juno - &#30693;&#20046;&#19987;&#26639;</a></p></li>
<li><dl>
<dt><a href="https://www.zhihu.com/question/33579847">&#26085;&#26412;&#21160;&#28459;&#29233;&#22909;&#32773;&#20204;&#26159;&#21542;&#21487;&#20197;&#19981;&#30693;&#19981;&#35273;&#22320;&#23398;&#25026;&#26085;&#35821;&#65311; - &#30693;&#20046;</a> <code class="fold">@</code></dt>
<dd><p>&#23398;&#22806;&#35821;&#19968;&#20010;&#24456;&#37325;&#35201;&#30340;&#27010;&#24565;&#26159;&#8220;&#28378;&#38634;&#29699;&#8221;&#65292;&#20320;&#39318;&#20808;&#24471;&#26377;&#22522;&#30784;&#65292;&#20320;&#25165;&#33021;&#36234;&#26469;&#36234;&#21385;&#23475;&#12290;</p>
<p>&#32780;&#36825;&#20010;&#22522;&#30784;&#65292;&#26159;&#38656;&#35201;&#19979;&#33510;&#21151;&#22827;&#30340;&#12290;</p>
<p>&#20320;&#30475;&#21160;&#30011;&#30475;&#32654;&#21095;&#33021;&#32451;&#20986;&#35821;&#24863;&#65292;&#29978;&#33267;&#21487;&#33021;&#36824;&#33021;&#32473;&#20320;&#24102;&#26469;&#22909;&#30340;&#21475;&#38899;&#65292;&#20294;&#36825;&#20123;&#22312;&#20320;&#27809;&#26377;&#22522;&#30784;&#30693;&#35782;&#30340;&#24773;&#20917;&#19979;&#36830;&#31481;&#31726;&#25171;&#27700;&#37117;&#19981;&#22914;&#8212;&#8212;&#31481;&#31726;&#22909;&#27513;&#24102;&#28857;&#27700;&#28404;&#19978;&#26469;&#65292;&#20320;&#36825;&#27809;&#26377;&#22522;&#30784;&#30693;&#35782;&#31561;&#21516;&#20110;&#22312;&#31354;&#27668;&#37324;&#24819;&#35201;&#25171;&#27700;&#65306;&#21487;&#33021;&#20320;&#30830;&#23454;&#25171;&#20102;&#19968;&#31726;&#23376;&#31354;&#27668;&#65292;&#28982;&#24182;&#21365;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="http://www.rfcreader.com/">RFC Reader - An online reader for IETF RFCs</a></p></li>
<li><p><a href="http://tools.ietf.org/pdf/usage.shtml">PDF conversion of IETF documents</a></p></li>
<li><p><a href="http://ietfreport.isoc.org/rfc/PDF/">Index of /rfc/PDF</a></p></li>
<li><dl>
<dt>Command Line Args Parser <code class="fold">@</code></dt>
<dd><ul>
<li><a href="https://en.wikipedia.org/wiki/Getopt">C: getopt - Wikipedia, the free encyclopedia</a></li>
<li><a href="http://gflags.github.io/gflags/">C++: How To Use Gflags (formerly Google Commandline Flags)</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt>EnGadget &#30340;&#35780;&#20998; <code class="fold">@</code></dt>
<dd><p>&#35780;&#20998;&#21592;&#65288;moderator&#65289;&#26377;&#26435;&#20026;&#27599;&#26465;&#30041;&#35328;&#25171;&#20998;&#12290;&#25171;&#20998;&#30340;&#26041;&#27861;&#37319;&#29992;&#20998;&#37197;&#24418;&#23481;&#35789;&#65292;&#25152;&#26377;&#21487;&#29992;&#30340;&#24418;&#23481;&#35789;&#20998;&#21035;&#20026; normal&#65288;&#19968;&#33324;&#21457;&#35328;&#65289;&#12289;offtopic&#65288;&#19982;&#20027;&#39064;&#26080;&#20851;&#65289;&#12289;flamebait &#65288;&#25361;&#25320;&#65289;&#12289;troll&#65288;&#27809;&#26377;&#20215;&#20540;&#65289;&#12289;redundant&#65288;&#24223;&#35805;&#65289;&#12289;insightful&#65288;&#21551;&#21457;&#24615;&#65289;&#12289; interesting&#65288;&#26377;&#36259;&#65289;&#12289;informative&#65288;&#25552;&#20379;&#26377;&#29992;&#20449;&#24687;&#65289;&#12289;funny&#65288;&#25630;&#31505;&#65289;&#12289; overrated&#65288;&#35780;&#20215;&#36807;&#39640;&#65289;&#21644; underrated&#65288;&#35780;&#20215;&#36807;&#20302;&#65289;&#12290;&#25152;&#26377;&#27491;&#38754;&#30340;&#24418;&#23481;&#35789;&#20026; +1 &#20998;&#65292;&#25152;&#26377;&#36127;&#38754;&#30340;&#24418;&#23481;&#35789;&#20026; -1 &#20998;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="https://zhuanlan.zhihu.com/linjr">&#26519;&#24314;&#20837;&#30340;&#36719;&#20214;&#35774;&#35745;&#20043;&#36335; - &#30693;&#20046;&#19987;&#26639;</a></p></li>
<li><dl>
<dt><a href="https://zhuanlan.zhihu.com/p/19694823?refer=linjr">&#23398;&#20064; C &#35821;&#35328;&#22522;&#26412;&#24605;&#36335;&#19982;&#21442;&#32771;&#20070;&#31821; - &#26519;&#24314;&#20837;&#30340;&#36719;&#20214;&#35774;&#35745;&#20043;&#36335; - &#30693;&#20046;&#19987;&#26639;</a> <code class="fold">@</code></dt>
<dd><p>&#23398;&#20250;&#35843;&#29992;&#21035;&#20154;&#30340;&#24211;&#20989;&#25968;&#65292;&#29978;&#33267;&#20889;&#20986;&#33258;&#24049;&#30340;&#24211;&#20989;&#25968;&#65292;&#37117;&#26159;&#26497;&#20854;&#37325;&#35201;&#30340;&#12290;&#22240;&#20026;&#19968;&#20010;&#20989;&#25968;&#65292;&#26412;&#36136;&#19978;&#23601;&#26159;&#19968;&#20010;&#21151;&#33021;&#21333;&#20301;&#12290;&#20320;&#25317;&#26377;&#30340;&#22522;&#30784;&#35774;&#26045;&#36234;&#22810;&#65292;&#20320;&#30340;&#21457;&#25381;&#31354;&#38388;&#36234;&#22823;&#12290;&#36947;&#29702;&#23601;&#26159;&#36825;&#20040;&#31616;&#21333;&#12290;&#36825;&#23601;&#26159;&#25105;&#38656;&#35201;&#21521;&#22823;&#23478;&#24378;&#35843;&#30340;&#31532;&#20108;&#20010;&#35266;&#28857;&#65292;&#35201;&#24819;&#20889;&#20986;&#23454;&#29992;&#30340; C &#31243;&#24207;&#65292;&#19968;&#22823;&#20851;&#38190;&#23601;&#26159;&#30740;&#31350;&#24182;&#23398;&#20250;&#20351;&#29992;&#21508;&#31181;&#24211;&#20989;&#25968;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://github.com/Jianru-Lin/lambda-view" class="hearts">Jianru-Lin/lambda-view: &#22797;&#26434; JavaScript &#28304;&#30721;&#38405;&#35835;&#20998;&#26512;&#24037;&#20855;</a> <code class="fold">@</code></dt>
<dd><p>&#26366;&#22312; linux &#19979;&#38405;&#35835; java &#36824;&#26377; c++ &#30340;&#39033;&#30446;&#65292;&#29992;&#30340;&#26159; understand &#26469;&#29983;&#25104; uml &#22270;&#36824;&#26377;&#20989;&#25968;&#35843;&#29992;&#20851;&#31995;&#22270;&#65292;&#19981;&#30693;&#36947;&#26159;&#19981;&#26159;&#25903;&#25345; javascript &#35821;&#35328;&#65292;&#39064;&#20027;&#19981;&#22952;&#19968;&#35797;&#12290;</p>
<ul>
<li><a href="http://whudoc.qiniudn.com/2016/lv/co.js" class="uri">http://whudoc.qiniudn.com/2016/lv/co.js</a></li>
<li><a href="http://whudoc.qiniudn.com/2016/lv/co.js.html" class="uri">http://whudoc.qiniudn.com/2016/lv/co.js.html</a></li>
<li><a href="http://whudoc.qiniudn.com/2016/lv/d3.js" class="uri">http://whudoc.qiniudn.com/2016/lv/d3.js</a></li>
<li><a href="http://whudoc.qiniudn.com/2016/lv/d3.js.html" class="uri">http://whudoc.qiniudn.com/2016/lv/d3.js.html</a></li>
<li><a href="http://whudoc.qiniudn.com/2016/lv/jquery.js" class="uri">http://whudoc.qiniudn.com/2016/lv/jquery.js</a></li>
<li><a href="http://whudoc.qiniudn.com/2016/lv/jquery.js.html" class="uri">http://whudoc.qiniudn.com/2016/lv/jquery.js.html</a></li>
<li><a href="http://whudoc.qiniudn.com/2016/lv/three.js" class="uri">http://whudoc.qiniudn.com/2016/lv/three.js</a></li>
<li><a href="http://whudoc.qiniudn.com/2016/lv/three.js.html" class="uri">http://whudoc.qiniudn.com/2016/lv/three.js.html</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://duotai.org/packages">&#22810;&#24577;</a> <code class="fold">@</code></dt>
<dd><p>&#32763;&#22681;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.computervisionblog.com/2016/01/why-slam-matters-future-of-real-time.html" class="hearts">Tombone&#8217;s Computer Vision Blog: The Future of Real-Time SLAM and Deep Learning vs SLAM</a> <code class="fold">@</code></dt>
<dd><p><a href="http://fzheng.me/2016/05/30/slam-review/">Brief Review on Visual SLAM: A Historical Perspective</a></p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://book.douban.com/review/6417491/">&#25343;&#25746;&#27900;&#24403;&#20010;&#24615;&#12289;&#25343;&#20599;&#31397;&#24403;&#28843;&#32768;&#12289;&#25343;&#24847;&#28139;&#24403;&#30495;&#26538;&#12289;&#25343;&#39059;&#24223;&#24403;&#38738;&#26149;&#65288;&#20174;&#20320;&#30340;&#20840;&#19990;&#30028;&#36335;&#36807;&#65289;&#20070;&#35780;</a> <code class="fold">@</code></dt>
<dd><p>&#20889;&#30701;&#31687;&#23567;&#35828;&#65288;&#32780;&#19981;&#26159;&#24494;&#21338;&#25925;&#20107;&#65289;&#65292;&#25925;&#20107;&#30495;&#23454;&#19981;&#30495;&#23454;&#20498;&#26159;&#27425;&#35201;&#30340;&#65292;&#19981;&#31649;&#20320;&#26159;&#20551;&#27491;&#32463;&#65292;&#36824;&#26159;&#30495;&#33394;&#29378;&#65292;&#20063;&#26080;&#35770;&#26159;&#29233;&#24773;&#36824;&#26159;&#24773;&#29233;&#12289;&#26159;&#20599;&#31397;&#36824;&#26159;&#24847;&#28139;&#12289;&#26159;&#29983;&#27963;&#26412;&#33394;&#36824;&#26159;&#24819;&#35937;&#32534;&#36896;&#65292;&#25925;&#20107;&#32534;&#30340;&#22909;&#19981;&#22909;&#25165;&#26159;&#31532;&#19968;&#20301;&#30340;&#12290;&#32780;&#25925;&#20107;&#32534;&#30340;&#22909;&#22351;&#65292;&#25925;&#20107;&#20013;&#30340;&#20154;&#29289;&#33267;&#20851;&#37325;&#35201;&#12290;&#32780;&#22522;&#26412;&#30340;&#65292;&#20154;&#29289;&#30340;&#34892;&#20026;&#35201;&#31526;&#21512;&#24615;&#26684;&#24515;&#29702;&#30340;&#21457;&#23637;&#21464;&#21270;&#65292;&#20154;&#29289;&#30340;&#24615;&#26684;&#24515;&#29702;&#21464;&#21270;&#35201;&#31526;&#21512;&#19968;&#33324;&#30340;&#36923;&#36753;&#65292;&#36825;&#26679;&#30340;&#20154;&#29289;&#25165;&#26159;&#23567;&#35828;&#20013;&#30340;&#30495;&#23454;&#19982;&#31435;&#20307;&#12290;&#22914;&#26524;&#21482;&#26159;&#20026;&#21338;&#30524;&#29699;&#32780;&#21051;&#24847;&#30606;&#32534;&#65292;&#32780;&#19988;&#19981;&#31649;&#20154;&#29289;&#24515;&#29702;&#21457;&#23637;&#21464;&#21270;&#65292;&#20840;&#31687;&#19968;&#24459;&#22320;&#20805;&#26021;&#30528;&#24819;&#35937;&#30340;&#25925;&#20107;&#21457;&#23637;&#65292;&#29992;&#29983;&#30828;&#30340;&#24773;&#33410;&#26725;&#27573;&#65292;&#33222;&#26029;&#30340;&#23545;&#35805;&#26469;&#34900;&#25509;&#65292;&#29992;&#27809;&#26377;&#33410;&#21046;&#30340;&#32902;&#24847;&#30340;&#35821;&#35328;&#26469;&#21457;&#27844;&#65292;&#21487;&#24819;&#32780;&#30693;&#36825;&#19968;&#23450;&#26159;&#37027;&#28857;&#27442;&#26395;&#30340;&#21457;&#27844;&#26159;&#30001;&#31508;&#26469;&#23436;&#25104;&#30340;&#25925;&#20107;&#65281;</p>
<p>&#28487;&#27922;&#19981;&#26159;&#35013;&#20986;&#26469;&#30340;&#65292;&#26356;&#19981;&#26159;&#25343;&#25746;&#27900;&#24403;&#20010;&#24615;&#12289;&#25343;&#20599;&#31397;&#24403;&#28843;&#32768;&#12289;&#25343;&#24847;&#28139;&#24403;&#30495;&#26538;&#12289;&#25343;&#39059;&#24223;&#24403;&#38738;&#26149;&#65292;&#36825;&#23454;&#22312;&#26159;&#26377;&#28857;&#20266;&#23064;&#26041;&#24335;&#30340;&#20570;&#20316;&#19982;&#33258;&#27450;&#20854;&#20154;&#12290;&#28487;&#27922;&#26159;&#38544;&#32422;&#22312;&#20320;&#24494;&#21338;&#20013;&#30475;&#21040;&#30340;&#37027;&#28857;&#19981;&#25954;&#27491;&#35270;&#30340;&#12289;&#34987;&#22836;&#21457;&#25377;&#20303;&#30340;&#12289;&#24494;&#24369;&#30340;&#12289;&#28212;&#26395;&#38451;&#20809;&#30340;&#30524;&#30555;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="http://www.guancha.cn/Chenlijian/2016_11_27_381932_s.shtml">&#38472;&#21147;&#31616;&#65306;&#20973;&#20160;&#20040;&#25105;&#22362;&#23450;&#22320;&#35748;&#20026;&#29305;&#26391;&#26222;&#33021;&#24471;&#22823;&#36873;</a></p></li>
<li><p>&#33521;&#38596;&#25112;&#32988;&#24694;&#40857;&#20043;&#21518;&#26368;&#22909;&#30340;&#32467;&#23616;&#26159;&#21644;&#24694;&#40857;&#21516;&#24402;&#20110;&#23613;&#65292;&#36825;&#26679;&#20154;&#20204;&#23601;&#20250;&#20256;&#39042;&#36190;&#32654;&#33521;&#38596;&#30340;&#27468;&#35875;&#65292;&#32780;&#19981;&#20250;&#21457;&#29616;&#33521;&#38596;&#21482;&#26159;&#21478;&#19968;&#26465;&#24694;&#40857;&#32780;&#24050;&#12290;</p></li>
<li><dl>
<dt><a href="https://www.douban.com/note/594028668/">&#65288;&#36716;&#65289;&#28070;&#28059;&#38414;&#65306;&#22312;&#32654;&#21326;&#20154;&#19982;&#23567;&#20013;&#30007;&#30340;&#36947;&#36335;&#36873;&#25321;</a> <code class="fold">@</code></dt>
<dd><p>&#36825;&#31867;&#20107;&#21457;&#29983;&#22312;&#27665;&#20027;&#20826;&#23588;&#20854;&#26159;&#22823;&#23398;&#31561;&#8220;&#31934;&#33521;&#8221;&#20026;&#20027;&#30340;&#22320;&#26041;&#27604;&#36739;&#26222;&#36941;&#65292;&#32780;&#21457;&#29983;&#22312;&#32418;&#33046;&#23376;&#20204;&#30340;&#22320;&#30424;&#21017;&#36739;&#23569;&#12290;&#22312;&#32654;&#22269;&#65292;&#20320;&#22914;&#26524;&#36208;&#36941;&#22825;&#21335;&#28023;&#21271;&#65292;&#20320;&#23601;&#20250;&#21457;&#29616;&#36234;&#26159;&#32418;&#33046;&#23376;&#30340;&#22320;&#30424;&#22823;&#23478;&#36234;&#25026;&#24471;&#31036;&#35980;&#65292;&#22240;&#20026;&#37117;&#26159;&#29609;&#26538;&#30340;&#65292;&#20320;&#19981;&#21487;&#33021;&#27809;&#20107;&#25214;&#27515;&#25925;&#24847;&#24825;&#20154;&#38590;&#21463;&#30340;&#12290;</p>
<p>&#28070;&#28059;&#38414;&#30340;&#26087;&#20316;&#37324;&#35770;&#36848;&#20102;&#32654;&#22269;&#25490;&#21326;&#27861;&#26696;&#30340;&#24418;&#25104;&#36807;&#31243;&#65292;&#20170;&#22825;&#21482;&#24378;&#35843;&#19968;&#28857;&#65306;&#22312;&#25490;&#21326;&#27861;&#26696;&#34987;&#25104;&#20026;&#27861;&#26696;&#20043;&#21069;&#65292;&#26377;&#25968;&#20197;&#21315;&#35745;&#30340;&#21326;&#20154;&#24179;&#30333;&#26080;&#25925;&#34987;&#26432;&#65292;&#32780;&#21326;&#20154;&#20063;&#19981;&#20080;&#26538;&#25253;&#22797;&#12290;&#36825;&#23454;&#22312;&#20196;&#32654;&#22269;&#20154;&#24656;&#24807;&#65292;&#22240;&#20026;&#36825;&#26679;&#30340;&#27665;&#26063;&#20064;&#24615;&#22914;&#26524;&#34067;&#24310;&#24320;&#26469;&#25110;&#36825;&#26679;&#30340;&#20154;&#26377;&#20102;&#24456;&#22810;&#21518;&#20195;&#25110;&#26032;&#31227;&#27665;&#32780;&#20351;&#24471;&#32654;&#22269;&#30340;&#8220;&#40560;&#8221;&#8220;&#29436;&#8221;&#25991;&#21270;&#21464;&#25104;&#20102;&#36719;&#24369;&#21487;&#27450;&#30340;&#32650;&#25991;&#21270;&#65292;&#23545;&#32654;&#22269;&#30340;&#26410;&#26469;&#26159;&#19981;&#22570;&#35774;&#24819;&#30340;&#12290;&#36825;&#26159;&#25490;&#21326;&#27861;&#26696;&#33021;&#34987;&#30333;&#20154;&#19968;&#33268;&#35748;&#21487;&#30340;&#26681;&#26412;&#21407;&#22240;&#12290;&#32780;&#37027;&#20123;&#21475;&#22836;&#19978;&#30340;&#35828;&#27861;&#21482;&#19981;&#36807;&#26159;&#20896;&#20885;&#22530;&#30343;&#30340;&#20511;&#21475;&#32780;&#24050;&#12290;</p>
<p>&#32654;&#22269;&#30333;&#20154;&#30340;&#34880;&#24615;&#29305;&#24449;&#65292;&#26368;&#30631;&#19981;&#36215;&#30340;&#26159;&#25062;&#24369;&#32773;&#65292;&#34987;&#31216;&#20026;&#25784;&#23556;&#12290;&#32780;&#22312;&#20013;&#22269;&#30340;&#20256;&#32479;&#25991;&#21270;&#37324;&#65292;&#65288;Loser&#65289;&#32763;&#35793;&#25104;&#25784;&#23556;&#26159;&#21512;&#29702;&#30340;&#65292;&#32780;&#32763;&#35793;&#25104;&#8220;&#22833;&#36133;&#32773;&#8221;&#21017;&#19982;&#20256;&#32479;&#25991;&#21270;&#19981;&#27838;&#36793;&#12290;&#22240;&#20026;&#20013;&#22269;&#30340;&#20256;&#32479;&#25991;&#21270;&#35748;&#20026;&#65292;&#22833;&#36133;&#20035;&#25104;&#21151;&#20043;&#27597;&#12290;&#20170;&#22825;&#38454;&#19979;&#22234;&#65292;&#26126;&#22825;&#24231;&#19978;&#23486;&#12290;Loser &#32763;&#35793;&#25104;&#22833;&#36133;&#32773;&#20063;&#26159;&#19981;&#31526;&#21512;&#21407;&#24847;&#30340;&#12290;&#40560;&#25991;&#21270;&#35748;&#20026;&#65292;Loser &#26159;&#22240;&#20026;&#25062;&#24369;&#32570;&#20047;&#21191;&#27668;&#32780;&#23548;&#33268;&#30340;&#22833;&#36133;&#12290;&#22914;&#26524;&#29992;&#38899;&#35793;&#25784;&#23556;&#65292;&#21017;&#26356;&#31526;&#21512;&#20013;&#22269;&#30340;&#20256;&#32479;&#25991;&#21270;&#12290;</p>
<p>&#23567;&#20013;&#30007;&#32439;&#32439;&#24323;&#34276;&#26657;&#32780;&#21435;&#25253;&#32771;&#20891;&#20107;&#38498;&#26657;&#65292;&#24456;&#24555;&#23601;&#26377;&#19968;&#25209;&#20108;&#20195;&#21326;&#30007;&#23558;&#20891;&#20986;&#26469;&#65292;&#21040;&#37027;&#22825;&#65292;&#21326;&#30007;&#30340;&#24418;&#35937;&#19982;&#22320;&#20301;&#25165;&#33021;&#24443;&#24213;&#25913;&#35266;&#12290;&#19982;&#40657;&#20154;&#30340;&#22859;&#20105;&#21382;&#21490;&#30456;&#21516;&#65292;&#20986;&#19968;&#20010;&#40077;&#23041;&#23572;&#22312;&#20808;&#65292;&#25165;&#33021;&#20986;&#19968;&#20010;&#22885;&#24052;&#39532;&#24635;&#32479;&#12290;&#29369;&#22826;&#20154;&#21385;&#23475;&#19981;&#65311;&#21344;&#39046;&#30528;&#32654;&#22269;&#30340;&#37329;&#34701;&#39046;&#22495;&#12289;&#21307;&#23398;&#19982;&#31185;&#23398;&#39046;&#22495;&#12289;&#23459;&#20256;&#39046;&#22495;&#65288;&#21253;&#25324;&#20027;&#35201;&#23186;&#20307;&#19982;&#22909;&#33713;&#22366;&#65289;&#65292;&#20294;&#27809;&#26377;&#21344;&#25454;&#20891;&#20107;&#39046;&#22495;&#65292;&#23601;&#20986;&#19981;&#20102;&#24635;&#32479;&#12290;&#24471;&#20808;&#20986;&#19978;&#23558;&#37324;&#30340;&#19978;&#23558;&#65288;&#40077;&#23041;&#23572;&#20027;&#25345;&#20891;&#20107;&#20250;&#35758;&#26102;&#21548;&#20182;&#35757;&#35805;&#30340;&#37117;&#26159;&#19978;&#23558;&#65289;&#12290;&#22312;&#40560;&#25991;&#21270;&#12289;&#29436;&#25991;&#21270;&#37324;&#65292;&#26538;&#26438;&#23376;&#27604;&#31508;&#26438;&#23376;&#37325;&#35201;&#24471;&#22810;&#12290;&#20309;&#20917;&#21326;&#20154;&#21462;&#20195;&#29369;&#22826;&#20154;&#30340;&#22320;&#20301;&#26159;&#22825;&#26041;&#22812;&#35885;&#12290;&#21807;&#19968;&#30340;&#36884;&#24452;&#26159;&#36208;&#20891;&#20107;&#36335;&#32447;&#12290;&#20891;&#20107;&#38498;&#26657;&#37324;&#26377;&#36275;&#22815;&#22810;&#30340;&#21326;&#30007;&#65292;&#27700;&#28072;&#33337;&#39640;&#65292;&#23558;&#20891;&#38431;&#20237;&#23601;&#20986;&#26469;&#20102;&#12290;</p>
<p>&#22312;&#30524;&#19979;&#32654;&#22269;&#20891;&#38431;&#37324;&#21326;&#20154;&#36830;&#19968;&#20010;&#23558;&#20891;&#37117;&#27809;&#26377;&#30340;&#24773;&#20917;&#19979;&#65292;&#25919;&#27835;&#27491;&#30830;&#26159;&#21807;&#19968;&#33021;&#20445;&#25252;&#23569;&#25968;&#26063;&#35028;&#30340;&#20044;&#40863;&#22771;&#12290;&#21035;&#20026;&#20102;&#28857;&#30524;&#21069;&#21033;&#30410;&#23601;&#25918;&#24323;&#33258;&#24049;&#26368;&#21518;&#30340;&#20445;&#25252;&#20254;&#12290;</p>
</dd>
</dl></li>
<li><p>issue fucking gift certificates.</p></li>
<li><dl>
<dt>I just can&#8217;t work for other people. <code class="fold">@</code></dt>
<dd><div class="figure">
<img src="https://img1.doubanio.com/view/status/raw/public/1f59429c1c6df27.jpg" />

</div>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.douban.com/people/81194074/status/1901466275/">ErbB4 &#32769;&#40587;&#40575;&#30340;&#24191;&#25773;&#65306;&#25447;&#33261;&#33050;</a> <code class="fold">@</code></dt>
<dd><p>&#25105;&#28151;&#19981;&#20102;&#22280;&#23376;&#22823;&#27010;&#26159;&#22240;&#20026;&#25105;&#19981;&#33021;&#24525;&#21463;&#20114;&#30456;&#25447;&#33261;&#33050;&#65292;&#21710;&#12290;&#25105;&#23436;&#20102;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt>&#33005;&#33026;&#25187; (1988) <code class="fold">@</code></dt>
<dd><ul>
<li><a href="http://dvorak4tzx.lofter.com/post/1d4021c8_a7dc301">&#33005;&#33026;&#25187; (1988) 1/3-dvorak4tzx</a></li>
<li><a href="http://dvorak4tzx.lofter.com/post/1d4021c8_a7dc303">&#33005;&#33026;&#25187; (1988) 2/3-dvorak4tzx</a></li>
<li><a href="http://dvorak4tzx.lofter.com/post/1d4021c8_a7dc305">&#33005;&#33026;&#25187; (1988) 3/3-dvorak4tzx</a></li>
</ul>
</dd>
</dl></li>
<li><p><a href="https://github.com/emptymalei/awesome-research">emptymalei/awesome-research: a curated list of tools to help you with the research/life</a></p></li>
<li><p>&#25991;&#22240;&#20114;&#32852;&#21644;&#36745;&#29790;&#37117;&#26159;&#25193;&#23637;&#20154;&#30340;&#33021;&#21147;&#30340;&#20844;&#21496; ( @ &#38754;&#22721;score )</p></li>
<li><p>&#24635;&#20043;&#65292;&#33521;&#35821;&#25968;&#23398;&#21746;&#23398;&#29289;&#29702;&#65292;&#38590;&#23398;&#30340;&#19996;&#35199;&#19968;&#23450;&#26159;&#26377;&#20215;&#20540;&#30340;&#65292;&#31454;&#20105;&#26368;&#32456;&#37117;&#20250;&#33853;&#22312;&#36825;&#20123;&#38590;&#25630;&#30340;&#29615;&#33410;&#12290;&#20320;&#19981;&#23398;&#20320;&#20498;&#38665;&#65292;&#19968;&#23450;&#30340;&#12290;</p></li>
<li><p><a href="https://whu-rs-advancedgis.github.io/amap-online-map-maker/">&#39640;&#24503;&#22320;&#22270; - DIY &#25105;&#30340;&#22320;&#22270;</a></p></li>
<li><dl>
<dt>&#24618;&#35789;&#65306;Tangin&#8217;&#65292;horde&#65292;&#32500;&#27665;&#25152;&#27490;&#65292;platinum <code class="fold">@</code></dt>
<dd><p>(adj) - Describes a woman who does not have a bra under her clothing and allows her breasts to dangle on their own, much like an orangutan.</p>
<p>Bro 1: Dude, Mary&#8217;s not wearing a bra today! You can see her nipples and everything!</p>
<p>Bro 2: Yeah bro, she&#8217;s totally tangin&#8217; today.</p>
<dl>
<dt>horde</dt>
<dd><p><code>[h&#596;rd]</code></p>
<ol start="14" style="list-style-type: lower-alpha">
<li>&#19968;&#22823;&#32676;&#65292;&#32676;&#65307;&#28216;&#29287;&#37096;&#33853;</li>
</ol>
</dd>
<dt>&#32500;&#27665;&#25152;&#27490;</dt>
<dd><p>&#8220;&#37030;&#30079;&#21315;&#37324;&#65292;&#32500;&#27665;&#25152;&#27490;&#8221;&#65292;&#32500;&#36890;&#20026;&#65292;&#27490;&#21363;&#20303;&#25152;&#12290;&#26159;&#35828;&#65306;&#37117;&#37009;&#21608;&#36793;&#21315;&#37324;&#36828;&#65292;&#37117;&#26159;&#21830;&#27665;&#23621;&#20303;&#22320;&#12290;&#28165;&#26397;&#38605;&#27491;&#26102;&#26399;&#65292;&#25991;&#23383;&#20900;&#29425;&#35760;&#24405;&#22312;&#26696;&#12290;&#20027;&#32771;&#23448;&#26597;&#21987;&#24237;&#20197;&#8220;&#32500;&#27665;&#25152;&#27490;&#8221;&#20026;&#32771;&#39064;&#65292;&#34987;&#26354;&#35299;&#20026;&#8220;&#38605;&#27491;&#30733;&#22836;&#8221;&#12290;&#8220;&#38605;&#27491;&#8221;&#20108;&#23383;&#21435;&#20854;&#22836;&#65292;&#27491;&#26159;&#8220;&#32500;&#27490;&#8221;&#20108;&#23383;&#12290;&#32467;&#26524;&#26597;&#21987;&#24237;&#24808;&#27515;&#29425;&#20013;&#65292;&#36824;&#34987;&#25134;&#23608;&#31034;&#20247;&#12290;</p>
<p>&#25991;&#23383;&#29425;&#12290;</p>
</dd>
<dt>platinum</dt>
<dd><ul>
<li><code>['pl&#230;tn&#601;m]</code></li>
<li><ol start="14" style="list-style-type: lower-alpha">
<li>[&#21270;&#23398;] &#38082;&#65307;&#30333;&#37329;&#65307;&#21809;&#29255;&#38598;&#36798;100&#19975;&#24352;&#30340;&#38144;&#21806;&#37327;&#65307;&#38134;&#28784;&#33394;</li>
</ol></li>
<li>adj. &#21809;&#29255;&#38598;&#24050;&#21806;&#20986;100&#19975;&#24352;&#30340;</li>
</ul>
</dd>
</dl>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.jianshu.com/p/73c19926ce2c">&#26377;&#25991;&#21270;&#21040;&#24213;&#26377;&#22810;&#21487;&#24597;&#65311; - &#31616;&#20070;</a> <code class="fold">@</code></dt>
<dd><p>&#27809;&#25991;&#21270;&#30340;&#20154;&#65292;&#27604;&#22914;&#21608;&#23567;&#24179;&#65292;&#33267;&#23569;&#36824;&#26159;&#26377;&#21475;&#39277;&#21507;&#30340;&#65292;&#36824;&#26159;&#21487;&#20197;&#34987;&#21508;&#22320;&#25919;&#24220;&#36992;&#35831;&#28436;&#35762;&#30340;&#65292;&#19981;&#20037;&#21069;&#28165;&#21326;&#22823;&#23398;&#23601;&#35831;&#21608;&#23567;&#24179;&#20570;&#36807;&#35762;&#24231;&#65292;&#20320;&#35828;&#21608;&#23567;&#24179;&#30340;&#25991;&#21270;&#27700;&#24179;&#21644;&#28165;&#21326;&#25945;&#25480;&#27604;&#65292;&#22914;&#20309;&#65311;</p>
<p>&#20320;&#21487;&#20197;&#26377;&#25991;&#21270;&#65292;&#20294;&#26159;&#26368;&#22909;&#20551;&#35013;&#27809;&#25991;&#21270;&#65292;&#20320;&#25165;&#33021;&#27963;&#24471;&#22909;&#12290;&#24819;&#24819;&#37101;&#27819;&#33509;&#65292;&#24590;&#20040;&#35828;&#20063;&#26159;&#20010;&#25991;&#21490;&#36896;&#35811;&#19968;&#27969;&#30340;&#25991;&#21270;&#20154;&#65292;&#21487;&#26159;&#20320;&#30475;&#30475;&#20182;&#25991;&#38761;&#26102;&#26399;&#20889;&#30340;&#37027;&#20123;&#25171;&#27833;&#35799;&#65292;&#20320;&#23601;&#30693;&#36947;&#36825;&#20154;&#20026;&#20102;&#35013;&#33258;&#24049;&#27809;&#25991;&#21270;&#65292;&#35013;&#24471;&#22909;&#33510;&#12290;</p>
<p>&#19981;&#24597;&#27969;&#27667;&#26377;&#25991;&#21270;&#65292;&#23601;&#24597;&#22909;&#20154;&#26377;&#25991;&#21270;&#12290;&#27969;&#27667;&#26377;&#25991;&#21270;&#65292;&#20320;&#33267;&#23569;&#21487;&#20197;&#36319;&#24247;&#29983;&#37027;&#26679;&#28151;&#19968;&#36744;&#23376;&#65292;&#21487;&#20197;&#36319;&#37101;&#27819;&#33509;&#37027;&#26679;&#24471;&#20197;&#22909;&#27515;&#12290;&#22914;&#26524;&#26159;&#22909;&#20154;&#26377;&#25991;&#21270;&#65292;&#23601;&#26159;&#36319;&#27754;&#31934;&#21355;&#38472;&#29863;&#21531;&#19968;&#26679;&#19979;&#22330;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://egoistian.com/">&#24246;&#27665;&#26679;&#26412;</a> <code class="fold">@</code></dt>
<dd><p>&#20854;&#27425;&#65292;&#25105;&#30456;&#20449;&#20154;&#26368;&#19981;&#33021;&#32570;&#23569;&#30340;&#19996;&#35199;&#23601;&#26159;&#38065;&#21644;&#26790;&#24819;&#12290;&#19981;&#33021;&#32570;&#23569;&#38065;&#19981;&#26159;&#25351;&#20026;&#20102;&#38065;&#22812;&#20197;&#32487;&#26085;&#24037;&#20316;&#37027;&#26679;&#65292;&#21807;&#21033;&#26159;&#22270;&#65292;&#32780;&#26159;&#25351;&#33021;&#22815;&#25317;&#26377;&#36275;&#22815;&#32500;&#25345;&#33258;&#24049;&#26790;&#24819;&#30340;&#38065;&#65292;&#23545;&#30340;&#65292;&#30495;&#27491;&#37325;&#35201;&#30340;&#26159;&#26790;&#24819;&#21834;&#12290;&#27809;&#26377;&#26790;&#24819;&#26159;&#20214;&#24456;&#21487;&#24597;&#30340;&#20107;&#65292;&#23427;&#35753;&#20320;&#34394;&#24230;&#20809;&#38452;&#29978;&#33267;&#35753;&#20320;&#23545;&#33258;&#24049;&#30340;&#23384;&#22312;&#20135;&#29983;&#30097;&#38382;&#12290;</p>
<p>&#26368;&#21518;&#20320;&#21487;&#33021;&#27880;&#24847;&#21040;&#20102;&#36825;&#20010;&#39029;&#38754;&#30340;&#26631;&#39064;&#30340;&#32553;&#20889;&#26159; G-F-W&#65292;&#37027;&#20040;&#32477;&#23545;&#24471;&#20998;&#20139;&#19968;&#19979;&#30772;&#22681;&#31192;&#31496;&#20043; SS &#20102;:</p>
<pre><code>W3NoYWRvd3NvY2tdbGlua3N0YXJ0QHRrLmVnb2lzdGlhbi5jb206MjI1MjI=</code></pre>
<blockquote>
<p>Tab &#19981;&#38656;&#35201;&#20381;&#38752;&#26576;&#19968;&#20010;&#24037;&#20855;&#65292;&#25152;&#26377;&#32534;&#36753;&#22120;&#37117;&#30693;&#36947; &#8220;&#22914;&#20309;&#25554;&#20837;&#19968;&#20010; tab&#8221;</p>
</blockquote>
<p>&#20294;&#26159;&#20182;&#20204;&#19981;&#19968;&#23450;&#30693;&#36947;&#24590;&#20040;&#26174;&#31034;&#19968;&#20010; tab &#21834;&#8230;&#8230;</p>
<blockquote>
<p>Use tab to indent, use space to align. If you are using space, you are making alignment, not making indention.</p>
</blockquote>
</dd>
</dl></li>
<li><p><a href="https://www.zhihu.com/question/50012944">&#29616;&#22312;&#30340;&#33529;&#26524;&#20844;&#21496;&#21040;&#24213;&#32570;&#20047;&#20160;&#20040;&#65311; - &#33529;&#26524;&#20844;&#21496; (Apple Inc.) - &#30693;&#20046;</a></p></li>
<li><dl>
<dt>&#21892;&#26410;&#26131;&#26126;&#65292;&#29702;&#26410;&#26131;&#23519;&#65281; <code class="fold">@</code></dt>
<dd><p>1946 &#24180;&#65292;&#32993;&#36866;&#22312;&#21271;&#20140;&#30340;&#24320;&#23398;&#20856;&#31036;&#19978;&#65292;&#24341;&#21335;&#23435;&#29702;&#23398;&#23478;&#21525;&#31062;&#35878;&#20043;&#35821;&#65292;&#36865;&#32473;&#24403;&#26102;&#30340;&#22823;&#23398;&#29983;&#20843;&#20010;&#23383;&#65306;</p>
<blockquote>
<p>&#21892;&#26410;&#26131;&#26126;&#65292;&#29702;&#26410;&#26131;&#23519;&#65281;</p>
</blockquote>
</dd>
</dl></li>
<li><p><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/cursor">cursor - CSS | MDN</a><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/cursor">cursor - CSS | MDN</a></p></li>
<li><p>vim &#27983;&#35272;&#22120;&#37324;&#38754;&#30340; ESCAPE &#26159; contral+]&#65311;&#26159;&#30340;&#12290;</p></li>
<li><dl>
<dt>v2ex&#65306;&#23545;&#33258;&#24049;&#35328;&#35770;&#36127;&#36131; <code class="fold">@</code></dt>
<dd><p>&#22312;&#20027;&#39064;&#21457;&#24067;&#20043;&#21518;&#30340; 300 &#31186;&#20869;&#65292;&#20320;&#21487;&#20197;&#33258;&#30001;&#22320;&#32534;&#36753;&#33258;&#24049;&#30340;&#20027;&#39064;&#65292;&#25110;&#32773;&#23558;&#20854;&#31227;&#21160;&#21040;&#20854;&#20182;&#33410;&#28857;&#12290;</p>
<p>&#20294;&#26159;&#22312; 300 &#31186;&#65288;5 &#20998;&#38047;&#65289;&#20043;&#21518;&#65292;&#23601;&#19981;&#21487;&#20197;&#20877;&#36827;&#34892;&#36825;&#20123;&#25805;&#20316;&#20102;&#12290;&#23545;&#20110;&#32534;&#36753;&#30340;&#38480;&#21046;&#26159;&#20026;&#20102;&#35753;&#22823;&#23478;&#23545;&#21457;&#34920;&#22312; V2EX &#30340;&#35328;&#35770;&#26356;&#21152;&#36127;&#36131;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://github.com/rghose/youtube-downloader">rghose/youtube-downloader: My Bash One Line Youtube Downloader</a> <code class="fold">@</code></dt>
<dd><p>&#36825;&#20040;&#22909;&#29992;&#8230;&#8230;Orz&#12290;</p>
<div class="sourceCode"><pre class="sourceCode bash"><code class="sourceCode bash"><span class="co">#!/usr/bin/env bash</span>
<span class="ot">video_url=</span><span class="st">&quot;</span><span class="ot">${1}</span><span class="st">&quot;</span>
<span class="ot">out_file_name=</span><span class="st">&quot;</span><span class="ot">${2:-</span>out.video<span class="ot">}</span><span class="st">&quot;</span>
<span class="kw">curl</span> \
  -H <span class="st">&#39;Upgrade-insecure-requests: 1&#39;</span> \
  -H <span class="st">&#39;Cache-control: max-age=0&#39;</span> \
  -H <span class="st">&#39;Accept-language: en-US,en;q=0.8,bn;q=0.6&#39;</span> \
  -H <span class="st">&#39;Accept-encoding: gzip, deflate, sdch&#39;</span> \
  -H <span class="st">&#39;Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8&#39;</span> \
  -H <span class="st">&#39;User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11_1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/47.0.2526.106 Safari/537.36&#39;</span> \
  <span class="st">&quot;</span><span class="ot">${video_url}</span><span class="st">&quot;</span> \
<span class="kw">|</span> <span class="kw">gunzip</span> \
<span class="kw">|</span> <span class="kw">egrep</span> -o <span class="st">&#39;https%3A%2F%2F[^\.]*\.googlevideo.com%2F[^,\]*&#39;</span> \
<span class="kw">|</span> <span class="kw">perl</span> -pe <span class="st">&#39;s/\%(\w\w)/chr hex $1/ge&#39;</span> \
<span class="kw">|</span> <span class="kw">head</span> -n1 \
<span class="kw">|</span> <span class="kw">xargs</span> wget -O <span class="st">&quot;</span><span class="ot">${out_file_name}</span><span class="st">&quot;</span></code></pre></div>
</dd>
</dl></li>
<li><p>prpr &#26159;&#26085;&#25991;&#12410;&#12429;&#12410;&#12429; / &#12506;&#12525;&#12506;&#12525;&#65288;pe ro pe ro&#65289;&#30340;&#32553;&#20889;&#65292;&#24847;&#24605;&#23601;&#26159;&#33300;&#65292;&#21508;&#31181;&#33300;&#12290;&#8220;&#21624;&#21949;&#21624;&#21949;&#8221;&#20063;&#26159;&#21516;&#20041;&#12290;</p></li>
<li><p><a href="http://cn.engadget.com/2016/11/23/hijacked-headphones-could-be-used-to-listen-in-on-your-life/">&#23567;&#24515;&#65292;&#20320;&#30340;&#32819;&#26426;&#21487;&#33021;&#20250;&#34987;&#40657;&#23458;&#29992;&#26469;&#31363;&#21548;</a></p></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/2201566133/status4045030807668754.html#utm_source=rss">&#38472;&#34382;&#24179;:&#38065;&#24503;&#21202;&#30340;&#20070;&#37117;&#26159;&#22909;&#20070;&#65292;&#21807;&#19968;&#30340;&#32570;&#28857;&#23601;&#26159;&#22826;&#21402;&#12290;</a> <code class="fold">@</code></dt>
<dd><p>&#38065;&#24503;&#21202;&#30340;&#20070;&#37117;&#26159;&#22909;&#20070;&#65292;&#21807;&#19968;&#30340;&#32570;&#28857;&#23601;&#26159;&#22826;&#21402;&#12290;&#21487;&#19981;&#30475;&#21402;&#20070;&#20063;&#19981;&#34892;&#65292;&#24635;&#19981;&#33021;&#22825;&#22825;&#30475;&#24494;&#21338;&#21543;&#65281;&#24494;&#21338; 90% &#20869;&#23481;&#37117;&#26159;&#21700;&#20154;&#29609;&#30340;&#65292;&#22909;&#27604;&#20449;&#24687;&#40486;&#29255;&#65292;&#35753;&#20320;&#25277;&#20102;&#20840;&#36523;&#20047;&#21147;&#22686;&#21152;&#40655;&#24615;&#65292;&#25226;&#25379;&#30340;&#28857;&#38065;&#33457;&#22312;&#23427;&#25512;&#30340;&#20135;&#21697;&#65292;&#25226;&#31934;&#21147;&#28040;&#32791;&#22312;&#30475;&#22810;&#23569;&#36941;&#37117;&#19981;&#20250;&#25552;&#21319;&#33021;&#21147;&#30340;&#20449;&#24687;&#12290;&#20114;&#32852;&#32593;&#38477;&#20302;&#20102;&#33719;&#21462;&#20449;&#24687;&#30340;&#25104;&#26412;&#65292;&#20027;&#35201;&#26159;&#38477;&#20302;&#20102;&#20182;&#20204;&#33719;&#21462;&#20320;&#30340;&#20449;&#24687;&#30340;&#25104;&#26412;&#12290;</p>
<ul>
<li><a href="https://book.douban.com/subject/1053848/">&#30475;&#24471;&#35265;&#30340;&#25163; (&#35910;&#29923;)</a></li>
<li><a href="https://book.douban.com/subject/1174913/">&#22823;&#20225;&#19994;&#21644;&#22269;&#27665;&#36130;&#23500; (&#35910;&#29923;)</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://ideas.repec.org/p/net/wpaper/0423.html">The Economics of the Internet Backbone</a> <code class="fold">@</code></dt>
<dd><p>This paper discusses the economics of the Internet backbone. I discuss competition on the Internet backbone as well as relevant competition policy issues. In particular, I show how <strong>public protocols</strong>, <strong>ease of entry</strong>, <strong>very fast network expansion</strong>, connections by the same Internet Service Provider (&#8220;ISP&#8221;) to multiple backbones (ISP multi-homing), and connections by the same large web site to multiple ISPs (customer multi-homing) enhance price competition and make &#12304;it very unlikely that any firm providing Internet backbone connectivity would find it profitable to degrade or sever interconnection with other backbones in an attempt to monopolize&#65288;<code>[m&#601;'n&#593;p&#601;'la&#618;z]</code> vt. &#22404;&#26029;&#65307;&#29420;&#21344;&#65307;&#25317;&#26377;&#8230;&#30340;&#19987;&#21334;&#26435;&#65289; the Internet backbone&#12305;.</p>
<p><a href="http://www.netinst.org/ECONOMICS_OF_THE_INTERNET_BACKBONE.pdf" class="uri">http://www.netinst.org/ECONOMICS_OF_THE_INTERNET_BACKBONE.pdf</a></p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/23/microsofts-solitaire-heads-to-ios-and-android/">Microsoft&#8217;s&#160;&#8216;Solitaire&#8217; heads to iOS and Android</a> <code class="fold">@</code></dt>
<dd><div class="figure">
<img src="https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Pysol-black-hole-solitaire-deal-1000-with-public-domain-tabletile.png/640px-Pysol-black-hole-solitaire-deal-1000-with-public-domain-tabletile.png" />

</div>
<ul>
<li><code>[.s&#593;l&#618;'ter]</code></li>
<li>&#21333;&#20154;&#36339;&#26827;&#65307;&#21333;&#20154;&#32440;&#29260;&#28216;&#25103;&#65307;&#29420;&#31890;&#23453;&#30707;&#65307;&#29420;&#31890;&#23453;&#30707;&#39318;&#39280;&#65292;&#32593;&#32476;&#25509;&#40857;&#65307;&#32440;&#29260;&#25509;&#40857;&#65307;&#21333;&#20154;&#32440;&#29260;&#25103;</li>
</ul>
<p>Patience, or solitaire as it is known in the US and Canada, is a genre (<code>['&#658;&#593;nr&#601;]</code>) of card games that can be played by a single player. Patience games can also be played in a head-to-head fashion with the winner selected by a scoring scheme.</p>
<p>In the US, the term solitaire is often used specifically to refer to solitaire with cards, while in other countries solitaire specifically refers to peg solitaire. Both Solitaire and Patience are sometimes used to refer specifically to the Klondike form of Patience.</p>
<p>Basic forms of Klondike solitaire and FreeCell come with every installation of Microsoft Windows older than Windows 8. More recent versions of Windows offer six unique card games which can be downloaded for free from its app store in the form of the Collection. There are also many applications for Android and iOS.</p>
<p>refs and see also</p>
<ul>
<li><a href="https://en.wikipedia.org/wiki/Patience_(game)">Patience (game) - Wikipedia</a></li>
<li><a href="http://cn.engadget.com/2016/11/23/microsofts-solitaire-heads-to-ios-and-android/">&#38506;&#20276;&#25105;&#20204;&#22909;&#20037;&#30340;&#24494;&#36719;&#12300;&#25509;&#40857;&#12301;&#65292;&#30331;&#19978; iOS &#19982; Android &#24179;&#21488;&#21872;</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.douban.com/group/topic/93886907/">&#33021;&#21542;&#36890;&#36807;&#30456;&#35980;&#21028;&#26029;&#22909;&#20154;&#22351;&#20154;? &#29468;&#23545;&#20102; 5 &#20010;</a> <code class="fold">@</code></dt>
<dd><blockquote>
<p>&#24456;&#22810;&#20154;&#35828;&#30475;&#30524;&#31070;&#8230;&#8230;&#21621;&#20102;&#20010;&#21621;&#12290;&#26126;&#26126;&#30475;&#29031;&#29255;&#36136;&#37327;&#21644;&#25198;&#30456;&#26356;&#38752;&#35889;&#12290;&#22270;&#20687;&#25340;&#25509;&#37117;&#35201;&#21248;&#20809;&#21248;&#33394;&#65292;&#36825;&#31181;&#23545;&#27604;&#23621;&#28982;&#30452;&#25509;&#29992;&#21407;&#22270;&#65311;&#65281;&#25105;&#35273;&#24471;&#33267;&#23569;&#24212;&#35813;&#25226;&#22270;&#29255;&#35843;&#25972;&#21040;&#19968;&#20010;&#33394;&#35843;&#65292;&#28982;&#21518;&#25226;&#33046;&#23376;&#20197;&#19979;&#30340;&#37096;&#20998;&#36974;&#36215;&#26469;&#65292;&#26368;&#21518;&#21482;&#38706;&#33080;&#12290;&#27004;&#19978;&#20877;&#26469;&#29468;&#12290;</p>
</blockquote>
<div class="tzx-hide">
<p>&#30707;&#33487;</p>
<blockquote>
<p><span class="citation">@&#26376;&#39292;</span> &#25289;&#40657;&#65292;&#28378;&#12290;</p>
</blockquote>
<p>Asshole. &#36825;&#20040;&#22823;&#30340;&#20154;&#65292;&#36825;&#20040;&#28857;&#24230;&#37327;&#65311;</p>
<p>&#65288;&#38544;&#34255;&#36215;&#26469;&#65292;&#24433;&#21709;&#25105;&#24515;&#24773;&#12290;&#65289;</p>
</div>
<p>refs and see also</p>
<ul>
<li><a href="https://www.douban.com/people/79049984/status/1922503066/?start=0#comments">&#30707;&#33487;&#30340;&#24191;&#25773;</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt>Words <code class="fold">@</code></dt>
<dd><ul>
<li>&#20851;&#20320;&#23617;&#20107;</li>
<li>&#20851;&#25105;&#23617;&#20107;</li>
<li>&#32769;&#23376;&#26377;&#38065;</li>
<li>&#26377;&#38065;&#38590;&#20080;&#20474;&#20048;&#24847;</li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/29/nanotubes-can-turn-water-solid-when-it-should-be-boiling/">Nanotubes can turn water solid when it should be boiling</a> <code class="fold">@</code></dt>
<dd><p>nanotube&#65292;&#32435;&#31859;&#31649;&#65307;&#22856;&#31859;&#31649;&#65307;&#22856;&#31859;&#24494;&#31649;</p>
<div class="figure">
<img src="https://s.aolcdn.com/dims5/amp:c4e8eaae883b57f917173b251dc7bf0788bc41f2/q:100/?url=http%3A%2F%2Fo.aolcdn.com%2Fdims-shared%2Fdims3%2FGLOB%2Fcrop%2F2121x1414%2B0%2B0%2Fresize%2F1600x1067%21%2Fformat%2Fjpg%2Fquality%2F85%2Fhttp%3A%2F%2Fo.aolcdn.com%2Fhss%2Fstorage%2Fmidas%2F36428376bf0fcbfc01202f5d9885d1c5%2F204643191%2F184789730.jpg" />

</div>
<p>Scientists have long known that under the right conditions, small amounts of water can be coaxed into changing its boiling or freezing point. A pot of water takes less energy to boil on the top of Mount Everest, for instance, and liquid under pressure takes a little more heat to convert into steam. A group of researchers at MIT has recently taken this effect a step further &#8211; observing that water in nanotubes can actually freeze into a solid at temperatures well beyond its natural boiling point.</p>
<p>The group was used a technique called vibrational spectroscopy to confirm that the nanotube confined water shifted to a &#8220;stiff phase,&#8221; but researchers are hesitant to say the solid water is frozen. &#8220;It&#8217;s not necessarily ice,&#8221; Strano says, &#8220;but it&#8217;s an ice-like phase.&#8221; Terminology aside, the phenomenon could be used to create highly conductive &#8220;stable water wires.&#8221; Sounds futuristic. Ready to hear more? You can find the research group&#8217;s findings at the source link below.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://blog.lerner.co.il/case-python-3/">The (lack of a) case against Python 3 - Lerner Consulting Blog</a> <code class="fold">@</code></dt>
<dd><p>&#21520;&#27133;&#20102; Zed Shaw &#30340; The Case Against Python 3.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://cn.engadget.com/2016/11/29/samsung-gear-360-review/">&#19977;&#26143; Gear 360 &#23454;&#25293;&#20307;&#39564;&#65306;&#29616;&#38454;&#27573;&#26368;&#24179;&#34913;&#30340;&#20840;&#26223;&#30456;&#26426;</a> <code class="fold">@</code></dt>
<dd><div class="figure">
<img src="http://o.aolcdn.com/hss/storage/midas/5f28d9190b550a84cb9c74cb6637af54/204637784/20161103_Gear_360_DSC9007.jpg" />

</div>
<div class="figure">
<img src="https://c5.staticflickr.com/6/5822/29959024844_34726e9f3b_z.jpg" />

</div>
</dd>
</dl></li>
<li><p><a href="http://www.reuters.com/article/us-afghanistan-usa-bomber-insight-idUSKBN13I2NN?feedType=RSS&amp;feedName=topNews&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+reuters%2FtopNews+%28News+%2F+US+%2F+Top+News%29">Intelligence gaps may have helped Afghan Taliban breach NATO fortress | Reuters</a></p></li>
<li><p><a href="http://cn.engadget.com/2016/11/29/google-earth-timelapse/">Google &#29992;&#12300;32 &#24180;&#12301;&#30340;&#24310;&#26102;&#25668;&#24433;&#65292;&#35753;&#25105;&#20204;&#30475;&#30475;&#22320;&#29699;&#30340;&#24555;&#36895;&#21464;&#21270;</a></p></li>
<li><p><a href="https://github.com/tiny-dnn/tiny-dnn">tiny-dnn/tiny-dnn: header only, dependency-free deep learning framework in C++11</a></p></li>
<li><p><a href="https://lwn.net/SubscriberLink/707615/286fbe1405669d74/">The Emacs dumper dispute [LWN.net]</a></p></li>
<li><p><a href="https://github.com/commaai/openpilot">commaai/openpilot: open source driving agent</a></p></li>
<li><p><a href="http://cn.engadget.com/2016/12/01/remarkable-wants-to-reinvent-the-notepad/">&#36890;&#36807;&#36825;&#21488;&#30005;&#23376;&#38405;&#35835;&#22120;&#23601;&#33021;&#25226;&#25163;&#32472;&#20316;&#21697;&#25968;&#23383;&#21270;</a></p></li>
<li><p><a href="https://www.engadget.com/2016/12/01/us-lead-on-ai-will-shrink-without-more-funding-and-education/">US lead on AI will shrink without more funding and education</a></p></li>
<li><p><a href="http://news.sina.com.cn/china/xlxw/2016-11-30/doc-ifxyawxa3196598.shtml">&#20064;&#36817;&#24179;&#65306;&#31569;&#23601;&#20013;&#21326;&#27665;&#26063;&#20255;&#22823;&#22797;&#20852;&#26102;&#20195;&#25991;&#33402;&#39640;&#23792;|&#20064;&#36817;&#24179;|&#25991;&#20195;&#20250;_&#26032;&#28010;&#26032;&#38395;</a></p></li>
<li><dl>
<dt><a href="https://m.douban.com/people/unionz/status/1922174804">&#20840;&#29699;&#33406;&#28363;&#30149;&#24739;&#32773; &#8230; - - &#24093;&#24402;&#30340;&#24191;&#25773; - &#35910;&#29923;</a> <code class="fold">@</code></dt>
<dd><ul>
<li>&#20840;&#29699;&#33406;&#28363;&#30149;&#24739;&#32773;&#24635;&#25968;&#26377; 3700 &#19975;</li>
<li>&#24635;&#24863;&#35273;&#19981;&#27490;&#36825;&#20010;&#25968;&#65292;&#24212;&#35813;&#36824;&#26377;&#24456;&#22810;&#24739;&#32773;&#21487;&#33021;&#36824;&#19981;&#30693;&#36947;&#33258;&#24049;&#24050;&#32463;&#24739;&#30149;</li>
</ul>
</dd>
</dl></li>
<li><p><a href="https://www.zhihu.com/question/53114549/answer/133778551">&#22914;&#20309;&#30475;&#24453; 2016.11.28 &#20122;&#39532;&#36874;&#21592;&#24037;&#36339;&#27004;&#65292;&#21518;&#34987;&#24378;&#21046;&#36865;&#31934;&#31070;&#30149;&#38498;&#65311; - &#21311;&#21517;&#29992;&#25143;&#30340;&#22238;&#31572; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://v.ifeng.com/program/special/201309/018c1043-793e-4321-8ece-19f7eb465721.shtml">2013-09-12 &#35828;&#32473;&#23401;&#23376;&#31532;&#19977;&#23395; &#36213;&#23567;&#20848; -20130912 &#35828;&#32473;&#23401;&#23376;&#31532;&#19977;&#23395; - &#20964;&#20976;&#35270;&#39057; - &#26368;&#20855;&#23186;&#20307;&#20215;&#20540;&#30340;&#32508;&#21512;&#35270;&#39057;&#38376;&#25143; - &#20964;&#20976;&#32593;</a></p></li>
<li><dl>
<dt><a href="https://www.zhihu.com/question/52318037/answer/132492273">&#26377;&#20160;&#20040;&#20851;&#20110;&#21271;&#20140;&#30340;&#20919;&#30693;&#35782;&#65311; - &#32769;&#37329;&#30340;&#22238;&#31572; - &#30693;&#20046;</a> <code class="fold">@</code></dt>
<dd><p>&#20840;&#19990;&#30028;&#37117;&#30693;&#36947;&#65292;&#29616;&#22312;&#30340;&#21271;&#20140;&#65292;&#26159;&#19968;&#24231;&#38654;&#38718;&#21253;&#22260;&#30340;&#22478;&#12290;</p>
<p>&#20294;&#24456;&#23569;&#20154;&#30693;&#36947;&#65292;&#19981;&#21040;&#19968;&#30334;&#24180;&#21069;&#30340;&#21271;&#20140;&#65292;&#26366;&#26159;&#19968;&#24231;&#31914;&#20415;&#21253;&#22260;&#30340;&#22478;&#12290;</p>
<p>&#20140;&#24072;&#8220;&#22235;&#38712;&#22825;&#8221;&#8212;&#8212;&#31914;&#12289;&#27700;&#12289;&#31859;&#12289;&#36710;&#12290;</p>
<p>&#22235;&#20010;&#21644;&#29983;&#27963;&#23494;&#20999;&#30456;&#20851;&#30340;&#34892;&#19994;&#20869;&#21576;&#29616;&#30340;&#40657;&#24694;&#21183;&#21147;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.zhihu.com/question/22860487">&#20026;&#20160;&#20040;&#35895;&#27468;&#12289;&#24494;&#36719;&#31561;&#32654;&#22269;&#39030;&#23574;&#20225;&#19994;&#20250;&#26377;&#37027;&#20040;&#22810;&#21360;&#24230;&#35028;&#39640;&#31649;&#65311; - &#30693;&#20046;</a> <code class="fold">@</code></dt>
<dd><p>&#24456;&#22810;&#20154;&#65292;&#21253;&#25324;&#25105;&#33258;&#24049;&#20043;&#21069;&#22312;&#20854;&#20182;&#31572;&#25991;&#20013;&#65292;&#30830;&#23454;&#22810;&#27425;&#25552;&#21040;&#36807;&#26377;&#20851;&#22312;&#32654;&#21360;&#24230;&#20154;&#21644;&#22312;&#32654;&#21326;&#20154;&#32844;&#22330;&#39118;&#26684;&#30340;&#24046;&#21035;&#65292;&#28982;&#21518;&#21322;&#21520;&#27133;&#21322;&#28608;&#21169;&#22312;&#32654;&#21326;&#20154;&#33021;&#26356;&#20855;&#26377;&#20225;&#22270;&#24515;&#19968;&#20123;&#65292;&#31561;&#31561;&#12290;</p>
<p>&#20294;&#26159;&#65292;&#20197;&#19978;&#32477;&#38750;&#39064;&#20027;&#36825;&#20010;&#38382;&#39064;&#30340;&#26681;&#26412;&#31572;&#26696;&#12290;</p>
<p>&#29992;&#26368;&#31616;&#21333;&#30340;&#35805;&#26469;&#24635;&#32467;&#65292;&#30495;&#23454;&#30340;&#21407;&#22240;&#20854;&#23454;&#26159;&#36825;&#20004;&#20010;&#65306;</p>
<ol style="list-style-type: decimal">
<li>&#26469;&#32654;&#24182;&#30041;&#32654;&#30340;&#21360;&#24230;&#20154;&#21644;&#26469;&#32654;&#24182;&#30041;&#32654;&#30340;&#20013;&#22269;&#20154;&#65292;&#32972;&#26223;&#19981;&#19968;&#26679;</li>
<li>&#21360;&#24230;&#21644;&#20013;&#22269;&#36825;&#20004;&#20010;&#22269;&#23478;&#19981;&#19968;&#26679;&#65292;&#20110;&#26159;&#20154;&#30340;&#36873;&#25321;&#33539;&#22260;&#19981;&#19968;&#26679;</li>
</ol>
<p>&#31245;&#24494;&#23637;&#24320;&#35828;&#65306;</p>
<p>1&#65292;&#26469;&#32654;&#22269;&#30340;&#20013;&#22269;&#20154;&#32972;&#26223;&#65292;&#20004;&#26497;&#20998;&#21270;&#65306;&#25110;&#32773;&#26159;&#21508;&#20010;&#23610;&#24230;&#19978;&#30340;&#20013;&#22269;&#26368;&#24213;&#23618;&#65288;&#20856;&#22411;&#26469;&#32654;&#26041;&#24335;&#22914;&#20599;&#28193;&#12289;&#25152;&#35859;&#8220;&#25919;&#27835;&#36991;&#38590;&#8221;&#65292;&#20197;&#21450;&#34013;&#39046;&#25216;&#26415;&#31227;&#27665;&#31561;&#65289;&#65292;&#25110;&#32773;&#26159;&#36215;&#30721;&#22312;&#8220;&#25945;&#32946;&#8221;&#36825;&#20010;&#23610;&#24230;&#19978;&#30340;&#20013;&#22269;&#26368;&#39030;&#23618;&#65288;&#26469;&#32654;&#20837;&#21475;&#22522;&#26412;&#19978;&#30334;&#20998;&#30334;&#26159;&#32654;&#22269;&#22823;&#23398;&#35835;&#20070;&#27605;&#19994;&#30041;&#32654;&#65289;&#12290;&#21069;&#32773;&#22825;&#28982;&#21482;&#26377;&#8220;&#38391;&#22768;&#21457;&#22823;&#36130;&#8221;&#30340;&#20154;&#29983;&#30446;&#26631;&#12290;&#32780;&#21518;&#32773;&#20013;&#24895;&#24847;&#30041;&#19979;&#26469;&#30340;&#65292;&#26412;&#23601;&#23646;&#20110;&#20027;&#21160;&#36873;&#25321;&#8220;&#23567;&#23500;&#21363;&#23433;&#8221;&#24179;&#31283;&#29983;&#27963;&#30340;&#20154;&#32676;&#12290;&#32780;&#26469;&#32654;&#22269;&#30340;&#21360;&#24230;&#20154;&#65292;&#22522;&#26412;&#19978;&#23601;&#26159;&#21360;&#24230;&#26412;&#22269;&#20154;&#21475;&#37329;&#23383;&#22612;&#20013;&#30340;&#26368;&#39030;&#23618;&#20102;&#65292;&#22825;&#29983;&#26377;&#36861;&#27714;&#8220;&#26143;&#36784;&#22823;&#28023;&#8221;&#30340;&#26412;&#33021;&#20225;&#22270;&#24515;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="https://github.com/angular/angular-cli#installation">angular/angular-cli: CLI tool for Angular2</a></p></li>
<li><p><a href="https://github.com/cmelion/generator-ng2-webpack">cmelion/generator-ng2-webpack: An opinionated tool for scaffolding an app using angular2 and webpack</a></p></li>
<li><p><a href="http://stackoverflow.com/questions/29649578/available-yeoman-generator-for-angular-2">angularjs - Available yeoman generator for angular 2 - Stack Overflow</a></p></li>
<li><dl>
<dt><a href="https://docs.docker.com/engine/installation/linux/ubuntulinux/">Install Docker on Ubuntu - Docker</a> <code class="fold">@</code></dt>
<dd><div class="sourceCode"><pre class="sourceCode bash"><code class="sourceCode bash">$ <span class="kw">sudo</span> apt-get update
$ <span class="kw">sudo</span> apt-get install apt-transport-https ca-certificates
$ <span class="kw">sudo</span> apt-key adv \
               --keyserver hkp://ha.pool.sks-keyservers.net:80 \
               --recv-keys 58118E89F3A912897C070ADBF76221572C52609D

<span class="co"># Precise 12.04 (LTS)       deb https://apt.dockerproject.org/repo ubuntu-precise main</span>
<span class="co"># Trusty 14.04 (LTS)        deb https://apt.dockerproject.org/repo ubuntu-trusty main</span>
<span class="co"># Wily 15.10                deb https://apt.dockerproject.org/repo ubuntu-wily main</span>
<span class="co"># Xenial 16.04 (LTS)        deb https://apt.dockerproject.org/repo ubuntu-xenial main</span>
$ <span class="kw">echo</span> <span class="st">&quot;&lt;REPO&gt;&quot;</span> <span class="kw">|</span> <span class="kw">sudo</span> tee /etc/apt/sources.list.d/docker.list
$ <span class="kw">sudo</span> apt-get update

$ <span class="kw">apt-cache</span> policy docker-engine

  <span class="kw">docker-engine</span>:
    <span class="kw">Installed</span>: 1.12.2-0~trusty
    <span class="kw">Candidate</span>: 1.12.2-0~trusty
    <span class="kw">Version</span> table:
   <span class="kw">***</span> 1.12.2-0~trusty 0
          <span class="kw">500</span> https://apt.dockerproject.org/repo/ ubuntu-trusty/main amd64 Packages
          <span class="kw">100</span> /var/lib/dpkg/status
       <span class="kw">1.12.1-0</span>~trusty 0
          <span class="kw">500</span> https://apt.dockerproject.org/repo/ ubuntu-trusty/main amd64 Packages
       <span class="kw">1.12.0-0</span>~trusty 0
          <span class="kw">500</span> https://apt.dockerproject.org/repo/ ubuntu-trusty/main amd64 Packages

$ <span class="kw">sudo</span> apt-get install linux-image-extra-<span class="ot">$(</span><span class="kw">uname</span> -r<span class="ot">)</span> linux-image-extra-virtual
$ <span class="kw">sudo</span> apt-get install docker-engine

$ <span class="kw">sudo</span> service docker start
$ <span class="kw">sudo</span> docker run hello-world</code></pre></div>
<dl>
<dt>Dockerfile</dt>
<dd><pre><code>FROM daocloud.io/nginx
COPY static-html-directory /usr/share/nginx/html</code></pre>
</dd>
<dt>build the nginx</dt>
<dd><pre><code>docker build -t some-content-nginx .</code></pre>
</dd>
<dt>&#26368;&#21518;&#21551;&#21160;&#23481;&#22120;</dt>
<dd><div class="sourceCode"><pre class="sourceCode bash"><code class="sourceCode bash"><span class="co"># docker run --name some-nginx -d some-content-nginx</span>
$ <span class="kw">docker</span> run --name some-nginx -d -p 8080:80 some-content-nginx</code></pre></div>
</dd>
</dl>
<p>refs and see also</p>
<ul>
<li><a href="https://hub.daocloud.io/repos/2b7310fb-1a50-48f2-9586-44622a2d1771">Hub &#183; DaoCloud</a></li>
<li><a href="http://www.cnblogs.com/xiaoluosun/p/5520510.html">Ubuntu14.04 &#19979;&#23433;&#35013; docker - xiaoluosun - &#21338;&#23458;&#22253;</a></li>
</ul>
</dd>
</dl></li>
<li><p><a href="https://github.com/mapnik/mapnik">mapnik/mapnik: Mapnik is an open source toolkit for developing mapping applications</a></p></li>
<li><dl>
<dt><a href="https://github.com/getlantern/forum/issues/335#issuecomment-230950819">&#27809;&#20154;&#24576;&#30097;&#22312;&#22825;&#26397;&#19968;&#20010;&#22659;&#22806;&#32763;&#22681;&#24037;&#20855;&#23621;&#28982;&#33021;&#20351;&#29992;&#25903;&#20184;&#23453;&#20184;&#27454;&#65311; &#183; Issue #335 &#183; getlantern/forum</a> <code class="fold">@</code></dt>
<dd><p>Lantern, a new software programme which allows internet users to circumvent government-imposed censorship, is seeing rapid growth in China as more people are using it to bypass the Great Firewall of China to access websites like Facebook, YouTube and Twitter.</p>
<p>refs and see also</p>
<ul>
<li><a href="http://www.scmp.com/news/china-insider/article/1372661/use-lantern-software-means-view-banned-websites-grows-china">US-funded Lantern program allows Chinese to dodge Great Firewall and view banned websites | South China Morning Post</a></li>
</ul>
</dd>
</dl></li>
<li><p><a href="http://www.thepaper.cn/newsDetail_forward_1569405">&#19968;&#22270;&#30475;&#25026; 2 &#22825;&#21518;&#20320;&#30340;&#20010;&#20154;&#38134;&#34892;&#36134;&#25143;&#23558;&#26377;&#20160;&#20040;&#37325;&#22823;&#21464;&#21270;_&#37329;&#25913;&#23454;&#39564;&#23460;_&#28558;&#28227;&#26032;&#38395; -The Paper</a></p></li>
<li><p><a href="http://weibo.com/ttarticle/p/show?id=2309404043936921426440">&#23567;&#31859;&#19977;&#22823;&#23450;&#24459;&#27491;&#24335;&#21457;&#34920;</a></p></li>
<li><p><a href="http://blog.csdn.net/scy411082514/article/details/7515735">OpenStreetMap&#21021;&#25506;&#65288;&#19971;&#65289;&#8212;&#8212;&#28210;&#26579;&#21644;&#22320;&#22270;&#29926;&#29255;&#20043;&#23433;&#35013;Mapnik - Mr.An &#30340;&#19987;&#26639; - &#21338;&#23458;&#39057;&#36947; - CSDN.NET</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s/_57dpgTW7PXtR_cXg87_HA">&#29579;&#26388;&#35780;&#20911;&#23567;&#21018;&#65306;&#27450;&#19979;&#24517;&#23450;&#23194;&#19978;</a></p></li>
<li><dl>
<dt><a href="http://www.dsb.cn/51812.html">30 &#24352;&#22270;&#35835;&#25026;&#24403;&#21069;&#20013;&#22269;&#37329;&#34701;&#20307;&#31995; - &#35835;&#22270;&#20998;&#26512;_&#20449;&#24687;&#22270;_&#25968;&#25454;&#22270; - &#30005;&#21830;&#25253;</a> <code class="fold">@</code></dt>
<dd><p>&#12298;&#24403;&#21069;&#20013;&#22269;&#37329;&#34701;&#20307;&#31995;&#12299;&#26159;&#19968;&#24180;&#21069;&#20026;&#20102;&#26576;&#27425;&#35762;&#24231;&#20934;&#22791;&#30340;&#35838;&#20214;&#30340;&#37096;&#20998;&#20869;&#23481;&#65292;&#29616;&#22312;&#22238;&#36807;&#22836;&#26469;&#30475;&#65292;&#36825;&#20123;&#22522;&#30784;&#30340;&#19996;&#35199;&#36824;&#26159;&#27809;&#26377;&#21464;&#12290;&#23545;&#20110;&#25972;&#20307;&#24615;&#20102;&#35299;&#20013;&#22269;&#30340;&#37329;&#34701;&#29615;&#22659;&#12289;&#37329;&#34701;&#20307;&#31995;&#12289;&#37329;&#34701;&#25919;&#31574;&#26377;&#19968;&#23450;&#30340;&#24110;&#21161;&#12290;&#20197;&#19979;&#26159;&#35838;&#20214;&#33410;&#36873;&#65306;</p>
<p><img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095000184.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095000680.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095000393.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095000754.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095001169.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095001950.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095001888.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095001113.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095002385.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095007401.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095007170.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095008790.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095008677.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095008343.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095013320.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095014701.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095014306.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095014993.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095014360.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095020490.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095020788.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095020837.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095021238.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095021841.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095021643.jpeg" /> <img src="http://www.dsb.cn/images/uploadfile/2016/1129/20161129095021450.jpeg" /></p>
</dd>
</dl></li>
<li><p><a href="http://www.zmonster.me/2016/10/03/2016-q3-review.html">2016 &#24180;&#31532;&#19977;&#23395;&#24230;&#24635;&#32467; &#183; ZMonster&#8217;s Blog</a></p></li>
<li><p><a href="http://mapclub.cn/archives/1769">&#20351;&#29992; QGIS &#32472;&#21046;&#22320;&#22270;&#65288;&#19978;&#65289; - &#25968;&#25454;&#22320;&#22270;&#21338;&#23458;</a></p></li>
<li><p><a href="https://www.linkedin.com/pulse/%E5%AD%A9%E5%AD%90%E4%BB%96%E4%BB%AC%E5%8F%AA%E6%98%AF%E6%AC%BA%E8%B4%9F%E4%BD%A0%E5%B9%B4%E8%BD%BB-%E7%A0%94%E7%A0%94-%E6%A2%81">&#23401;&#23376;&#65292;&#20182;&#20204;&#21482;&#26159;&#27450;&#36127;&#20320;&#24180;&#36731; | &#26753;&#30740;&#30740; | Pulse | LinkedIn</a></p></li>
<li><p><a href="http://www.52cs.org/?p=1378">&#24352;&#24535;&#21326;&#65306;&#25945;&#23398;&#20043;&#24863;&#24735; &#8211; &#25105;&#29233;&#35745;&#31639;&#26426;</a></p></li>
<li><p><a href="http://weibo.com/ttarticle/p/show?id=2309351000224044911069548323">&#26426;&#22120;&#23398;&#20064;&#22826;&#38590;&#65311;&#36825;&#37324;&#26377;&#19968;&#20221;&#35814;&#32454;&#21040;&#21608;&#30340;&#20837;&#38376;&#23398;&#20064;&#35745;&#21010;</a></p></li>
<li><dl>
<dt><a href="http://www.reuters.com/article/us-usa-trump-idUSKBN13P1DM?feedType=RSS&amp;feedName=topNews&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+reuters%2FtopNews+%28News+%2F+US+%2F+Top+News%29">Trump says he will back away from business to focus on White House | Reuters</a> <code class="fold">@</code></dt>
<dd><p>NEW YORK U.S. President-elect Donald Trump vowed on Wednesday to step back from running his global business empire to avoid conflicts of interest but gave few immediate details as concern over his dual role mounts ahead of his Jan. 20 inauguration.</p>
<p>Trump, <strong>a real estate magnate</strong> who owns hotels and golf resorts from Panama to Scotland, said he would spell out at a Dec. 15 news conference how he will separate himself &#8220;in total&#8221; from his worldwide business holdings, which include a winery, modeling agency and a range of other businesses.</p>
<p>After Trump won the Nov. 8 election, his company, the Trump Organization, had said it was looking at new business structures with the goal of transferring control to Donald Trump Jr., Ivanka Trump and Eric Trump - three of his adult children who are involved with the company.</p>
<p>Trump gave few details in a series of early morning tweets but said that &#8220;legal documents are being crafted which take me completely out of business operations&#8221; and that his children would attend the news conference. He did not say what the planned change might mean for ownership of his businesses.</p>
<p>Although Trump&#8217;s fellow Republicans generally take a more laissez faire stance toward business than Democrats, the president-elect will travel to Indiana on Thursday to formally announce a deal he reached with United Technologies Corp to keep close to 1,000 jobs at its Carrier Corp air conditioner plant in Indianapolis rather than have them moved to Mexico.</p>
<p>Trump and his running mate, Mike Pence, the governor of Indiana, railed against Carrier on the campaign trail, using the company&#8217;s outsourcing move as an example of how trade agreements hurt American workers.</p>
<p>&#8216;HE NEEDS TO SELL THE BUSINESSES&#8217;</p>
<p>Critics have raised questions about the role of Trump&#8217;s children, who are on the executive committee of his White House transition team. His daughter Ivanka joined a telephone call her father had with Argentine President Mauricio Macri earlier this month and attended a meeting with Japanese Prime Minister Shinzo Abe, creating concerns about possible conflicts of interest.</p>
<p>A brand name around the globe, Trump previously argued he had no need to separate himself from the Trump Organization, which includes a hotel down the street from the White House, a Manhattan tower where he lives and is running his transition to office, and a New Jersey golf course where he interviewed Cabinet candidates earlier this month.</p>
<p>Trump said on Wednesday he was not required by law to alter his relationship with his business, but added: &#8220;I feel it is visually important, as president, to in no way have a conflict of interest with my various businesses.&#8221;</p>
<p>As the Republican heads toward taking over the White House from Democratic President Barack Obama, scrutiny of potential conflicts has grown. Democratic lawmakers on Capitol Hill called for hearings on the issue.</p>
<p>Rules on conflict of interest for executive branch employees do not apply to the president, but Trump will be bound by bribery laws, disclosure rules and the U.S. Constitution, which bars elected officials from taking gifts from foreign governments.</p>
<p>The nonpartisan Office of Government Ethics, a government office that oversees ethics programs for the executive branch, issued a statement saying it applauded Trump&#8217;s aims and appearing to suggest that he completely shed his holdings.</p>
<p>&#8220;Divestiture resolves conflicts of interest in a way that transferring control does not,&#8221; it said.</p>
<p>Richard Painter, who served as the chief ethics lawyer to former Republican President George W. Bush, concurred.</p>
<p>&#8220;He needs to sell the businesses not just have someone else manage them for him,&#8221; Painter, a professor at the University of Minnesota Law School, said in an emailed comment.</p>
<p>WALL STREET PICKS</p>
<p>Trump, a former reality TV star, has spent much of the past few weeks setting up his Cabinet and interviewing candidates for top jobs in his administration.</p>
<p>On Wednesday, Trump said he would nominate his chief campaign fundraiser, Steven Mnuchin, to lead the U.S. Treasury. Mnuchin said the administration would make tax reform and trade pact overhauls top priorities as it seeks a sustained pace of 3 percent to 4 percent economic growth.</p>
<p>Mnuchin, a former Goldman Sachs banker, also signaled a desire to remove U.S. mortgage-finance companies Fannie Mae and Freddie Mac from government ownership, a move that could have wide-ranging ramifications for how Americans pay for their homes, and said banking regulations should be eased to spur lending.</p>
<p>Trump named Wilbur Ross, a billionaire known for his investments in distressed industries, as his nominee for commerce secretary. Both nominees will require confirmation by the U.S. Senate.</p>
<p>Trump is also considering Goldman Sachs President and Chief Operating Officer Gary Cohn, a former commodities trader, to head his White House budget office or to fill another position, a Trump transition official said.</p>
<p>The economic picks were praised by the Business Roundtable, a group that represents America&#8217;s largest corporations.</p>
<p>But U.S. Senators Bernie Sanders and Elizabeth Warren called Mnuchin &#8220;just another Wall Street insider.&#8221;</p>
<p>&#8220;That is not the type of change that Donald Trump promised to bring to Washington - that is hypocrisy at its worst,&#8221; Sanders, a Vermont independent who ran for the 2016 Democratic presidential nomination, and Warren, a Massachusetts Democrat, said in a joint statement.</p>
<p>Trump pledged during his campaign to &#8220;drain the swamp&#8221; in Washington. A spokesman said giving top economic jobs to Wall Street figures was not inconsistent with that vow.</p>
<p>&#8220;You want some people that are insiders and understand the system and some outsiders that are creative thinkers, out-of-the-box thinkers and disruptors,&#8221; said Anthony Scaramucci, an asset manager who is on Trump&#8217;s transition committee.</p>
<p>Trump is also working to fill out his foreign policy team, but no decision appeared imminent on who the next secretary of state would be.</p>
<p>(Additional reporting by David Lawder and Eric Walsh in Washington and Melissa Fares in New York; Writing by Roberta Rampton and Arshad Mohammed; Editing by Alistair Bell and Peter Cooney)</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.reuters.com/article/us-ukraine-crisis-missiles-idUSKBN13P2TD">Ukraine says missile tests will avoid Crimea, mollifying Russia | Reuters</a> <code class="fold">@</code></dt>
<dd><p>Crimea</p>
<p><code>[krai'mi&#601;]</code></p>
<ol start="14" style="list-style-type: lower-alpha">
<li>&#20811;&#37324;&#31859;&#20122;&#65307;&#20811;&#37324;&#31859;&#20122;&#21322;&#23707;</li>
</ol>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://serverfault.com/questions/344731/rsync-copying-over-timestamps-only">copy - Rsync : copying over timestamps only - Server Fault</a> <code class="fold">@</code></dt>
<dd><p>Using <code>-t</code> (preserve timestamps) and <code>--size-only</code> will only compare files on size. If the size matches, rsync will not copy the file but since <code>-t</code> is specified, it will update the timestamp on the destination file without recopying it.</p>
<p>Make sure to not use <code>-u</code> (update) as this will skip files that already exist and completely skip updating the timestamp.</p>
<p>I had the problem of originally not using rsync to copy a bunch of files to a new drive, and therefore the timestamps were updated to current time. I used the command below to sync everything correctly in a decent amount of time:</p>
<div class="sourceCode"><pre class="sourceCode bash"><code class="sourceCode bash"><span class="kw">rsync</span> -vrt --size-only /src /dest</code></pre></div>
</dd>
</dl></li>
<li><p><a href="https://peteris.rocks/blog/htop/">htop explained | peteris.rocks</a></p></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/12/01/apple-is-reportedly-using-drones-to-improve-maps/">Apple is reportedly using drones to improve Maps</a></dt>
<dd><p>While its Maps app is <strong>no longer the butt of jokes</strong>, Apple reportedly <strong>wants to better the quality of Google Maps</strong>, an app that&#8217;s still more widely used on all platforms. The team may use UAVs from companies like DJI and Aibotix to keep maps up-to-date with construction, new roads and other info.</p>
<p>The company even released an app called Indoor Survey last year that lets you figure out your location in an indoor venue, even if it hasn&#8217;t been mapped.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://media.weibo.cn/article?id=2309404048044076173646&amp;jumpfrom=weibocom&amp;_T_WM=774a9f1fa972c7c8e3101fb2b4e2c472">&#22836;&#26465;&#25991;&#31456;&#65306;&#31038;&#20250;&#26426;&#22120;&#30340;&#23835;&#36215;</a> <code class="fold">@</code></dt>
<dd><p>&#24863;&#35273;&#27809;&#26377;&#22826;&#22810;&#32570;&#20047;&#24748;&#24565;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.edn-cn.com/news/article/2016120200003">&#20013;&#22269;&#21457;&#23637; IC &#20135;&#19994;&#26159;&#35201;&#29420;&#38712;&#24066;&#22330;&#65311;&#21494;&#29980;&#26149;&#65306;&#25105;&#20204;&#33021;&#21542;&#25214;&#21040;&#20849;&#36194;&#27169;&#24335; - EDN &#30005;&#23376;&#25216;&#26415;&#35774;&#35745;</a> <code class="fold">@</code></dt>
<dd><ul>
<li>&#20174;&#20302;&#20215;&#21046;&#36896;&#32773;&#21040;&#20840;&#29699;&#21512;&#20316;&#20249;&#20276;&#8212;&#8212;&#20013;&#22269;&#38598;&#25104;&#30005;&#36335;&#20135;&#19994;&#20877;&#23450;&#20301;</li>
<li>2015&#12289;2016 &#24180;&#20013;&#22269;&#30340;&#28023;&#22806;&#36164;&#26412;&#24182;&#36141;&#65292;&#37117;&#26159;&#20165;&#20960;&#21313;&#20159;&#20154;&#27665;&#24065;&#12289;&#20960;&#20159;&#32654;&#37329;&#30340;&#37327;&#12290;&#36825;&#31181;&#24182;&#36141;&#34892;&#20026;&#23548;&#33268;&#20102;&#20840;&#19990;&#30028;&#30340;&#20851;&#27880;&#12290;</li>
<li>&#26368;&#21518;&#26159;&#20013;&#22269;&#38598;&#25104;&#30005;&#36335;&#20135;&#19994;&#29983;&#24577;&#30340;&#21457;&#23637;&#24773;&#20917;&#12290;&#20174; 2008 &#24180;&#24320;&#22987;&#65292;&#22269;&#23478;&#37325;&#22823;&#19987;&#39033;&#23454;&#26045;&#20043;&#21518;&#65292;&#25105;&#22269;&#25972;&#20010;&#38598;&#25104;&#30005;&#36335;&#20135;&#19994;&#21040;&#20102;&#19968;&#20010;&#26032;&#30340;&#39640;&#24230;&#12290;&#24037;&#33402;&#22312;&#25552;&#21319;&#65292;&#23588;&#20854;&#26159;&#35013;&#22791;&#21644;&#26448;&#26009;&#20174;&#26080;&#21040;&#26377;&#65292;&#25105;&#20204;&#29616;&#22312;&#24037;&#19994;&#22522;&#30784;&#24320;&#22987;&#24314;&#31435;&#36215;&#26469;&#12290;</li>
<li>&#30005;&#33041;&#30340;&#20986;&#29616;&#36896;&#23601;&#20102; CPU &#30340;&#31532;&#19968;&#22823;&#21378;&#22240;&#29305;&#23572;&#65292;&#24182;&#36896;&#23601;&#20102; GPU &#30340;&#31532;&#19968;&#22823;&#21378;&#33521;&#20255;&#36798;&#12290;&#20294;&#26159;&#22312;&#30005;&#33041;&#24050;&#32463;&#34928;&#36864;&#65292;&#25163;&#26426;&#36880;&#28176;&#39281;&#21644;&#30340;&#20170;&#22825;&#65292;&#19981;&#31649;&#26159; CPU &#36824;&#26159; GPU &#30340;&#20840;&#29699;&#22823;&#21378;&#65292;&#23427;&#20204;&#37117;&#22312;&#32771;&#34385;&#19979;&#19968;&#20010;&#26032;&#20852;&#30340;&#24066;&#22330;&#8212;&#8212;&#29289;&#32852;&#32593;&#12290;</li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.bloomberg.com/news/features/2016-11-30/confessions-of-an-instagram-influencer">Confessions of an Instagram Influencer - Bloomberg</a> <code class="fold">@</code></dt>
<dd><p>I&#8217;ve always been well-liked. At least, I think that&#8217;s the case. I have friends, a spouse, a job, a college degree. I exercise. I get haircuts regularly.</p>
<p>And yet lately I&#8217;ve felt unrealized&#8212;incomplete, almost. Everywhere I look on social media, I&#8217;m surrounded by extremely attractive, superbly groomed men and women who eat meals that are not only healthy but impeccably plated. My clothes seem tired, wrinkled, bereft of accessories. And my vacation photos&#8212;Christ, my vacation photos.</p>
<p>&#8220;Constantly,&#8221; Floruss said, when I asked him how often he takes pictures of himself.</p>
</dd>
</dl></li>
<li><p><a href="http://aiehive.com/deep-learning-applications/">Deep Learning : What, Why and Applications - AIeHive.com</a></p></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/12/02/new-superheavy-elements/">Chemists officially add new elements to the periodic table</a> <code class="fold">@</code></dt>
<dd><p>Wondering how the teams came up with those names? The Japanese researchers who created element 113 based Nihonium from the word &#8220;Nihon,&#8221; which means Japan in the country&#8217;s language. Element 115&#8217;s Russian creators named it Moscovium after Moscow, while their countrymen who made element 118 (with the help of American scientists) named theirs Oganesson after Yuri Oganessian. He&#8217;s a Russian nuclear physicist who helped discover the heaviest elements in the periodic table. Finally, the Oak Ridge National Laboratory scientists, who also helped create element 115, named element 117 Tennessine after their home state of Tennessee.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/12/02/icymi-pinchers-more-powerful-than-dog-jaws/">ICYMI: Pinchers more powerful than dog jaws</a> <code class="fold">@</code></dt>
<dd><p>Today on In Case You Missed It: Scientists looking into the strength of the pinchers in Coconut crabs found that they exert a force of 3,300 Newtons, which is more than the average dog&#8217;s jaw and far stronger than any other crustacean.</p>
<p>&#26928;&#23376;&#34809;&#8230;&#8230;&#38271;&#24471;&#21644;&#34430;&#19968;&#26679;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="http://mp.weixin.qq.com/s/PbbDp7ZDfVUIaajUcTN-wg">&#12304;&#36164;&#28304;&#12305;17&#20010;&#26368;&#21463;&#27426;&#36814;&#30340;&#26426;&#22120;&#23398;&#20064;&#24212;&#29992;&#26631;&#20934;&#25968;&#25454;&#38598;</a></p></li>
<li><p><a href="http://weibo.wbdacdn.com/user/5493934570/status4047061966523380.html#utm_source=rss">&#39118;&#20113;&#23398;&#20250;&#38472;&#32463;:&#32654;&#22270;&#30340;&#32654;&#39068;&#31639;&#27861;&#26377;&#24040;&#22823;&#30340;&#21830;&#19994;&#20215;&#20540;&#12290;&#32654;&#22270;&#36896;&#20102;&#25163;&#26426;&#65292;&#30452;&#25773;&#19982;&#33258;&#25293;&#26102;&#36827;&#34892;&#31934;&#32454;&#30340;&#24213;&#23618;&#20154;&#33080;&#24314;&#27169;&#25913;&#36896;&#65292;&#25928;&#26524;&#21523;&#20154;&#65292;&#21035;&#20154;&#36824;&#20570;&#19981;&#21040;&#12290;&#21508;&#25163;&#26426;&#21378;&#21830;&#22312;&#32654;&#22899;&#31639;&#27861;&#19978;&#20250;&#38754;&#20020;&#21387;&#21147;&#65292;&#19981;&#33021;&#19979;&#36733;&#20010;&#32654;&#22270;&#36719;&#20214;&#20102;&#20107;&#65292;&#38656;&#35201;&#20570;&#36827;&#25668;&#20687;&#22836;&#24213;&#23618;&#65292;&#22899;&#24615;&#25343;&#36215;&#25163;&#26426;&#30475;&#33258;&#24049;&#24517;&#39035;&#30452;&#25509;&#26159;&#32654;&#22899;&#65292;&#19981;&#28982;&#19981;&#20250;&#20080;&#12290;</a></p></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/25/spacex-nasa-swot-satellite-launch/">SpaceX to launch ocean-monitoring NASA satellite in 2021</a> <code class="fold">@</code></dt>
<dd><ul>
<li>In a tweet, SpaceX said: &#8220;We appreciate NASA&#8217;s support and confidence.&#8221;</li>
<li>ocean-monitoring satellite&#8230; &#28023;&#27915;&#30417;&#27979;&#21355;&#26143;&#12290;</li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/25/maseratis-electric-alfieri-two-seater-coming-in-2020/">Maserati&#8217;s electric Alfieri two-seater coming in 2020</a> <code class="fold">@</code></dt>
<dd><p>Maserati (Italian pronunciation: <code>[maze&#712;ra&#720;ti]</code>) is an Italian <strong>luxury vehicle</strong> manufacturer established on December 1, 1914, in Bologna. The Maserati tagline is &#8220;Luxury, sports and style cast in exclusive cars&#8221;, and the brand&#8217;s mission statement is to &#8220;Build ultra-luxury performance automobiles with timeless Italian style, accommodating bespoke interiors, and effortless, signature sounding power&#8221;.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://en.m.wikipedia.org/wiki/Park_Geun-hye#section_7">Park Geun-hye - Wikipedia</a> <code class="fold">@</code></dt>
<dd><p>Park Geun-hye (&#48149;&#44540;&#54812;; Korean pronunciation: <code>[pak.k&#840;&#623;nh(j)e]</code>; born 2 February 1952) is the 11th and current President of South Korea.</p>
<p>Park is the first woman to be elected as President of South Korea, and is serving the 18th presidential term. Park is the first female president of a Northeast Asian nation, and the third female (first to be elected) to act as head of state in East Asia after S&#252;khbaataryn Yanjmaa and Soong Ching-ling.</p>
<p>refs and see also</p>
<ul>
<li><a href="https://www.zhihu.com/question/24542358">&#20026;&#20160;&#20040;&#26420;&#26641;&#30340;&#26420;&#24565; pu&#65292;&#32780;&#38889;&#22269;&#30340;&#26420;&#22995;&#24565; piao&#65311; - &#30693;&#20046;</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/28/diamonds-convert-nuclear-waste-into-batteries/">Diamonds convert nuclear waste into clean batteries</a> <code class="fold">@</code></dt>
<dd><p>If you encapsulate short-range <strong>radioactive material</strong> in a human-made diamond, you can generate a small electrical charge even as you completely block harmful radiation. While the team used a nickel isotope for its tests, it ultimately expects to do this using the carbon isotope you find in graphite blocks from nuclear power plants.</p>
<p><strong>Any practical implementations are likely a long way off, and there are some conspicuous (<code>[k&#601;n'sp&#618;kj&#650;&#601;s]</code> adj. &#26174;&#33879;&#30340;&#65307;&#26174;&#32780;&#26131;&#35265;&#30340;) problems.</strong> Cost, for one. Diamond is expensive, so it might not be feasible to convert large amounts of nuclear waste into batteries. That&#8217;s assuming the technology works as well as intended, too. Still, it raises hope that the leftovers from nuclear reactors won&#8217;t just sit there posing a threat &#8211; they might actually do us some good.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/28/amazon-goes-a-step-further-to-battle-counterfeit-goods/">Amazon goes a step further to battle counterfeit goods</a> <code class="fold">@</code></dt>
<dd><p>counterfeit, &#20882;&#29260;&#36135;</p>
<p>Amazon is getting even more serious about preventing the sale of counterfeit goods on its site. According to Bloomberg, the online retail giant is organizing teams in the US and Europe that will work with major brands to <strong>establish a registry of recognized sellers</strong>. It has also made fighting fakes a major goal for 2017, said Bloomberg&#8217;s source. We&#8217;ve reached out to Amazon for confirmation, and have yet to hear back.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.reuters.com/article/us-ohio-university-shooting-idUSKBN13N1KI?feedType=RSS&amp;feedName=topNews&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+reuters%2FtopNews+%28News+%2F+US+%2F+Top+News%29">Car, knife attack at Ohio State injures 11; suspect&#8217;s background probed | Reuters</a> <code class="fold">@</code></dt>
<dd><p>The assailant was an 18-year-old immigrant from <strong>Somalia</strong> and a lawful permanent resident of the United States, two U.S. government sources said. Ohio State University Police Chief Craig Stone told a news conference that Artan might have been as old as 20.</p>
<p>The officials said they could not speak on the record because of the ongoing investigation.</p>
<p>SUSPECT SAID DIDN&#8217;T &#8220;EVEN KNOW WHERE TO PRAY&#8221;.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/1286528122/status4045394428245587.html#utm_source=rss">&#24494;&#36719;&#20122;&#27954;&#30740;&#31350;&#38498;:&#12304;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#20837;&#38376;&#24517;&#35835;&#12305;</a> <code class="fold">@</code></dt>
<dd><p>&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#26159;&#30740;&#31350;&#35745;&#31639;&#26426;&#22788;&#29702;&#20154;&#31867;&#35821;&#35328;&#30340;&#19968;&#38376;&#25216;&#26415;,&#21253;&#25324;&#20102;&#21477;&#27861;&#35821;&#20041;&#20998;&#26512;&#12289;&#25991;&#26412;&#25366;&#25496;&#12289;&#26426;&#22120;&#32763;&#35793;&#12289;&#23545;&#35805;&#31995;&#32479;&#31561;&#22810;&#26041;&#38754;&#20869;&#23481;&#12290;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#20063;&#27491;&#25104;&#20026;&#30446;&#21069;&#22823;&#23478;&#20851;&#27880;&#30340;&#28966;&#28857;&#12290;&#24494;&#36719;&#20122;&#27954;&#39318;&#24109;&#30740;&#31350;&#21592;&#21608;&#26126;&#21338;&#22763;&#30340;&#36825;&#31687;&#25991;&#31456;&#20026;&#22823;&#23478;&#25552;&#20379;&#20102;&#19968;&#20010;&#24456;&#22909;&#30340;&#20837;&#38376;&#25351;&#23548; <a href="http://weibo.com/ttarticle/p/show?id=2309404045394429523748">&#22914;&#20309;&#22312; NLP &#39046;&#22495;&#31532;&#19968;&#27425;&#20570;&#25104;&#19968;&#20214;&#20107;</a>&#12290;</p>
<p>&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#65288;&#31616;&#31216; NLP&#65289;&#65292;&#26159;&#30740;&#31350;&#35745;&#31639;&#26426;&#22788;&#29702;&#20154;&#31867;&#35821;&#35328;&#30340;&#19968;&#38376;&#25216;&#26415;&#65292;&#21253;&#25324;&#65306;</p>
<ol style="list-style-type: decimal">
<li>&#21477;&#27861;&#35821;&#20041;&#20998;&#26512;&#65306;</li>
</ol>
<p>: &#23545;&#20110;&#32473;&#23450;&#30340;&#21477;&#23376;&#65292;&#36827;&#34892;&#20998;&#35789;&#12289;&#35789;&#24615;&#26631;&#35760;&#12289;&#21629;&#21517;&#23454;&#20307;&#35782;&#21035;&#21644;&#38142;&#25509;&#12289;&#21477;&#27861;&#20998;&#26512;&#12289;&#35821;&#20041;&#35282;&#33394;&#35782;&#21035;&#21644;&#22810;&#20041;&#35789;&#28040;&#27495;&#12290;</p>
<ol start="2" style="list-style-type: decimal">
<li><dl>
<dt>&#20449;&#24687;&#25277;&#21462;&#65306;</dt>
<dd>&#20174;&#32473;&#23450;&#25991;&#26412;&#20013;&#25277;&#21462;&#37325;&#35201;&#30340;&#20449;&#24687;&#65292;&#27604;&#22914;&#65292;&#26102;&#38388;&#12289;&#22320;&#28857;&#12289;&#20154;&#29289;&#12289;&#20107;&#20214;&#12289;&#21407;&#22240;&#12289;&#32467;&#26524;&#12289;&#25968;&#23383;&#12289;&#26085;&#26399;&#12289;&#36135;&#24065;&#12289;&#19987;&#26377;&#21517;&#35789;&#31561;&#31561;&#12290;&#36890;&#20439;&#35828;&#26469;&#65292;&#23601;&#26159;&#35201;&#20102;&#35299;&#35841;&#22312;&#20160;&#20040;&#26102;&#20505;&#12289;&#20160;&#20040;&#21407;&#22240;&#12289;&#23545;&#35841;&#12289;&#20570;&#20102;&#20160;&#20040;&#20107;&#12289;&#26377;&#20160;&#20040;&#32467;&#26524;&#12290;&#28041;&#21450;&#21040;&#23454;&#20307;&#35782;&#21035;&#12289;&#26102;&#38388;&#25277;&#21462;&#12289;&#22240;&#26524;&#20851;&#31995;&#25277;&#21462;&#31561;&#20851;&#38190;&#25216;&#26415;&#12290;
</dd>
<dt>3. &#25991;&#26412;&#25366;&#25496;&#65288;&#25110;&#32773;&#25991;&#26412;&#25968;&#25454;&#25366;&#25496;&#65289;&#65306;</dt>
<dd>&#21253;&#25324;&#25991;&#26412;&#32858;&#31867;&#12289;&#20998;&#31867;&#12289;&#20449;&#24687;&#25277;&#21462;&#12289;&#25688;&#35201;&#12289;&#24773;&#24863;&#20998;&#26512;&#20197;&#21450;&#23545;&#25366;&#25496;&#30340;&#20449;&#24687;&#21644;&#30693;&#35782;&#30340;&#21487;&#35270;&#21270;&#12289;&#20132;&#20114;&#24335;&#30340;&#34920;&#36798;&#30028;&#38754;&#12290;&#30446;&#21069;&#20027;&#27969;&#30340;&#25216;&#26415;&#37117;&#26159;&#22522;&#20110;&#32479;&#35745;&#26426;&#22120;&#23398;&#20064;&#30340;&#12290;
</dd>
<dt>4. &#26426;&#22120;&#32763;&#35793;&#65306;</dt>
<dd>&#25226;&#36755;&#20837;&#30340;&#28304;&#35821;&#35328;&#25991;&#26412;&#36890;&#36807;&#33258;&#21160;&#32763;&#35793;&#33719;&#24471;&#21478;&#22806;&#19968;&#31181;&#35821;&#35328;&#30340;&#25991;&#26412;&#12290;&#26681;&#25454;&#36755;&#20837;&#23186;&#20171;&#19981;&#21516;&#65292;&#21487;&#20197;&#32454;&#20998;&#20026;&#25991;&#26412;&#32763;&#35793;&#12289;&#35821;&#38899;&#32763;&#35793;&#12289;&#25163;&#35821;&#32763;&#35793;&#12289;&#22270;&#24418;&#32763;&#35793;&#31561;&#12290;&#26426;&#22120;&#32763;&#35793;&#20174;&#26368;&#26089;&#30340;&#22522;&#20110;&#35268;&#21017;&#30340;&#26041;&#27861;&#21040;&#20108;&#21313;&#24180;&#21069;&#30340;&#22522;&#20110;&#32479;&#35745;&#30340;&#26041;&#27861;&#65292;&#20877;&#21040;&#20170;&#22825;&#30340;&#22522;&#20110;&#31070;&#32463;&#32593;&#32476;&#65288;&#32534;&#30721;-&#35299;&#30721;&#65289;&#30340;&#26041;&#27861;&#65292;&#36880;&#28176;&#24418;&#25104;&#20102;&#19968;&#22871;&#27604;&#36739;&#20005;&#35880;&#30340;&#26041;&#27861;&#20307;&#31995;&#12290;
</dd>
<dt>5. &#20449;&#24687;&#26816;&#32034;&#65306;</dt>
<dd><p>&#23545;&#22823;&#35268;&#27169;&#30340;&#25991;&#26723;&#36827;&#34892;&#32034;&#24341;&#12290;&#21487;&#31616;&#21333;&#23545;&#25991;&#26723;&#20013;&#30340;&#35789;&#27719;&#65292;&#36171;&#20043;&#20197;&#19981;&#21516;&#30340;&#26435;&#37325;&#26469;&#24314;&#31435;&#32034;&#24341;&#65292;&#20063;&#21487;&#21033;&#29992;1&#65292;2&#65292;3&#30340;&#25216;&#26415;&#26469;&#24314;&#31435;&#26356;&#21152;&#28145;&#23618;&#30340;&#32034;&#24341;&#12290;&#22312;&#26597;&#35810;&#30340;&#26102;&#20505;&#65292;&#23545;&#36755;&#20837;&#30340;&#26597;&#35810;&#34920;&#36798;&#24335;&#27604;&#22914;&#19968;&#20010;&#26816;&#32034;&#35789;&#25110;&#32773;&#19968;&#20010;&#21477;&#23376;&#36827;&#34892;&#20998;&#26512;&#65292;&#28982;&#21518;&#22312;&#32034;&#24341;&#37324;&#38754;&#26597;&#25214;&#21305;&#37197;&#30340;&#20505;&#36873;&#25991;&#26723;&#65292;&#20877;&#26681;&#25454;&#19968;&#20010;&#25490;&#24207;&#26426;&#21046;&#25226;&#20505;&#36873;&#25991;&#26723;&#25490;&#24207;&#65292;&#26368;&#21518;&#36755;&#20986;&#25490;&#24207;&#24471;&#20998;&#26368;&#39640;&#30340;&#25991;&#26723;&#12290;</p>
</dd>
</dl>
<p>6.&#38382;&#31572;&#31995;&#32479;&#65306; &#23545;&#19968;&#20010;&#33258;&#28982;&#35821;&#35328;&#34920;&#36798;&#30340;&#38382;&#39064;&#65292;&#30001;&#38382;&#31572;&#31995;&#32479;&#32473;&#20986;&#19968;&#20010;&#31934;&#20934;&#30340;&#31572;&#26696;&#12290;&#38656;&#35201;&#23545;&#33258;&#28982;&#35821;&#35328;&#26597;&#35810;&#35821;&#21477;&#36827;&#34892;&#26576;&#31181;&#31243;&#24230;&#30340;&#35821;&#20041;&#20998;&#26512;&#65292;&#21253;&#25324;&#23454;&#20307;&#38142;&#25509;&#12289;&#20851;&#31995;&#35782;&#21035;&#65292;&#24418;&#25104;&#36923;&#36753;&#34920;&#36798;&#24335;&#65292;&#28982;&#21518;&#21040;&#30693;&#35782;&#24211;&#20013;&#26597;&#25214;&#21487;&#33021;&#30340;&#20505;&#36873;&#31572;&#26696;&#24182;&#36890;&#36807;&#19968;&#20010;&#25490;&#24207;&#26426;&#21046;&#25214;&#20986;&#26368;&#20339;&#30340;&#31572;&#26696;&#12290;</p>
<p>7.&#23545;&#35805;&#31995;&#32479;&#65306;&#31995;&#32479;&#36890;&#36807;&#19968;&#31995;&#21015;&#30340;&#23545;&#35805;&#65292;&#36319;&#29992;&#25143;&#36827;&#34892;&#32842;&#22825;&#12289;&#22238;&#31572;&#12289;&#23436;&#25104;&#26576;&#19968;&#39033;&#20219;&#21153;&#12290;&#28041;&#21450;&#21040;&#29992;&#25143;&#24847;&#22270;&#29702;&#35299;&#12289;&#36890;&#29992;&#32842;&#22825;&#24341;&#25806;&#12289;&#38382;&#31572;&#24341;&#25806;&#12289;&#23545;&#35805;&#31649;&#29702;&#31561;&#25216;&#26415;&#12290;&#27492;&#22806;&#65292;&#20026;&#20102;&#20307;&#29616;&#19978;&#19979;&#25991;&#30456;&#20851;&#65292;&#35201;&#20855;&#22791;&#22810;&#36718;&#23545;&#35805;&#33021;&#21147;&#12290;&#21516;&#26102;&#65292;&#20026;&#20102;&#20307;&#29616;&#20010;&#24615;&#21270;&#65292;&#35201;&#24320;&#21457;&#29992;&#25143;&#30011;&#20687;&#20197;&#21450;&#22522;&#20110;&#29992;&#25143;&#30011;&#20687;&#30340;&#20010;&#24615;&#21270;&#22238;&#22797;&#12290;</p>
<p>&#38543;&#30528;&#28145;&#24230;&#23398;&#20064;&#22312;&#22270;&#20687;&#35782;&#21035;&#12289;&#35821;&#38899;&#35782;&#21035;&#39046;&#22495;&#30340;&#22823;&#25918;&#24322;&#24425;&#65292;&#20154;&#20204;&#23545;&#28145;&#24230;&#23398;&#20064;&#22312; NLP &#30340;&#20215;&#20540;&#20063;&#23492;&#20104;&#21402;&#26395;&#12290;&#20877;&#21152;&#19978; AlphaGo &#30340;&#25104;&#21151;&#65292;&#20154;&#24037;&#26234;&#33021;&#30340;&#30740;&#31350;&#21644;&#24212;&#29992;&#21464;&#24471;&#28825;&#25163;&#21487;&#28909;&#12290;&#33258;&#28982;&#35821;&#35328;&#22788;&#29702;&#20316;&#20026;&#20154;&#24037;&#26234;&#33021;&#39046;&#22495;&#30340;&#35748;&#30693;&#26234;&#33021;&#65292;&#25104;&#20026;&#30446;&#21069;&#22823;&#23478;&#20851;&#27880;&#30340;&#28966;&#28857;&#12290;&#24456;&#22810;&#30740;&#31350;&#29983;&#37117;&#22312;&#36827;&#20837;&#33258;&#28982;&#35821;&#35328;&#39046;&#22495;&#65292;&#23492;&#26395;&#26410;&#26469;&#22312;&#20154;&#24037;&#26234;&#33021;&#26041;&#21521;&#22823;&#23637;&#36523;&#25163;&#12290;&#20294;&#26159;&#65292;&#22823;&#23478;&#24120;&#24120;&#36935;&#21040;&#19968;&#20123;&#38382;&#39064;&#12290;&#20439;&#35805;&#35828;&#65292;&#19975;&#20107;&#24320;&#22836;&#38590;&#12290;&#22914;&#26524;&#31532;&#19968;&#20214;&#20107;&#24773;&#25104;&#21151;&#20102;&#65292;&#23398;&#29983;&#23601;&#33021;&#24314;&#31435;&#20449;&#24515;&#65292;&#25214;&#21040;&#31373;&#38376;&#65292;&#20170;&#21518;&#36234;&#20570;&#36234;&#22909;&#12290;&#21542;&#21017;&#65292;&#20063;&#21487;&#33021;&#23601;&#28784;&#24515;&#20007;&#27668;&#65292;&#29978;&#33267;&#31163;&#24320;&#36825;&#20010;&#39046;&#22495;&#12290;&#36825;&#37324;&#38024;&#23545;&#32473;&#20986;&#25105;&#20010;&#20154;&#30340;&#24314;&#35758;&#65292;&#24076;&#26395;&#25105;&#30340;&#36825;&#20123;&#31895;&#27973;&#35266;&#28857;&#33021;&#22815;&#24341;&#36215;&#22823;&#23478;&#26356;&#28145;&#23618;&#27425;&#30340;&#35752;&#35770;&#12290;</p></li>
</ol>
<dl>
<dt>&#24314;&#35758; 1&#65306;&#22914;&#20309;&#22312; NLP &#39046;&#22495;&#24555;&#36895;&#23398;&#20250;&#31532;&#19968;&#20010;&#25216;&#33021;&#65311;</dt>
<dd><p>&#25105;&#30340;&#24314;&#35758;&#26159;&#65306;&#25214;&#21040;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#65292;&#27604;&#22914;&#26426;&#22120;&#32763;&#35793;&#25110;&#32773;&#28145;&#24230;&#23398;&#20064;&#30340;&#39033;&#30446;&#12290;&#29702;&#35299;&#24320;&#28304;&#39033;&#30446;&#30340;&#20219;&#21153;&#65292;&#32534;&#35793;&#36890;&#36807;&#35813;&#39033;&#30446;&#21457;&#24067;&#30340;&#31034;&#33539;&#31243;&#24207;&#65292;&#24471;&#21040;&#19982;&#39033;&#30446;&#31034;&#33539;&#31243;&#24207;&#19968;&#33268;&#30340;&#32467;&#26524;&#12290;&#28982;&#21518;&#20877;&#28145;&#20837;&#29702;&#35299;&#24320;&#28304;&#39033;&#30446;&#31034;&#33539;&#31243;&#24207;&#30340;&#31639;&#27861;&#12290;&#33258;&#24049;&#32534;&#31243;&#23454;&#29616;&#19968;&#19979;&#36825;&#20010;&#31034;&#33539;&#31243;&#24207;&#30340;&#31639;&#27861;&#12290;&#20877;&#25353;&#29031;&#39033;&#30446;&#25552;&#20379;&#30340;&#26631;&#20934;&#27979;&#35797;&#38598;&#27979;&#35797;&#33258;&#24049;&#23454;&#29616;&#30340;&#31243;&#24207;&#12290;&#22914;&#26524;&#36755;&#20986;&#30340;&#32467;&#26524;&#19982;&#39033;&#30446;&#20013;&#20986;&#29616;&#30340;&#32467;&#26524;&#19981;&#19968;&#33268;&#65292;&#23601;&#35201;&#20180;&#32454;&#26597;&#39564;&#33258;&#24049;&#30340;&#31243;&#24207;&#65292;&#21453;&#22797;&#20462;&#25913;&#65292;&#30452;&#21040;&#32467;&#26524;&#19982;&#31034;&#33539;&#31243;&#24207;&#22522;&#26412;&#19968;&#33268;&#12290;&#22914;&#26524;&#36824;&#26159;&#19981;&#34892;&#65292;&#23601;&#22823;&#32966;&#32473;&#39033;&#30446;&#30340;&#20316;&#32773;&#20889;&#20449;&#35831;&#25945;&#12290;&#22312;&#27492;&#22522;&#30784;&#19978;&#65292;&#20877;&#30475;&#30475;&#33258;&#24049;&#33021;&#21542;&#36827;&#19968;&#27493;&#23436;&#21892;&#31639;&#27861;&#25110;&#32773;&#23454;&#29616;&#65292;&#21462;&#24471;&#27604;&#31034;&#33539;&#31243;&#24207;&#26356;&#22909;&#30340;&#32467;&#26524;&#12290;</p>
</dd>
</dl>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.bloomberg.com/news/articles/2016-11-24/china-about-to-start-35-billion-of-silk-road-plan-in-pakistan">China About to Start $35 Billion of Silk Road Plan in Pakistan - Bloomberg</a> <code class="fold">@</code></dt>
<dd><p>About $11 billion has been allocated to infrastructure projects including roads, with concessional loans provided at about 2 percent with payback in 20 years, along with a five-year grace period (&#65288;&#34892;&#21160;&#12289;&#36131;&#20219;&#31561;&#30340;&#65289;&#23485;&#38480;&#26399;), said Iqbal, who is heading the investment plans in Pakistan. The rest has been earmarked for generating electricity, with about 11,000 megawatts expected to be added by 2018 to end the nation&#8217;s chronic power outages.</p>
<div class="figure">
<img src="https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i6L2IOLpTvPI/v2/-1x-1.png" />

</div>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/2201566133/status4045684921978920.html#utm_source=rss">&#26126;&#24180;&#30340;&#37325;&#24515;&#26159;&#20889;&#26412;&#20013;&#22269;&#24037;&#19994;&#31616;&#21490;&#65292;&#20197;&#21450;&#20026;&#26576;&#25112;&#30053;&#24615;&#34892;&#19994;&#25776;&#21490;&#12290;&#24403;&#28982;&#65292;&#20854;&#23427;&#30340;&#25112;&#30053;&#24615;&#34892;&#19994;&#20063;&#25214;&#19978;&#38376;&#26469;&#20102;&#8230;&#8230;</a> <code class="fold">@</code></dt>
<dd><p>refs and see also</p>
<ul>
<li><a href="https://book.douban.com/subject/26383062/">&#25112;&#30053;&#24615;&#24037;&#19994;&#21270;&#30340;&#26354;&#25240;&#23637;&#24320; (&#35910;&#29923;)</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/5493934570/status4045973954922091.html#utm_source=rss">&#39118;&#20113;&#23398;&#20250;&#38472;&#32463;:&#34647;&#34411;&#33324;&#30340;&#21047;&#23458;&#22823;&#20891;</a> <code class="fold">@</code></dt>
<dd><p>&#25163;&#25569;&#21315;&#19975;&#25163;&#26426;&#21495; &#30636;&#38388;&#34181;&#24178;&#19968;&#23478;&#24179;&#21488; http://t.cn/RfpuhUW &#40657;&#21033;&#28070;&#39640;&#30340;&#21523;&#20154;&#65292;&#21019;&#25237;&#21644;&#30005;&#20449;&#30005;&#21830;&#30340;&#20248;&#24800;&#37117;&#35753;&#20182;&#20204;&#25630;&#36208;&#20102;&#12290;&#36825;&#30456;&#24403;&#20110;&#31995;&#32479;&#28431;&#27934;&#65292;&#20986;&#22823; bug &#20102;&#65292;&#19981;&#35299;&#20915;&#19981;&#24212;&#35813;&#20570;&#25512;&#24191;&#27963;&#21160;&#20102;&#12290;&#40657;&#25216;&#26415;&#24456;&#26377;&#24847;&#24605;&#65292;&#21644;&#26089;&#26399;&#25366;&#27604;&#29305;&#24065;&#19968;&#26679;&#65292;&#25237;&#20837;&#19981;&#22823;&#21033;&#28070;&#29305;&#39640;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://openvault.wgbh.org/catalog/V_D9DC82D997454711A71B586E17D23119">Machine That Changed The World, The; Interview with Alan Kay, 1990</a> <code class="fold">@</code></dt>
<dd><p>The program traced the history of the development of the computer to the modern personal computer, to future developments on the horizon. There was a focus on history of computers from 19th century to PC, present day applications, and future developments. Alan Curtis Kay is an American computer scientist. He was an Apple Fellow at Apple Inc. in the 1980s and went on to be a Disney Fellow with Walt Disney Imagineering. Later jobs included Senior Fellow at Hawlett-Packard and founder of the Viewpoints Research Institute. Select metadata for this record was submitted by John Campopiano.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://probablydance.com/2016/11/07/lessons-learned-from-shenzhen-io/">Lessons Learned from Shenzhen I/O | Probably Dance</a> <code class="fold">@</code></dt>
<dd><ol style="list-style-type: decimal">
<li><p>There is no optimal code. There is only code that&#8217;s faster than the code that you&#8217;re comparing to</p></li>
<li><p>You can&#8217;t think of a solution until you know it&#8217;s possible</p></li>
<li><p>You can&#8217;t get to the good solution right away</p></li>
<li><p>Tests can drastically improve iteration times</p></li>
<li><p>Iteration times are about more than just productivity</p></li>
<li><p>Competition can really improve code</p></li>
<li><dl>
<dt>A good story can enhance any game</dt>
<dd><p>Shenzhen I/O has impressively good writing, and it really enhances the game.</p>
</dd>
</dl></li>
</ol>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/1932835417/status4046082655215450.html#utm_source=rss">&#12298;&#35770;&#8220;&#24223;&#38500;&#19968;&#20999;&#20135;&#19994;&#25919;&#31574;&#8221;&#24403;&#32531;&#34892;&#12299;etc</a> <code class="fold">@</code></dt>
<dd><p>&#20135;&#19994;&#25919;&#31574;&#30340;&#23450;&#20041;&#26159;&#12304;&#25919;&#24220;&#20026;&#20102;&#23454;&#29616;&#19968;&#23450;&#30340;&#32463;&#27982;&#21644;&#31038;&#20250;&#30446;&#26631;&#32780;&#23545;&#20135;&#19994;&#30340;&#24418;&#25104;&#21644;&#21457;&#23637;&#36827;&#34892;&#24178;&#39044;&#30340;&#21508;&#31181;&#25919;&#31574;&#30340;&#24635;&#21644;&#12305;&#12290;</p>
<p>&#20877;&#30475;&#19968;&#19979;&#33521;&#25991;&#30340;&#32500;&#22522;&#30334;&#31185;&#65292;&#23427;&#26159;&#36825;&#26679;&#20889;&#30340;&#65306;&#8220;The <strong>industrial policy of a country</strong> is its official strategic effort to encourage the development and growth of part or all of the manufacturing sector as well as other sectors of the economy&#12304;&#22823;&#24847;&#65306;&#19968;&#20010;&#22269;&#23478;&#30340;&#20135;&#19994;&#25919;&#31574;&#65292;&#26159;&#25351;&#25919;&#24220;&#20026;&#20102;&#40723;&#21169;&#22269;&#27665;&#32463;&#27982;&#30340;&#26576;&#20123;&#34892;&#19994;&#8212;&#8212;&#21253;&#25324;&#21046;&#36896;&#19994;&#21644;&#20854;&#23427;&#34892;&#19994;&#8212;&#8212;&#30340;&#21457;&#23637;&#32780;&#37319;&#21462;&#30340;&#31574;&#30053;&#12305;&#8221;</p>
<ul>
<li>&#31532;&#19968;&#20010;&#26041;&#38754;&#65306;&#25919;&#24220;&#38024;&#23545;&#8220;&#19981;&#21516;&#20135;&#19994;&#20043;&#38388;&#8221;&#36164;&#28304;&#37197;&#32622;&#21644;&#22522;&#30784;&#35774;&#26045;&#24314;&#35774;&#26041;&#38754;&#30340;&#26377;&#20851;&#25919;&#31574;&#65292;&#21253;&#25324;&#37325;&#28857;&#20135;&#19994;&#30340;&#22521;&#32946;&#21644;&#20445;&#25252;&#12289;&#33853;&#21518;&#20135;&#19994;&#30340;&#35843;&#25972;&#31561;&#65307;</li>
<li>&#31532;&#20108;&#20010;&#26041;&#38754;&#65306;&#25919;&#24220;&#22312;&#35843;&#25972;&#8220;&#20135;&#19994;&#20869;&#37096;&#32467;&#26500;&#8221;&#26041;&#38754;&#30340;&#25919;&#31574;&#65292;&#27604;&#22914;&#25512;&#21160;&#20225;&#19994;&#30340;&#21512;&#24182;&#20197;&#25552;&#39640;&#38598;&#20013;&#24230;&#65292;&#32452;&#32455;&#21327;&#35843;&#20225;&#19994;&#35843;&#25972;&#24320;&#24037;&#37327;&#21644;&#25237;&#36164;&#35268;&#27169;&#65292;&#20197;&#21450;&#23454;&#26045;&#25903;&#25345;&#20013;&#23567;&#20225;&#19994;&#25104;&#38271;&#30340;&#25919;&#31574;&#31561;&#31561;&#12290;</li>
</ul>
<p>&#23545;&#27492;&#65292;&#32500;&#22522;&#30334;&#31185;&#37324;&#38754;&#20063;&#35762;&#20102;&#19968;&#21477;&#8220;Industrial policies are sector-specific, unlike broader macroeconomic policies&#65288;&#20135;&#19994;&#25919;&#31574;&#26159;&#38024;&#23545;&#29305;&#23450;&#34892;&#19994;&#30340;&#65292;&#19981;&#20687;&#23439;&#35266;&#32463;&#27982;&#25919;&#31574;&#37027;&#26679;&#23485;&#27867;&#65289;&#12290;&#8221;</p>
<p>&#22914;&#26524;&#25105;&#20204;&#30740;&#31350;&#20135;&#19994;&#32858;&#38598;&#65292;&#20250;&#21457;&#29616;&#20013;&#22269;&#30340;&#20135;&#19994;&#32858;&#38598;&#31243;&#24230;&#26159;&#20840;&#19990;&#30028;&#26368;&#39640;&#30340;&#12290;&#20687;&#20041;&#20044;&#36825;&#31181;&#23567;&#21830;&#21697;&#24066;&#22330;&#30340;&#31354;&#38388;&#39640;&#24230;&#32858;&#38598;&#22312;&#19990;&#30028;&#19978;&#20854;&#23427;&#22269;&#23478;&#26681;&#26412;&#23601;&#27809;&#26377;&#12290;</p>
<p>&#38500;&#20102;&#20041;&#20044;&#65292;&#20013;&#22269;&#30340;&#38271;&#19977;&#35282;&#21644;&#29664;&#19977;&#35282;&#26377;&#25968;&#19981;&#28165;&#30340;&#8220;&#19987;&#19994;&#38215;&#8221;&#65292;&#27599;&#19968;&#20010;&#38215;&#37117;&#26377;&#19968;&#20010;&#25110;&#20960;&#20010;&#22320;&#26041;&#20986;&#29616;&#20102;&#20135;&#19994;&#30340;&#39640;&#24230;&#32858;&#38598;&#12290;&#20687;&#24191;&#19996;&#20013;&#23665;&#30340;&#21476;&#38215;&#38215;&#65292;&#20840;&#38215;&#20154;&#27665;&#23601;&#21482;&#20570;&#19968;&#20010;&#20135;&#19994;&#65292;&#23601;&#26159;&#29983;&#20135; LED &#28783;&#20855;&#12290;&#22823;&#37096;&#20998;&#20225;&#19994;&#37117;&#24456;&#23567;&#65292;&#20063;&#23601;&#20960;&#20010;&#20154;&#65292;&#23646;&#20110;&#23478;&#24237;&#20316;&#22346;&#30340;&#32423;&#21035;&#12290;&#20294;&#25968;&#37327;&#24778;&#20154;&#65292;&#20849;&#26377;&#28783;&#39280;&#20225;&#19994; 14000 &#22810;&#23478;&#65292;&#28783;&#39280;&#37197;&#22871;&#30340;&#20116;&#37329;&#12289;&#22609;&#26009;&#31561;&#20225;&#19994; 3000 &#22810;&#23478;&#65292;&#21476;&#38215;&#23478;&#24237;&#26377; 60% &#37117;&#25317;&#26377;&#33258;&#24049;&#30340;&#28783;&#39280;&#30456;&#20851;&#20225;&#19994;&#12290;&#23427;&#30340; LED &#28783;&#20855;&#24635;&#37327;&#23601;&#33021;&#21344;&#21040;&#20840;&#22269; LED &#20135;&#37327;&#30340; 70% &#20197;&#19978;&#12290;&#39134;&#21033;&#28006;&#36825;&#31181;&#22269;&#38469;&#24040;&#22836;&#23601;&#30828;&#29983;&#29983;&#30340;&#34987;&#36825;&#31181;&#32858;&#38598;&#25928;&#24212;&#24102;&#26469;&#30340;&#23041;&#21147;&#25171;&#36133;&#20102;&#65292;&#19981;&#24471;&#19981;&#22312; 2016 &#24180; 5 &#26376;&#23459;&#24067;&#20851;&#38381;&#20102;&#23427;&#22312;&#20013;&#22269;&#30340;&#28783;&#39280;&#20844;&#21496;&#12290;</p>
<p>&#36825;&#31181;&#32858;&#38598;&#26159;&#20135;&#19994;&#25919;&#31574;&#30340;&#21151;&#21171;&#21527;&#65311;</p>
<p>&#20135;&#19994;&#32858;&#38598;&#32477;&#22823;&#37096;&#20998;&#37117;&#26159;&#26469;&#33258;&#20110;&#27665;&#38388;&#30340;&#33258;&#21457;&#65292;&#32780;&#19981;&#26159;&#25919;&#24220;&#30340;&#35268;&#21010;&#12290;&#20294;&#33258;&#21457;&#32858;&#38598;&#21040;&#20102;&#19968;&#23450;&#35268;&#27169;&#20197;&#21518;&#65292;&#22320;&#26041;&#25919;&#24220;&#36275;&#20197;&#35266;&#23519;&#21040;&#20854;&#20135;&#19994;&#29305;&#24449;&#65292;&#23601;&#20250;&#24456;&#24555;&#8220;&#38598;&#20013;&#28779;&#21147;&#8221;&#24320;&#22987;&#25206;&#25345;&#36825;&#20010;&#20135;&#19994;&#65292;&#20063;&#23601;&#26159;&#24320;&#22987;&#24352;&#32500;&#36814;&#25945;&#25480;&#25152;&#35828;&#30340;&#8220;&#35946;&#36172;&#8221;&#20102;&#12290;&#25105;&#20204;&#20998;&#26512;&#27599;&#19968;&#20010;&#19987;&#19994;&#38215;&#30340;&#20135;&#19994;&#32858;&#38598;&#36807;&#31243;&#65292;&#37117;&#20250;&#21457;&#29616;&#20135;&#19994;&#25919;&#31574;&#30340;&#24433;&#23376;&#12290;</p>
<p>&#22312;&#8220;&#21452; 11&#8221;&#30340;&#36141;&#29289;&#29378;&#27426;&#20013;&#65292;&#20225;&#19994;&#30340;&#21019;&#36896;&#21644;&#25919;&#24220;&#30340;&#20135;&#19994;&#25919;&#31574;&#26159;&#23494;&#20999;&#32467;&#21512;&#22312;&#19968;&#36215;&#30340;&#65292;&#24444;&#27492;&#38590;&#20197;&#20998;&#21106;&#65306;&#24403;&#25105;&#20204;&#25171;&#24320;&#25163;&#26426;&#28120;&#23453;&#30340;&#26102;&#20505;&#65292;&#36825;&#20010;&#32593;&#31449;&#26159;&#20225;&#19994;&#23478;&#39532;&#20113;&#21019;&#36896;&#30340;&#65307;&#32593;&#32476;&#20449;&#21495;&#26159;&#25919;&#24220;&#20027;&#23548;&#30340;&#30005;&#20449;&#36890;&#35759;&#31995;&#32479;&#20256;&#25773;&#30340;&#65307;&#24403;&#25105;&#20204;&#28857;&#20987;&#36141;&#20080;&#30340;&#26102;&#20505;&#65292;&#25968;&#25454;&#22788;&#29702;&#26159;&#22312;&#25919;&#24220;&#35268;&#21010;&#24314;&#35774;&#30340;&#22823;&#25968;&#25454;&#20135;&#19994;&#22253;&#36827;&#34892;&#30340;&#65307;&#22788;&#29702;&#23436;&#30340;&#25968;&#25454;&#21453;&#39304;&#21040;&#21334;&#23478;&#65292;&#36825;&#20123;&#21334;&#23478;&#22823;&#37096;&#20998;&#26159;&#31169;&#33829;&#20013;&#23567;&#20225;&#19994;&#20027;&#65307;&#20225;&#19994;&#23478;&#20204;&#25226;&#21830;&#21697;&#21457;&#36135;&#65292;&#36827;&#20837;&#25919;&#24220;&#35268;&#21010;&#24314;&#35774;&#30340;&#29289;&#27969;&#22253;&#21306;&#65307;&#29289;&#27969;&#30001;&#24555;&#36882;&#20225;&#19994;&#20998;&#25315;&#8212;&#8212;&#21019;&#21150;&#39034;&#20016;&#30340;&#26159;&#19968;&#20010;&#20174;&#24555;&#36882;&#21592;&#24178;&#36215;&#30340;&#31169;&#33829;&#20225;&#19994;&#23478;&#65292;&#21487;&#20197;&#39640;&#36895;&#25226;&#36135;&#29289;&#36865;&#36798;&#65292;&#20294;&#22914;&#26524;&#35201;&#25226;&#36135;&#29289;&#36865;&#21040;&#20559;&#36828;&#22320;&#21306;&#65292;&#36824;&#26159;&#38656;&#35201;&#20351;&#29992;&#25919;&#24220;&#20960;&#21313;&#24180;&#21069;&#24314;&#31435;&#30340;&#37038;&#25919;&#29289;&#27969;&#31995;&#32479;&#65307;&#36135;&#29289;&#20998;&#25315;&#23436;&#25104;&#21518;&#36827;&#20837;&#25919;&#24220;&#20027;&#23548;&#24314;&#35774;&#30340;&#20132;&#36890;&#32593;&#32476;&#20307;&#31995;&#65292;&#26368;&#21518;&#20877;&#36890;&#36807;&#19968;&#20010;&#19968;&#20010;&#20026;&#20102;&#35851;&#29983;&#32780;&#36827;&#20837;&#24555;&#36882;&#34892;&#19994;&#30340;&#24555;&#36882;&#21592;&#36827;&#20837;&#21315;&#23478;&#19975;&#25143;&#12290;</p>
<p>&#20165;&#20165;&#36890;&#36807;&#22303;&#22320;&#24265;&#20215;&#20986;&#35753;&#30340;&#26041;&#24335;&#65292;&#25919;&#24220;&#23601;&#30456;&#24403;&#20110;&#34917;&#36148;&#20102;&#21326;&#20026;&#36229;&#36807;&#19968;&#21315;&#20159;&#30340;&#36164;&#37329;&#65292;&#21487;&#20197;&#35753;&#21326;&#20026;&#20302;&#25104;&#26412;&#22312;&#20013;&#22269;&#30340;&#21508;&#22823;&#20013;&#24515;&#22478;&#24066;&#24314;&#35774;&#30740;&#21457;&#21644;&#29983;&#20135;&#22522;&#22320;&#65292;&#20139;&#21463;&#21040;&#22823;&#22478;&#24066;&#30340;&#21508;&#31181;&#20415;&#21033;&#12290;</p>
<p>&#25919;&#24220;&#20026;&#20160;&#20040;&#35201;&#36825;&#20040;&#24178;&#21602;&#65311;&#23601;&#26159;&#22240;&#20026;&#36825;&#21487;&#20197;&#24102;&#21160;&#26412;&#22320;&#21306;&#30456;&#20851;&#20135;&#19994;&#30340;&#21457;&#23637;&#65292;&#22686;&#21152;&#25919;&#24220;&#31246;&#25910;&#12289;&#25289;&#21319;&#22303;&#22320;&#20215;&#26684;&#12289;&#21019;&#36896;&#21171;&#21160;&#23601;&#19994;&#12290;</p>
<p>1996 &#24180;&#21069;&#21518;&#65292;&#39532;&#20113;&#21019;&#19994;&#21021;&#26399;&#65292;&#26366;&#32463;&#21040;&#21271;&#20140;&#65292;&#21521;&#20013;&#22830;&#21508;&#22823;&#37096;&#22996;&#25512;&#38144;&#20182;&#30340;&#20114;&#32852;&#32593;&#39033;&#30446;&#65292;&#35201;&#24110;&#21161;&#22269;&#23478;&#21508;&#37096;&#22996;&#25226;&#20449;&#24687;&#19978;&#32593;&#12290;&#32467;&#26524;&#21507;&#20102;&#19968;&#20018;&#38381;&#38376;&#32697;&#12290;&#24403;&#26102;&#20013;&#22830;&#37096;&#22996;&#30340;&#39046;&#23548;&#36824;&#32570;&#20047;&#20114;&#32852;&#32593;&#36825;&#20010;&#27010;&#24565;&#65292;&#24182;&#27809;&#26377;&#20026;&#39532;&#20113;&#25552;&#20379;&#25903;&#25345;&#12290;&#25454;&#35828;&#22312;&#31163;&#24320;&#21271;&#20140;&#20043;&#21069;&#30340;&#26368;&#21518;&#19968;&#20010;&#26202;&#19978;&#65292;&#39532;&#20113;&#21644;&#25512;&#38144;&#21592;&#19968;&#36215;&#22312;&#23486;&#39302;&#37324;&#25265;&#22836;&#30171;&#21741;&#12290;</p>
<p>&#39532;&#20113;&#22238;&#21040;&#26477;&#24030;&#20197;&#21518;&#65292;&#24182;&#27809;&#26377;&#25918;&#24323;&#21162;&#21147;&#65292;&#24102;&#30528;&#21019;&#19994;&#22242;&#38431;&#33258;&#31609;&#20102;50&#19975;&#20803;&#24320;&#22987;&#20570;&#20013;&#23567;&#20225;&#19994;&#30005;&#23376;&#21830;&#21153;&#65292;&#21518;&#26469;&#21448;&#36890;&#36807;&#21508;&#31181;&#36884;&#24452;&#25343;&#21040;&#20102;&#39118;&#38505;&#25237;&#36164;&#65292;&#25104;&#31435;&#20102;&#38463;&#37324;&#24052;&#24052;&#12290;</p>
<p>&#38543;&#30528;&#20114;&#32852;&#32593;&#22312;&#22269;&#20869;&#22806;&#30340;&#36880;&#27493;&#21457;&#23637;&#65292;&#22269;&#23478;&#37096;&#22996;&#20063;&#24320;&#22987;&#36716;&#21464;&#20102;&#24577;&#24230;&#65292;&#35748;&#35782;&#21040;&#20102;&#20114;&#32852;&#32593;&#21457;&#23637;&#23545;&#22269;&#23478;&#30340;&#37325;&#35201;&#24615;&#65292;&#24320;&#22987;&#36716;&#32780;&#22823;&#21147;&#25903;&#25345;&#20114;&#32852;&#32593;&#20135;&#19994;&#21457;&#23637;&#12290;&#36825;&#26679;&#65292;&#25919;&#24220;&#30340;&#20135;&#19994;&#25919;&#31574;&#21644;&#27665;&#38388;&#30340;&#21019;&#26032;&#32467;&#21512;&#20102;&#36215;&#26469;&#65292;&#20013;&#22269;&#20114;&#32852;&#32593;&#20135;&#19994;&#36814;&#26469;&#20102;&#29190;&#21457;&#24335;&#22686;&#38271;&#30340;&#26102;&#26399;&#12290;</p>
<p>&#36825;&#26679;&#30340;&#36716;&#21464;&#35828;&#26126;&#20102;&#19977;&#20010;&#36947;&#29702;&#65306;</p>
<ul>
<li>&#31532;&#19968;&#65292;&#20135;&#19994;&#25919;&#31574;&#26159;&#19968;&#31181;&#8220;&#26377;&#38480;&#24178;&#39044;&#8221;&#12290;</li>
<li>&#31532;&#20108;&#65292;&#20135;&#19994;&#25919;&#31574;&#30340;&#30446;&#26631;&#24182;&#38750;&#8220;&#21019;&#36896;&#36235;&#21183;&#8221;&#65292;&#32780;&#26159;&#8220;&#39034;&#21183;&#32780;&#20026;&#8221;&#12290;&#23545;&#20135;&#19994;&#25919;&#31574;&#21046;&#23450;&#32773;&#30340;&#35201;&#27714;&#20063;&#24182;&#19981;&#26159;&#20840;&#30693;&#20840;&#33021;&#12289;&#27934;&#23519;&#19968;&#20999;&#65292;&#26368;&#37325;&#35201;&#30340;&#26159;&#29702;&#24615;&#21153;&#23454;&#12289;&#23454;&#20107;&#27714;&#26159;&#12290;</li>
<li>&#31532;&#19977;&#12289;&#20013;&#22269;&#25919;&#24220;&#30340;&#20135;&#19994;&#25919;&#31574;&#23384;&#22312;&#31454;&#20105;&#26426;&#21046;&#21644;&#32416;&#38169;&#26426;&#21046;&#12290;</li>
</ul>
<p>refs and see also</p>
<ul>
<li><a href="http://weibo.com/ttarticle/p/show?id=2309404046034002162580">&#35770;&#8220;&#24223;&#38500;&#19968;&#20999;&#20135;&#19994;&#25919;&#31574;&#8221;&#24403;&#32531;&#34892; &#8212;&#8212;&#23545;&#26519;&#27589;&#22827;&#24352;&#32500;&#36814;&#26377;&#20851;&#20135;&#19994;&#25919;&#31574;&#20105;&#35770;</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.bloomberg.com/news/articles/2016-11-26/fidel-castro-who-turned-cuba-into-communist-outpost-dies-at-90">Fidel Castro, Communist Former Leader of Cuba, Dies at 90 - Bloomberg</a> <code class="fold">@</code></dt>
<dd><p><strong>Fidel Castro</strong>, who established a communist regime in Cuba that survived the collapse of the Soviet Union, inspired revolutionary movements and <strong>brought two superpowers close to nuclear war</strong> before stepping down after 49 years in power, has died. He was 90.</p>
</dd>
</dl></li>
<li><p><a href="https://msdn.microsoft.com/commandline/wsl/about" class="hearts">Bash on Ubuntu on Windows - About</a></p></li>
<li><p><a href="http://www.miaopai.com/show/WkDQ7-81Qzt4Eil0TZLSuw__.htm">-Luv_DC&#30340;&#31186;&#25293;</a></p></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/1932835417/status4046214171083937.html#utm_source=rss">&#35199;&#29916;&#22823;&#20024;&#23376;&#27748;:&#21453;&#30452;&#35273;&#65292;&#21453;&#20154;&#24615;&#12290;&#30495;&#27491;&#26377;&#23398;&#20064;&#33021;&#21147;&#19988;&#26377;&#36827;&#21462;&#24515;&#30340;&#20154;&#65292;&#30334;&#37324;&#25361;&#19968;&#12290;</a> <code class="fold">@</code></dt>
<dd><blockquote>
<p>&#8220;&#22914;&#26524;&#20320;&#32856;&#29992;&#19968;&#20010;&#20154;&#21482;&#26159;&#22240;&#20026;&#20182;&#26377;&#33021;&#21147;&#23436;&#25104;&#36825;&#20221;&#24037;&#20316;&#65292;&#37027;&#20040;&#36825;&#20010;&#20154;&#26469;&#24037;&#20316;&#23601;&#21482;&#26159;&#20026;&#20102;&#20320;&#21457;&#30340;&#37027;&#20221;&#34218;&#27700;&#8221;</p>
</blockquote>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://gchq.github.io/CyberChef/">CyberChef</a> <code class="fold">@</code></dt>
<dd><dl>
<dt>What sort of things can I do with CyberChef?</dt>
<dd><p>There are well over 100 operations in CyberChef allowing you to carry simple and complex tasks easily. Here are some examples:</p>
<ul>
<li>Decode a Base64-encoded string</li>
<li>Convert a date and time to a different time zone</li>
<li>Parse a Teredo IPv6 address</li>
<li>Convert data from a hexdump, then decompress</li>
<li>Display multiple timestamps as full dates</li>
<li>Carry out different operations on data of different types</li>
</ul>
</dd>
</dl>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/1932835417/status4046775834362365.html#utm_source=rss">&#35199;&#29916;&#22823;&#20024;&#23376;&#27748;:&#20154;&#24037;&#26234;&#33021;&#30028;&#26032;&#30340;&#19996;&#35199;&#20854;&#23454;&#25402;&#23569;&#65292;&#31639;&#27861;&#30340;&#21464;&#21270;&#65292;&#22823;&#22810;&#26159;&#19968;&#20123;&#32452;&#21512;&#65292;&#26032;&#30340;&#21407;&#29702;&#26159;&#34542;&#32597;&#35265;&#30340;&#12290;</a> <code class="fold">@</code></dt>
<dd><p>&#36827;&#27493;&#22823;&#22810;&#26159;&#25968;&#25454;&#21644;&#30828;&#20214;&#24102;&#26469;&#30340;&#65292;&#26377;&#20102;&#25968;&#25454;&#21644;&#30828;&#20214;&#30340;&#36827;&#27493;&#65292;&#19968;&#20123;&#21407;&#26469;&#19981;&#28789;&#30340;&#31639;&#27861;&#32452;&#21512;&#29616;&#22312;&#23601;&#21487;&#34892;&#20102;&#12290;&#25152;&#20197;&#23398;&#23398;&#20108;&#19977;&#21313;&#24180;&#21069;&#30340;&#19996;&#35199;&#36824;&#26159;&#34542;&#37325;&#35201;&#30340;&#12290;RT &#35199;&#29916;&#22823;&#20024;&#23376;&#27748;:90 &#24180;&#20195;&#26411;&#65292;&#20154;&#24037;&#26234;&#33021;&#30340;&#21508;&#20010;&#26041;&#27861;&#37117;&#21483;&#27169;&#24335;&#35782;&#21035;&#65306;&#32479;&#35745;&#27169;&#24335;&#35782;&#21035;&#65292;&#21477;&#27861;&#27169;&#24335;&#35782;&#21035;&#65292;&#31070;&#32463;&#32593;&#32476;&#27169;&#24335;&#35782;&#21035;&#12290;&#32479;&#35745;&#27169;&#24335;&#35782;&#21035;&#21518;&#26469;&#25913;&#21517;&#26426;&#22120;&#23398;&#20064;&#12290;&#29616;&#22312;&#24050;&#32463;&#27809;&#22810;&#23569;&#20154;&#35828;&#21477;&#27861;&#27169;&#24335;&#35782;&#21035;&#20102;&#65292;&#21518;&#26469;&#20961;&#26159;&#21644;&#32467;&#26500;&#21270;&#27838;&#28857;&#36793;&#30340;&#37117;&#31216;&#20026;&#30693;&#35782;&#22270;&#35889;&#12290;&#37027;&#26102;&#20505;&#36824;&#26377;&#19968;&#20010;&#35789;&#21483;&#8220;&#22522;&#20110;&#20869;&#23481;&#30340;&#26816;&#32034;&#8221;CBR&#65292;&#29616;&#22312;&#30340;&#21508;&#31181;&#35270;&#39057;&#35782;&#21035;&#24403;&#26102;&#37117;&#26159; CBR&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/1932835417/status4046788765845276.html#utm_source=rss">&#35199;&#29916;&#22823;&#20024;&#23376;&#27748;:&#36824;&#19981;&#26159;TBTF(too big to fail)RT</a> <code class="fold">@</code></dt>
<dd><p>&#25991;&#22240;&#20114;&#32852;:#&#25991;&#22240;&#30740;&#25253;&#31934;&#36873;# &#36817;&#24180;&#26469;&#65292;&#21508;&#22823;&#38134;&#34892;&#30340;&#20928;&#21033;&#28070;&#22686;&#36895;&#22238;&#33853;&#29978;&#33267;&#36300;&#30772;&#38646;&#65292;&#22830;&#34892;&#21103;&#34892;&#38271;&#24352;&#28059;&#26356;&#26159;&#35821;&#20986;&#24778;&#20154;&#22320;&#25351;&#20986;&#65306;&#8220;&#20160;&#20040;&#26159;&#31283;&#23450;&#30340;&#37329;&#34701;&#31209;&#24207;&#65311;&#19981;&#26159;&#20445;&#25252;&#37329;&#34701;&#34892;&#19994;&#30340;&#27599;&#19968;&#20010;&#26426;&#26500;&#37117;&#19981;&#22833;&#36133;&#65292;&#37117;&#19981;&#20986;&#20219;&#20309;&#39118;&#38505;&#65307;&#32780;&#26159;&#23545;&#20986;&#29616;&#32463;&#33829;&#39118;&#38505;&#12289;&#25110;&#32773;&#32463;&#33829;&#22833;&#36133;&#30340;&#37329;&#34701;&#26426;&#26500;&#65292;&#35201;&#20801;&#35768;&#23427;&#20204;&#30772;&#20135;&#65292;&#23454;&#29616;&#24066;&#22330;&#30340;&#20248;&#32988;&#21155;&#27760;&#12290;&#8221; &#24503;&#21220;&#21457;&#24067;&#12298;&#35686;&#38047;&#20026;&#35841;&#32780;&#40483;&#8212;&#8212;&#8230;&#20840;&#25991;&#65306; http://m.weibo.cn/5756099182/4046787565597263</p>
<p><a href="https://www2.deloitte.com/content/dam/Deloitte/cn/Documents/risk/deloitte-cn-ers-financial-institute-crisis-zh-161123.pdf">Proposal_A4 - deloitte-cn-ers-financial-institute-crisis-zh-161123.pdf</a></p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://icube-icps.unistra.fr/img_auth.php/d/db/ModernC.pdf">Modern C - ModernC.pdf</a> <code class="fold">@</code></dt>
<dd><p>310 pages.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://cn.engadget.com/2016/11/28/zotac-vr-go-pc/">Zotac &#30495;&#30340;&#25512;&#20986;&#20102; VR Go &#32972;&#21253; PC&#65288;&#26356;&#26032;&#65306;&#39321;&#28207;&#19978;&#24066;&#36164;&#35759;&#65289;</a> <code class="fold">@</code></dt>
<dd><p>&#36825;&#21488;&#21517;&#20026;&#12300;VR Go&#12301;&#30340;&#32972;&#21253;&#30005;&#33041;&#27604;&#24819;&#20687;&#20013;&#35201;&#22823;&#19978;&#19981;&#23569;&#65292;&#37197;&#22791;&#26377; Core i7-6700T &#26700;&#30005;&#22788;&#29702;&#22120;&#12289;16GB RAM&#65288;&#21487;&#25193;&#23637;&#33267; 32GB&#65289;&#12289;240GB SSD&#65288;&#36824;&#26377;&#19968;&#20010;&#31354;&#30340; 2.5 &#21515;&#30828;&#30424;&#23433;&#35013;&#31354;&#38388;&#65289;&#12289;NVIDIA GTX 1070 &#26174;&#21345;&#12289;&#21644;&#20004;&#39063; 95Wh &#30005;&#27744;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/28/ai-creates-videos-of-the-future/">AI can create videos of the future</a> <code class="fold">@</code></dt>
<dd><p>Loads of devices can preserve moments on camera, but what if you could capture situations that were about to happen? It&#8217;s not as far-fetched as you might think. MIT CSAIL researchers have crafted a deep learning algorithm that can create videos showing <strong>what it expects to happen</strong> in the future. After extensive training (2 million videos), the AI system generates footage by pitting two neural networks against each other. One creates the scene by determining which objects are moving in still frames. The other, meanwhile, serves as a quality check &#8211; it determines whether videos are real or simulated, and the artificial video is a success when the checker AI is fooled into thinking the footage is genuine.</p>
<div class="figure">
<img src="https://s.aolcdn.com/dims5/amp:3e66ab481354485808ea5040970c214af7b999f3/q:100/?url=http%3A%2F%2Fo.aolcdn.com%2Fhss%2Fstorage%2Fmidas%2F9eda71f074f1158edc80d0ee0eb35409%2F204639307%2Fmit-ai-video-prediction.jpg" />

</div>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/2201566133/status4046917678302975.html#utm_source=rss">&#38472;&#34382;&#24179;:&#24605;&#32500;&#26159;&#19968;&#23618;&#23618;&#38138;&#19978;&#21435;&#30340;&#12290;</a> <code class="fold">@</code></dt>
<dd><p><a href="http://weibo.com/ttarticle/p/show?id=2309614036656125577198">&#20026;&#20160;&#20040;&#30475;&#20070;&#26102;&#33041;&#23376;&#37324;&#24635;&#26377;&#20010;&#23567;&#20154;&#20799;&#22312;&#35828;&#35805;&#65311;</a></p>
<p>&#20869;&#22312;&#22768;&#38899;&#65288;inner voice&#65289;&#25110;&#20869;&#22312;&#23545;&#35805;&#65288;inner speech&#65289;&#26159;&#27491;&#24120;&#20154;&#29983;&#27963;&#30340;&#19968;&#37096;&#20998;&#12290;&#23427;&#19981;&#20165;&#20986;&#29616;&#22312;&#25105;&#20204;&#30340;&#35760;&#24518;&#65288;&#8220;&#21035;&#24536;&#20102;&#25509;&#23401;&#23376;&#12290;&#8221;&#65289;&#65292;&#35745;&#21010;&#65288;&#8220;&#25105;&#20808;&#36319; Tracy &#21917;&#21654;&#21857;&#65292;&#28982;&#21518;&#20080;&#19996;&#35199;&#65292;&#22238;&#26469;&#39034;&#36335;&#25509;&#23401;&#23376;&#12290;&#8221;&#65289;&#21644;&#21453;&#24605;&#65288;&#8220;&#25105;&#24590;&#20040;&#25226;&#23401;&#23376;&#32473;&#24536;&#20102;&#65281;&#8221;&#65289;&#20013;&#65292;&#19982;&#36923;&#36753;&#24605;&#32500;&#21644;&#33258;&#25105;&#28608;&#21169;&#26426;&#21046;&#20063;&#24687;&#24687;&#30456;&#20851;&#12290;&#23427;&#26159;&#25105;&#20204;&#33258;&#25105;&#24847;&#35782;&#30340;&#23384;&#22312;&#26631;&#24535;&#12290;&#20869;&#22312;&#22768;&#38899;&#29978;&#33267;&#21487;&#33021;&#23601;&#26159;&#25105;&#20204;&#30340;&#28789;&#39746;&#26412;&#36523;&#65292;&#20174;&#32780;&#26377;&#21202;&#22856;&#8226;&#31515;&#21345;&#23572;&#33879;&#21517;&#30340;&#35770;&#26029;&#65306;&#8220;&#25105;&#24605;&#25925;&#25105;&#22312;&#12290;&#65288;&#25289;&#19969;&#35821;&#65306;Cogito, ergo sum&#65307;&#27861;&#35821;&#65306;Je pense, donc je suis&#65289;&#8221;</p>
<p>&#36138;&#23146;&#30340;&#31070;&#32463;&#36824;&#21407;&#35770;&#26159;&#27809;&#26377;&#21069;&#36884;&#30340;&#65292;&#36825;&#31687;&#25991;&#31456;&#26159;&#19968;&#20010;&#20363;&#23376;&#12290;&#35299;&#37322;&#40664;&#35835;&#23567;&#20154;&#30340;&#29616;&#35937;&#65292;&#20174;&#22810;&#23618;&#36824;&#35748;&#30693;&#21017;&#27604;&#36739;&#23481;&#26131;&#12290; &#26159;&#19981;&#26159;&#36234;&#29087;&#30340;&#24819;&#27861;&#36234;&#19981;&#38656;&#35201;&#40664;&#35835;&#65311;&#19981;&#29087;&#24713;&#25165;&#35201;&#40664;&#35835;&#65292;&#36275;&#22815;&#19981;&#29087;&#24713;&#20197;&#33267;&#20110;&#36830;&#22522;&#26412;&#27010;&#24565;&#37117;&#27809;&#26377;&#65292;&#23601;&#20250;&#35828;&#20986;&#26469;&#65292;&#36890;&#36807;&#33258;&#35328;&#33258;&#35821;&#25110;&#29420;&#30333;&#26469;&#24378;&#21270;&#22823;&#33041;&#24605;&#32500;&#32534;&#31243;&#65292;&#23567;&#23401;&#23601;&#26159;&#36825;&#26679;&#12290;&#19987;&#19994;&#20154;&#22763;&#35835;&#19987;&#19994;&#20070;&#65292;&#21487;&#20197;&#19968;&#30446;&#21313;&#34892;&#65292;&#27809;&#26377;&#40664;&#35835;&#65292;&#29978;&#33267;&#19968;&#36793;&#35835;&#12289;&#19968;&#36793;&#26500;&#24314;&#20102;&#25209;&#21028;&#24615;&#30340;&#35780;&#35770;&#65292;&#19981;&#20165;&#27809;&#26377;&#40664;&#35835;&#23567;&#20154;&#65292;&#32780;&#19988;&#36824;&#26377;&#19968;&#20010;&#20889;&#20316;&#23567;&#20154;&#22312;&#26049;&#36793;&#24110;&#24537;&#20284;&#30340;&#12290; &#24605;&#32500;&#30340;&#28860;&#25104;&#65292;&#23601;&#26159;&#36890;&#36807;&#25226;&#33041;&#37324;&#30340;&#27010;&#24565;&#22806;&#37096;&#21270;&#65292;&#36890;&#36807;&#35821;&#38899;&#12289;&#29420;&#30333;&#12289;&#23545;&#35805;&#12289;&#22721;&#30011;&#12289;&#35937;&#24418;&#25991;&#23383;&#12289;&#25925;&#20107;&#12289;&#23567;&#35828;&#12289;&#36777;&#35770;&#12289;&#35770;&#36848;&#25991;&#31456;&#65292;&#19968;&#27493;&#27493;&#24314;&#31435;&#36215;&#20154;&#31867;&#30340;&#22797;&#26434;&#23618;&#32423;&#21270;&#30340;&#24605;&#32500;&#65292;&#27599;&#19968;&#23618;&#37117;&#26159;&#24605;&#32500;&#24037;&#20855;&#30340;&#21019;&#26032;&#65292;&#36825;&#19968;&#21019;&#26032;&#21448;&#20026;&#26032;&#19968;&#23618;&#30340;&#21019;&#26032;&#25171;&#24320;&#20102;&#28508;&#22312;&#31354;&#38388;&#12290;&#20174;&#24188;&#20799;&#21040;&#25104;&#24180;&#21040;&#19987;&#23478;&#65292;&#21482;&#26377;&#19968;&#23618;&#19968;&#23618;&#30340;&#21319;&#32423;&#65292;&#25165;&#33021;&#35753;&#35821;&#35328;&#21644;&#24605;&#32500;&#30475;&#36215;&#26469;&#33258;&#30001;&#27969;&#28108;&#12290;&#27809;&#26377;&#21738;&#20010;&#38454;&#27573;&#26159;&#21487;&#20197;&#36339;&#36807;&#30340;&#12290; &#40664;&#35835;&#23567;&#20154;&#21482;&#26159;&#20854;&#20013;&#19968;&#20010;&#38454;&#27573;&#32780;&#24050;&#65292;&#23427;&#26159;&#26032;&#30340;&#35821;&#35328;&#21464;&#24322;&#23545;&#33258;&#24049;&#24050;&#32463;&#23433;&#35013;&#30340;&#35821;&#35328;&#31243;&#24207;&#21253;&#30340;&#20877;&#32534;&#31243;&#65292;&#36825;&#31181;&#20877;&#32534;&#31243;&#21040;&#19968;&#23450;&#31243;&#24230;&#65292;&#23601;&#20250;&#24418;&#25104;&#19968;&#20010;&#39640;&#24230;&#31283;&#23450;&#30340;&#27169;&#22359;&#65292;&#21487;&#20197;&#30452;&#25509;&#36816;&#34892;&#65292;&#21482;&#26377;&#29305;&#23450;&#30340;&#21050;&#28608;&#21457;&#29983;&#65292;&#23427;&#23601;&#20250;&#36816;&#34892;&#12290;&#23601;&#36825;&#20010;&#27169;&#22359;&#32780;&#35328;&#65292;&#30001;&#20110;&#32451;&#20064;&#24050;&#32463;&#32467;&#26463;&#65292;&#25110;&#32773;&#65292;&#20511;&#29992;&#36213;&#21335;&#20803;&#25945;&#25480;&#22312;&#12298;&#35748;&#30693;&#31185;&#23398;&#25581;&#31192;&#12299;&#20013;&#30340;&#35828;&#27861;&#65292;&#20174;&#36719;&#32467;&#26500;&#21464;&#25104;&#30828;&#32467;&#26500;&#65292;&#23601;&#19981;&#20877;&#26377;&#40664;&#35835;&#21363;&#21021;&#38454;&#32451;&#20064;&#30340;&#24517;&#35201;&#12290;&#32780;&#23545;&#20110;&#26032;&#26469;&#30340;&#26032;&#20449;&#24687;&#65292;&#21017;&#21448;&#26377;&#20986;&#22768;&#32451;&#20064;&#12289;&#40664;&#35835;&#32451;&#20064;&#12289;&#35762;&#36848;&#12289;&#20889;&#20316;&#31561;&#21508;&#23618;&#32451;&#20064;&#30340;&#24517;&#35201;&#20102;&#12290;&#30001;&#20110;&#22312;&#29616;&#20195;&#31038;&#20250;&#65292;&#25105;&#20204;&#26102;&#26102;&#38754;&#23545;&#26032;&#39046;&#22495;&#20449;&#24687;&#65292;&#40664;&#35835;&#27604;&#20197;&#21069;&#26356;&#39057;&#32321;&#20102;&#65292;&#36825;&#21482;&#26159;&#22240;&#20026;&#65292;&#19981;&#29087;&#24713;&#30340;&#20107;&#24773;&#24635;&#22312;&#21457;&#29983;&#65292;&#29978;&#33267;&#65292;&#22914;&#26524;&#20320;&#19981;&#20027;&#21160;&#20851;&#38381;&#19968;&#20123;&#20449;&#24687;&#28192;&#36947;&#65292;&#23427;&#20204;&#36824;&#20250;&#26356;&#39640;&#39057;&#30340;&#21457;&#29983;&#12290;&#27605;&#31455;&#65292;&#23186;&#20307;&#65292;&#23588;&#20854;&#20114;&#32852;&#32593;&#23186;&#20307;&#65292; is paid to get your attention&#12290; &#33267;&#20110;&#20986;&#22768;&#32451;&#20064;&#25110;&#40664;&#35835;&#32451;&#20064;&#38656;&#35201;&#20160;&#20040;&#24515;&#29702;&#27169;&#22359;&#65292;&#36825;&#20123;&#24515;&#29702;&#27169;&#22359;&#21448;&#38656;&#35201;&#20160;&#20040;&#31070;&#32463;&#22238;&#36335;&#65292;&#36825;&#19981;&#26159;&#20165;&#20165;&#20174;&#26041;&#27861;&#35770;&#21644;&#23439;&#35266;&#21508;&#23618;&#30340;&#20107;&#23454;&#25152;&#33021;&#29702;&#35299;&#30340;&#12290;&#20294;&#21487;&#20197;&#30830;&#35748;&#30340;&#26159;&#65292;&#21482;&#26159;&#23545;&#24212;&#21040;&#31070;&#32463;&#23618;&#65292;&#32943;&#23450;&#26159;&#19981;&#22815;&#30340;&#12290;&#36825;&#19982;&#22914;&#19979;&#24773;&#20917;&#21516;&#29702;&#65306;&#19981;&#33021;&#20174;&#20154;&#26159;&#19968;&#22534;&#26377;&#26426;&#22823;&#20998;&#23376;&#25512;&#20986;&#25152;&#20197;&#20154;&#29983;&#27809;&#26377;&#24847;&#20041;&#65292;&#20063;&#19981;&#33021;&#35828;&#20154;&#29983;&#30340;&#24847;&#20041;&#23601;&#26159;&#20026;&#20102;&#28385;&#36275;&#19968;&#22534;&#26377;&#26426;&#22823;&#20998;&#23376;&#30340;&#30446;&#26631;&#20989;&#25968;&#65292;&#22240;&#20026;&#36825;&#37117;&#26159;&#25226;&#20154;&#29983;&#36825;&#31181;&#23618;&#38754;&#36138;&#23146;&#30340;&#24748;&#23830;&#36824;&#21407;&#21040;&#22522;&#22240;&#23618;&#38754;&#20102;&#65292;&#30001;&#20110;&#35805;&#24448;&#29408;&#37324;&#35828;&#65292;&#30475;&#36215;&#26469;&#36824;&#24456;&#8220;&#28145;&#21051;&#8221;&#65288;&#19968;&#20010;&#39532;&#19978;&#24819;&#21040;&#30340;&#20363;&#23376;&#26159;&#20315;&#23478;&#24120;&#35828;&#30340;&#65292;&#19968;&#20999;&#30342;&#34394;&#22916;&#65292;&#25226;&#19968;&#20999;&#37117;&#36824;&#21407;&#20026;&#39640;&#27874;&#21160;&#39640;&#24046;&#24322;&#30340;&#24515;&#29702;&#29616;&#35937;&#65289;&#12290;&#35748;&#30693;&#31070;&#32463;&#31185;&#23398;&#26159;&#22909;&#19996;&#35199;&#65292;&#20294;&#22312;&#35768;&#22810;&#23439;&#35266;&#29616;&#35937;&#30340;&#35299;&#37322;&#19978;&#65292;&#26377;&#31867;&#20284;&#30340;&#39118;&#38505;&#12290;</p>
<p>&#24605;&#32500;&#26159;&#19968;&#23618;&#23618;&#38138;&#19978;&#21435;&#30340;&#12290;&#20808;&#31070;&#32463;&#38138;&#22312;&#31070;&#32463;&#19978;&#65292;&#20877;&#22238;&#36335;&#38138;&#19978;&#21435;&#65292;&#38543;&#30528;&#20449;&#24687;&#22810;&#26679;&#24615;&#22686;&#21152;&#65292;&#29305;&#23450;&#23618;&#22788;&#29702;&#29305;&#23450;&#36890;&#36947;&#20449;&#24687;&#30340;&#32467;&#26500;&#19981;&#22815;&#29992;&#65292;&#21457;&#26126;&#20102;&#22806;&#37096;&#26631;&#20934;&#29983;&#20135;&#32447;&#65292;&#22914;&#21483;&#22768;&#65292;&#20197;&#32479;&#19968;&#21483;&#22768;&#20026;&#27169;&#29256;&#26469;&#34920;&#24449;&#38750;&#21608;&#26399;&#20449;&#24687;&#65292;&#25509;&#30528;&#26159;&#29420;&#30333;&#12289;&#23545;&#35805;&#65292;&#25991;&#23383;&#26356;&#22909;&#20284;&#21360;&#21047;&#30005;&#36335;&#26495;&#65292;&#26032;&#23618;&#22312;&#24050;&#26377;&#23618;&#19978;&#21051;&#20889;&#65292;&#27809;&#26377;&#35821;&#35328;&#25991;&#23383;&#23601;&#19981;&#20250;&#26377;&#21487;&#25551;&#36848;&#21487;&#35299;&#26512;&#30340;&#33258;&#25105;&#24847;&#35782;&#12290;</p>
<dl>
<dt>&#20808;&#22825;&#22833;&#32874;&#32773;&#20250;&#26377;&#20869;&#22312;&#22768;&#38899;&#21527;&#65311;</dt>
<dd><p>&#20107;&#23454;&#19978;&#20808;&#22825;&#22833;&#32874;&#20165;&#24433;&#21709;&#20869;&#22312;&#22768;&#38899;&#30340;&#24418;&#24335;&#32780;&#38750;&#23384;&#22312;&#65292;&#20182;&#20204;&#30340;&#20869;&#22312;&#22768;&#38899;&#26159;&#20197;&#25163;&#35821;&#30340;&#24418;&#24335;&#24037;&#20316;&#12290;&#30456;&#20851;&#30740;&#31350;&#21457;&#29616;&#65292;&#20808;&#22825;&#22833;&#32874;&#32773;&#22312;&#36827;&#34892;&#20869;&#22312;&#23545;&#35805;&#26102;&#25152;&#28608;&#27963;&#30340;&#22823;&#33041;&#21306;&#22495;&#19982;&#26222;&#36890;&#20154;&#26159;&#23436;&#20840;&#30456;&#21516;&#30340;&#12290;</p>
</dd>
</dl>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/28/droneshield-anti-drone-gun/">Anti-drone gun takes down targets from 1.2 miles away</a> <code class="fold">@</code></dt>
<dd><p>There are numerous systems built to take down wayward or dangerous drones, but they tend to have one big catch: you need to be relatively close to the drone, which could be scary if the robotic aircraft is packing explosives. DroneShield thinks it can help. It&#8217;s introducing the DroneGun, a jammer that disables drone signals (including GPS and GLONASS positioning) from as far as 1.2 miles away. Like most rivals, it doesn&#8217;t destroy the target drone &#8211; it just forces the vehicle to land or return to its starting point. Anti-drone teams can not only disable threats from a safe distance, but potentially locate their pilots.</p>
<p>&#26377;&#28857;&#40657;&#31185;&#25216;&#30340;&#24863;&#35273;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.douban.com/note/594268999/">&#12302;&#38463;&#30007;&#38386;&#32842;&#12303;&#65290;&#23398;&#20064;&#30340;&#26412;&#36136;&#65290;</a> <code class="fold">@</code></dt>
<dd><p>&#23601;&#26159;&#65306;&#25345;&#32493;&#30340;&#25237;&#20837;&#26102;&#38388;&#21644;&#35757;&#32451;&#21487;&#20197;&#35753;&#20320;&#36798;&#21040;&#20013;&#32423;&#65292;&#20294;&#36798;&#21040;&#19981;&#20102;&#19987;&#23478;&#32423;&#65292;&#26356;&#36798;&#21040;&#19981;&#20102;&#22823;&#24072;&#32423;&#12290;</p>
<p>&#20030;&#20010;&#20363;&#23376;&#65306;&#22312;&#24085;&#26684;&#23612;&#23612;&#20043;&#21069;&#65292;&#20320;&#20877;&#24590;&#20040;&#21162;&#21147;&#32451;&#20064;&#65292;&#20320;&#20063;&#23398;&#19981;&#20250;&#24038;&#25163;&#25320;&#24358;&#65292;&#21452;&#27867;&#38899;&#65292;&#36830;&#39039;&#24339;&#65292;&#22240;&#20026;&#36825;&#20123;&#25216;&#24039;&#22312;&#24403;&#26102;&#26681;&#26412;&#19981;&#23384;&#22312;&#65281;&#21482;&#26377;&#24085;&#26684;&#23612;&#23612;&#20197;&#21518;&#65292;&#25165;&#26377;&#36825;&#31181;&#26354;&#23376;&#32473;&#20320;&#32451;&#65281;</p>
<p>&#19968;&#20010;&#22823;&#24072;&#65292;&#25913;&#20889;&#20102;&#28216;&#25103;&#35268;&#21017;&#65292;&#37325;&#26032;&#23450;&#20041;&#20102;&#23567;&#25552;&#29748;&#36825;&#38376;&#20048;&#22120;&#65292;&#21518;&#20154;&#20110;&#26159;&#23454;&#29616;&#20102;&#36328;&#36234;&#24335;&#21457;&#23637;&#12290;</p>
<p>&#24635;&#32467;&#65306;</p>
<ul>
<li>&#21035;&#20154;&#25644;&#19981;&#25644;&#30742;&#19981;&#35201;&#31649;&#65292;&#33258;&#24049;&#35201;&#26377;&#21191;&#27668;&#19981;&#25644;&#30742;</li>
<li>&#33021;&#36339;&#21040;&#26356;&#39640;&#32423;&#30340;&#34892;&#19994;&#65292;&#22914;&#26524;&#33258;&#24049;&#21448;&#24456;&#21916;&#27426;&#65292;&#37027;&#23601;&#19981;&#35201;&#29369;&#35947;</li>
<li>&#22914;&#26524;&#24456;&#24184;&#36816;&#22312;&#20174;&#20107;&#32423;&#21035;&#27604;&#36739;&#39640;&#65292;&#33258;&#24049;&#21448;&#21916;&#27426;&#30340;&#34892;&#19994;&#65292;&#23601;&#22312;&#26412;&#34892;&#19994;&#20869;&#36328;&#36234;</li>
<li>&#21035;&#25240;&#33150;&#65292;&#21035;&#20498;&#36710;</li>
</ul>
<p>&#26426;&#22120;&#23398;&#20064;&#30340;&#30740;&#31350;&#21578;&#35785;&#25105;&#20204;&#65292;&#24403;&#31070;&#32463;&#32593;&#32476;&#23618;&#25968;&#22797;&#26434;&#21040;&#19968;&#23450;&#31243;&#24230;&#26102;&#65292;&#23601;&#20250;&#20135;&#29983;&#8220;&#26234;&#33021;&#8221;&#65292;&#20174;&#32780;&#26377;&#33021;&#21147;&#27714;&#38750;&#32447;&#24615;&#38382;&#39064;&#30340;&#35299;&#12290;</p>
<p>&#20154;&#33258;&#36523;&#21448;&#20309;&#23581;&#19981;&#26159;&#21602;&#65311;<strong>&#35753;&#33258;&#24049;&#20016;&#23500;&#36215;&#26469;&#65374;</strong></p>
</dd>
</dl></li>
<li><p><a href="http://sorentwo.com/2013/12/30/let-postgres-do-the-work.html">Let Postgres Do The Work | S&#248;ren</a></p></li>
<li><p><a href="http://weibo.wbdacdn.com/user/1932835417/status4046439291973115.html#utm_source=rss" class="hearts">&#35199;&#29916;&#22823;&#20024;&#23376;&#27748;:&#31070;&#22411;&#30342;&#22791;&#65292;&#21497;&#20026;&#35266;&#27490;RT &#38738;&#32418;&#36896;&#20102;&#20010;&#30333;:&#27431;&#32654;&#29256;&#27700;&#27986;(&#37096;&#20998;)&#12290;</a></p></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/1932835417/status4046441351091116.html#utm_source=rss">&#35199;&#29916;&#22823;&#20024;&#23376;&#27748;: &#26377;&#20004;&#31181;&#35745;&#31639;&#26426;&#31185;&#23398;&#23478;</a> <code class="fold">@</code></dt>
<dd><p>&#26377;&#20004;&#31181;&#35745;&#31639;&#26426;&#31185;&#23398;&#23478;&#65306;</p>
<ul>
<li>McCarthy &#36825;&#31867;&#65292;&#25226;&#35745;&#31639;&#26426;&#24403;&#25104;&#35299;&#20915;&#38382;&#39064;&#30340;&#24037;&#20855;&#12290;</li>
<li>Doug &#36825;&#31867;&#65292;&#25226;&#35745;&#31639;&#26426;&#24403;&#25104;&#20154;&#30340;&#24310;&#20280;&#21644;&#36830;&#25509;&#12290;</li>
</ul>
<p>&#21069;&#19968;&#31867;&#22810;&#32771;&#34385;&#26426;&#22120;&#30340;&#25928;&#29575;&#21644;&#33021;&#21147;&#65292;&#21518;&#19968;&#31867;&#26159;&#22810;&#32771;&#34385;&#20154;&#26426;&#20316;&#20026;&#19968;&#20010;&#31995;&#32479;&#30340;&#25928;&#29575;&#21644;&#33021;&#21147;&#12290;RT &#35199;&#29916;&#22823;&#20024;&#23376;&#27748;: &#21521;&#22823;&#23478;&#25512;&#33616; Douglas Engelbart &#30340;&#20070;&#65292;&#26368;&#30701;&#30340; Boosting Our Collective IQ http://t.cn/R7UZhIU &#21482;&#26377;&#19977;&#21313;&#22810;&#39029;&#65292;&#20294;&#25105;&#35273;&#24471;&#27604;&#65308;&#22833;&#25511;&#65310;&#22909;&#21313;&#20493;&#65294;&#21478;&#22806;&#20004;&#26412;&#65308;Bootstrapping&#65310;&#65308;The Engelbart Hypothesis&#65310;&#19981;&#26159;&#20182;&#20889;&#30340;&#65288;&#20182;&#25165;&#27809;&#31354;&#20889;&#65289;&#65292;&#19981;&#36807;&#37117;&#26159;&#23545;&#20182;&#30340;&#37319;&#35775;&#65292;&#20063;&#27604;&#36739;&#22909;&#65294;Doug &#23545;&#20154;&#31867;&#30340;&#24433;&#21709;&#26497;&#20026;&#28145;&#36828;&#65292;&#34429;&#28982;&#22823;&#22810;&#25968;&#20154;&#19981;&#30693;&#36947;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://github.com/skx/bookmarks.public/">skx/bookmarks.public: A template for self-hosted bookmarks using HTML &amp; jQuery.</a> <code class="fold">@</code></dt>
<dd><p>&#30495;&#26159;&#27809;&#25630;&#25026;&#8230;&#8230;</p>
<p>&#25105;&#35273;&#24471;&#36825;&#19996;&#35199;&#24212;&#35813;&#29992; Java &#20889;&#65292;&#28982;&#21518;&#24320;&#19968;&#20010; web &#26381;&#21153;&#22120;&#12290;</p>
<p>&#20854;&#23454;&#21482;&#26159;&#19968;&#20010;&#27010;&#24565;&#65306;&#29992;&#25991;&#26412;&#23384;&#25968;&#25454;&#65292;&#29992;&#33258;&#24049;&#25552;&#20379;&#30340; UI &#26469;&#25805;&#20316;&#12290;&#21487;&#20197;&#29992; GitHub &#23384;&#20648; &amp; git &#29256;&#26412;&#25511;&#21046;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.quora.com/Im-Chinese-I-will-go-to-university-in-America-but-Im-afraid-of-racism-Are-there-many-people-in-America-who-dont-like-Asians/answer/Bernard-Wang" class="hearts">Bernard Wang&#8217;s answer to I&#8217;m Chinese. I will go to university in America, but I&#8217;m afraid of racism. Are there many people in America who don&#8217;t like Asians? - Quora</a> <code class="fold">@</code></dt>
<dd><p>Racism against foreign Asian students, especially Chinese students, is becoming a prevalent social issue for many high-ranking U.S. institutions.</p>
<p>On the other hand, the Chinese students&#8217; attempts at socialization are often met with contemptful, disgusted, condescending attitudes from the American students, which discourage any further attempt at socialization from the Chinese students&#8217; perspective. If the attitude from Americans is so hostile, what other choice do we have than to group up with each other?</p>
<p>The more accurate description of this issue, in my opinion, is that <strong>Confucian behavior is optimized for Confucian society, and western behavior is optimized for western society</strong>. However, when a Confucian-cultured individual moves to a western environment, the dissonance (<code>['d&#618;s&#601;n&#601;ns]</code> n. &#19981;&#19968;&#33268;&#65307;&#19981;&#35843;&#21644;&#65307;&#19981;&#21644;&#35856;&#38899;) between the mannerisms of the two disparate cultures results in the friction you perceive. Let&#8217;s take a few eastern behaviors as example to see why they don&#8217;t hold up in American society:</p>
</dd>
</dl></li>
<li><p><a href="https://cdn.ampproject.org/c/s/amp.businessinsider.com/steven-strogatz-interview-on-math-education-2016-6">Steven Strogatz interview on math education</a></p></li>
<li><dl>
<dt><a href="http://patshaughnessy.net/2016/11/26/learning-to-read-x86-assembly-language" class="hearts">Learning to Read x86 Assembly Language - Pat Shaughnessy</a> <code class="fold">@</code></dt>
<dd><p>Hacker news rank 1.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/5493934570/status4046695799332520.html#utm_source=rss">&#39118;&#20113;&#23398;&#20250;&#38472;&#32463;:&#25903;&#20184;&#23453;&#36825;&#20040;&#25630;&#65292;&#25105;&#30475;&#23601;&#24456;&#22909;</a> <code class="fold">@</code></dt>
<dd><p>http://t.cn/Rfj4BRC &#36825;&#31687;&#22066;&#35773;&#30340;&#19981;&#38169;&#12290;&#20013;&#22269;&#20114;&#32852;&#32593;&#33286;&#35770;&#30340;&#22522;&#35843;&#19981;&#26159;&#21387;&#25233;&#65292;&#32780;&#26159;&#35843;&#20355;&#24189;&#40664;&#12290;</p>
<p>refs and see also</p>
<ul>
<li><a href="http://mp.weixin.qq.com/s/_Yr2mbmm6C03DBUG3Nl52Q">&#25903;&#20184;&#23453;&#36825;&#20040;&#25630;&#65292;&#25105;&#30475;&#23601;&#24456;&#22909;</a></li>
<li><a href="http://weibo.com/ttarticle/p/show?id=2309351000154046637029794185&amp;u=5110199966&amp;m=4046718602897491&amp;cu=5110199966">&#25903;&#20184;&#23453;&#8220;&#22280;&#23376;&#8221;&#19978;&#32447;&#22823;&#23610;&#24230;&#29031;&#29255;&#24341;&#36136;&#30097;</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://web.mit.edu/kolya/misc/txt/editors" class="hearts">lineage of vi</a> <code class="fold">@</code></dt>
<dd><p>&#30452;&#25509;&#19978;&#20840;&#25991;&#20102;&#12290;</p>
<p>lineage</p>
<ul>
<li><code>['l&#618;n&#618;&#618;d&#658;]</code></li>
<li>&#34880;&#32479;&#65307;&#23478;&#31995;&#65292;&#19990;&#31995;</li>
</ul>
<pre><code>From: Eric Fischer &lt;enf@pobox.com&gt;
Newsgroups: alt.os.multics,alt.folklore.computers
Message-ID: &lt;8utbrm$apg$1@bob.news.rcn.net&gt;
Subject: Re: emacs and other editors
Date: 15 Nov 2000 06:52:38 GMT

Joachim Pense  &lt;joachim_pense@hotmail.com&gt; wrote:

&gt; And, finally, what is the historical relation of qed(x)/ted to the Unix zoo
&gt; of editors (ed/ex/vi/sed...)?

What appears below looks dangerously Mentifex-like, but I assure you
it is actually supposed to represent a vi-centric family tree of editors.
Links that I can&#39;t prove but want to believe are shown as question marks.

There are undoubtedly errors and omissions, so if anyone can correct any
of these I would appreciate it.

eric

                                 Colossal Typewriter
                           by John McCarthy and Roland
                               Silver for the PDP-1  |   Photon typesetter
                                ?                    |   editors by Michael
                                ?                     \  Barnett &amp; Kalon
             Expensive Typewriter        CREATE/EDIT   \  Kelley for      TECO
           for PDP-1 by Steve Piner       for CTSS      \ IBM 704     for PDP-1
                   /         |           /     |  \      \__  \   by Dan Murphy
                  /          |          /      |   \        \  \            |
  * Expensive Typewriter  editors      EDITS   | MEMO/MODIFY |  |   VEDIT   |
    for PDP-1, improved    for       by Arthur | by Leslie   |  | by Victor |
    by Peter Deutsch      PDP-4,       Samuel  |   Lowry    /   |  Yngve    |
            |            PDP-5/8      for CTSS  \ for CTSS /  _/  for     PDP-6
            |                            ?   \_  \    |   / _/   CTSS  TECO by
           QED                           ?     \_ \   |  / /   /    Greenblatt,
    for Berkeley SDS-940                 ?       \ \  | | |  /       Holloway,
       by Deutsch and                  LINED    TYPSET for CTSS     and Nelson
       Butler Lampson                for PDP-6  by Jerry Saltzer     ?  |   |
         /           \                  |          |          |     ?   |   |
        /             \                 |      PDP-7/9 editor |    ?  DEC   |
      QED,          * QED               |                     |   ?  TECO   |
  as published      for CTSS            |     ????????????????|???          |
    in CACM     by Ken Thompson         |   ??                |            ITS
        |               |               |  ?      ED (and EDL, EDA, EDB)  TECO
        |               |             STOPGAP            for CTSS        /  |
        |              QED           for PDP-10              |          /  /
        |           for Multics    by Bill Weiher            |         /  |
        |       by Ken Thompson          |                  edit      |   |
        |         /         \           SOS            for Multics    |   |
        |        /           \       for PDP-10    by Charles Garman  |   |
        |      qedx          QED       by Steve           |       ___/    |
        |  for Multics     for GCOS      Savitzky         |      /     EMACS
        |               by Dennis Ritchie  ?            edm     /    in TECO
        |                    |             ?       for Multics /  by RMS et al.
      QUIDS                  |             ?                  /   /  |      |
by George Coulouris       * ed             ?            _____/   /   |      |
      et al.            for PDP-7 Unix     ?           /        /    |      |
        |              by Ken Thompson     ?          |        /     |      |
        |                   |              ?     ZED/DOC      /    Multics  |
        |                   |              ?   by Vaughan    /      EMACS   |
        |                  ed              ?    Pratt       /   by Bernard  |
        |               for Unix           ?   in TECO     /    Greenberg   |
        |           (various versions)     ?     |        /         |      /
        |                 |                ?     |       /           \    /
        |                 |               ?      |      /           GNU Emacs
         \               ed              ?      /      /
          \         for Unix v6         ?      /      /
           \      /     |     \        ?      /      /
            \   /   other eds  |      ?      /      /
             em      (UCLA?)   |     ?      /      /
Unix ed with additions    |    |    ?      |      /
 from George Coulouris     \   |   ?       |     /
   |      |          \__    |  |  ?        |    /
   |      |             \__ |  | ?         |   /
other     |                ex (v1)         |  /
 em       |      Unix ed with additions   /  /
variants  |      by Bill Joy and Charles /  /
         DED                Haley       /  /
   by Richard Bornat,         |        /  /
   Harold Thimbleby         ex (v2)   /  /
                    Unix ed with additions
                          by Bill Joy
                              |
                             ex/vi (v3)
                     extended by Mark Horton</code></pre>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://cn.engadget.com/2016/11/27/ransomware-exploits-facebook-and-linkedin-images/">&#21202;&#32034;&#36719;&#20214;&#36890;&#36807;&#33080;&#20070;&#20256;&#24352;&#22270;&#23601;&#33021;&#32465;&#26550;&#20320;&#30340;&#30005;&#33041;</a> <code class="fold">@</code></dt>
<dd><p>&#40657;&#31185;&#25216;&#8230;&#8230;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/27/san-francisco-transit-station-hack/">San Francisco transit stations fall victim to a hack</a> <code class="fold">@</code></dt>
<dd><p>San Franciscans just got an all-too-real demonstration of what it&#8217;s like when hackers attack urban infrastructure. The city&#8217;s Municipal Transportation Agency has confirmed that the Muni station computer system was hacked, leading officials to open fare gates, shut down ticket kiosks and otherwise make rides free on November 26th.</p>
</dd>
</dl></li>
<li><p><a href="http://weibo.wbdacdn.com/user/2208787052/status4046725603944321.html#utm_source=rss">Jeffrey-Infinity:43&#21495;&#25991;&#20986;&#21488;&#21069;&#21518;&#25105;&#22269;&#22522;&#24314;&#25237;&#34701;&#36164;&#27169;&#24335;&#23545;&#27604;</a></p></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/1788911247/status4046751402901288.html#utm_source=rss">&#35895;&#22823;&#30333;&#35805;:#&#27599;&#26085;&#19968;&#35789;# &#12304;spoonerism&#12305;</a> <code class="fold">@</code></dt>
<dd><p>&#12304;spoonerism&#12305;n. &#19968;&#31181;&#38169;&#20301;&#30340;&#21475;&#35823;&#12290;&#26377;&#28857;&#31867;&#20284;&#20013;&#25991;&#30340;&#8220;&#21608;&#26480;&#26829;&#30340;&#21452;&#25130;&#20262;&#8221;&#65292;&#8220;&#32769;&#19996;&#35199;&#65292;&#22823;&#29239;&#25105;&#24110;&#20320;&#25294;&#8221;&#12290;&#19981;&#21516;&#22312;&#20110; spoonerism &#26159;&#21333;&#35789;&#30340;&#36741;&#38899;&#20803;&#38899;&#38169;&#20301;&#20114;&#25442;&#12290;&#27604;&#36739;&#32463;&#20856;&#30340;&#26377; our dear old queen &#35828;&#25104; our queer old dean; &#25110;&#32773; Lord is a loving shepherd &#35828;&#25104; Lord is a shoving leopard&#128514;</p>
<p>&#35895;&#22823;&#26159;&#19981;&#26159;&#21457;&#20102;&#20960;&#36941;&#36825;&#20010;&#20102;&#8230;&#8230;</p>
</dd>
</dl></li>
<li><p><a href="https://github.com/AndreaOrru/LaiNES">AndreaOrru/LaiNES: Cycle-accurate NES emulator in ~1000 lines of code</a></p></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/1788911247/status4046778380427698.html#utm_source=rss">&#35895;&#22823;&#30333;&#35805;:&#36825;&#23567;&#20249;&#23376;&#20307;&#26684;&#30495;&#22909;&#21834;&#65281;RT &#35895;&#22823;&#30333;&#35805;:&#19968;&#20123;&#33521;&#25991;&#21475;&#35823;</a> <code class="fold">@</code></dt>
<dd><p>&#36825;&#23567;&#20249;&#23376;&#20307;&#26684;&#30495;&#22909;&#21834;&#65281;//M-precious-T&#65306;&#35895;&#22823;&#65292;&#25105;&#19968;&#20010;&#23398;&#29983;&#35828;&#20182;&#36319;&#20182;&#22899;&#31080;&#22825;&#22825;&#25171;&#65292;&#20174;&#26089;&#19978;&#23601;&#24320;&#22987;&#25171;&#65292;&#20294;&#26159;&#19981;&#20250;&#34920;&#36798; punch &#36825;&#20010;&#35789;&#65292;&#20182;&#23601;&#29992;&#20102;&#8220;she would blow me from morning to evening&#8221;&#8230; &#25105;&#20063;&#26159; [&#25674;&#25163;][&#25674;&#25163;][&#25674;&#25163;]</p>
</dd>
</dl></li>
<li><p><a href="https://www.zhihu.com/question/53022579/answer/133298778?from=profile_answer_card">&#22914;&#20309;&#30475;&#24453;&#27665;&#24037;&#21460;&#22240;&#20026; Teambition &#26159; React &#25216;&#26415;&#26632;&#32780;&#31163;&#32844;&#65311; - &#24464;&#39134;&#30340;&#22238;&#31572; - &#30693;&#20046;</a></p></li>
<li><dl>
<dt><a href="https://www.zhihu.com/question/47647183/answer/108834047?dt_dapp=1">&#21271;&#20140;&#30340;&#25151;&#20215;&#26159;&#19981;&#26159;&#27491;&#22312;&#36879;&#25903;&#30528;&#21271;&#20140;&#24180;&#36731;&#20154;&#30340;&#21019;&#36896;&#21147;&#21644;&#29983;&#27963;&#21697;&#36136;&#65311; - &#28151;&#27788;&#26928;&#23376;&#29579;&#30340;&#22238;&#31572; - &#30693;&#20046;</a> <code class="fold">@</code></dt>
<dd><p>1&#65292;&#27809;&#26377;&#20154;&#35828;&#25151;&#20215;&#20415;&#23452;&#65292;&#25151;&#20215;&#20174;&#26469;&#23601;&#19981;&#20415;&#23452;&#12290;&#22914;&#26524;&#20320;&#30340;&#26790;&#24819;&#26159;&#22312;&#19968;&#20010;&#22823;&#22478;&#24066;&#23433;&#23621;&#20048;&#19994;&#65292;&#23436;&#25104;&#20320;&#30340;&#19978;&#20960;&#36744;&#20154;&#26080;&#27861;&#23436;&#25104;&#30340;&#20255;&#19994;&#65292;&#35831;&#25343;&#20986;&#38754;&#23545;&#26790;&#24819;&#26102;&#35813;&#26377;&#30340;&#35802;&#24847;&#12290;</p>
<p>&#160;&#160;&#22810;&#35835;&#20070;&#65292;&#22810;&#36186;&#38065;&#65292;&#23569;&#25265;&#24616;&#12290;<br />
&#160;&#160;&#36807;&#21435;&#27809;&#26377;&#20320;&#24819;&#30340;&#37027;&#20040;&#22909;&#65292;<br />
&#160;&#160;&#26410;&#26469;&#27809;&#26377;&#20320;&#24819;&#30340;&#37027;&#20040;&#24046;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.com/ttarticle/p/show?id=2309404046501243429255">&#31934;&#31070;&#30239;&#30123;&#20043;&#36335;&#8212;&#8212;&#30333;&#24038;&#36827;&#21270;&#21490;</a> <code class="fold">@</code></dt>
<dd><p>&#25991;&#33402;&#38738;&#24180;&#20174;&#26469;&#37117;&#26159;&#26377;&#30149;&#30340;&#8230;&#8230;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.guancha.cn/economy/2016_11_27_381985.shtml">&#24212;&#23545;&#20013;&#22269;&#32769;&#40836;&#21270;&#65292;&#22269;&#21153;&#38498;&#21442;&#20107;&#29579;&#36745;&#32768;&#24314;&#35758;&#25918;&#23485;&#31614;&#35777;&#24341;&#36827;&#19996;&#30431;&#21171;&#21160;&#21147;</a> <code class="fold">@</code></dt>
<dd><ul>
<li>&#21807;&#24656;&#20013;&#22269;&#19981;&#20081;&#65292;&#30495;&#26159;&#29992;&#24515;&#33391;&#33510;&#12290;&#35199;&#26041;&#30340;&#23454;&#36341;&#26089;&#24050;&#35777;&#26126;&#65292;&#24341;&#36827;&#22806;&#22269;&#21171;&#21160;&#21147;&#24330;&#22823;&#20110;&#21033;&#65292;&#23545;&#20110;&#32463;&#27982;&#30340;&#20419;&#36827;&#26377;&#38480;&#65292;&#21364;&#24102;&#26469;&#31038;&#20250;&#25749;&#35010;&#21644;&#35299;&#20307;&#30340;&#38544;&#24551;&#12290;&#24403;&#21153;&#20043;&#24613;&#26159;&#32463;&#27982;&#36716;&#22411;&#65292;&#21521;&#24037;&#19994;&#26426;&#22120;&#20154;&#21644;&#33258;&#21160;&#21270;&#36827;&#20891;&#65292;&#29992;&#26426;&#22120;&#26367;&#20195;&#21171;&#21160;&#21147;&#12290;&#25226;&#26377;&#38480;&#30340;&#21171;&#21160;&#21147;&#29992;&#22312;&#39640;&#36136;&#37327;&#30340;&#26381;&#21153;&#19994;&#19978;&#65292;&#36825;&#25165;&#26159;&#26681;&#26412;&#20043;&#36947;&#12290;</li>
<li>&#19996;&#21335;&#20122;&#21171;&#21160;&#21147;&#30340;&#32032;&#36136;&#26681;&#26412;&#36798;&#19981;&#21040;&#35201;&#27714;&#30340;&#65292;&#23436;&#20840;&#27809;&#29992;&#12290;</li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.com/1256635225/EjB0B6mZB?type=comment">&#21016;&#26410;&#40527;pongba &#36716;&#21457;&#20102;&#36825;&#31687;&#25991;&#31456;&#65292;&#25105;&#35273;&#24471;&#24456;&#22909;&#8230; &#26469;&#33258;&#37329;&#29840;YU - &#24494;&#21338;</a> <code class="fold">@</code></dt>
<dd><p>&#65288;1&#65289; &#33258;&#25511;&#21147;&#24378;&#30340;&#20154;&#20854;&#23454;&#26356;&#20139;&#21463;&#20110;&#20570;&#37027;&#20123;&#25105;&#20204;&#24819;&#26041;&#35774;&#27861;&#25269;&#21046;&#30340;&#20107;&#24773;&#65292;&#27604;&#22914;&#35828;&#20581;&#24247;&#39278;&#39135;&#65292;&#23398;&#20064;&#65292;&#20197;&#21450;&#38203;&#28860;&#36523;&#20307;&#12290;&#25152;&#20197;&#20570;&#36825;&#20123;&#20107;&#24773;&#23545;&#20110;&#20182;&#20204;&#26469;&#35828;&#24182;&#19981;&#26159;&#38656;&#35201;&#23436;&#25104;&#30340;&#20219;&#21153;&#65292;&#32780;&#26159;&#20048;&#36259;&#12290;</p>
<ol style="list-style-type: decimal">
<li>People who are better at self-control actually enjoy the activities some of us resist &#8212; like eating healthy, studying, or exercising.</li>
</ol>
<p>&#65288;2&#65289;&#33258;&#25511;&#21147;&#24378;&#30340;&#20154;&#25317;&#26377;&#26356;&#22909;&#30340;&#20064;&#24815;&#12290;&#20182;&#20204;&#20250;&#35268;&#21010;&#33258;&#24049;&#30340;&#29983;&#27963;&#65292;&#27604;&#22914;&#27599;&#22825;&#22266;&#23450;&#26102;&#38388;&#36305;&#27493;&#21644;&#20901;&#24819;&#65292;&#36825;&#26679;&#20182;&#20204;&#23601;&#19981;&#38656;&#35201;&#32416;&#32467;&#21040;&#24213;&#35201;&#19981;&#35201;&#20570;&#12290;</p>
<ol start="2" style="list-style-type: decimal">
<li><p>People who are good at self-control have learned better habits</p></li>
<li><p>Some people just experience fewer temptations</p></li>
<li><p>It&#8217;s easier to have self-control when you&#8217;re wealthy</p></li>
</ol>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://mp.weixin.qq.com/s/KtLmsC3NNtJqM6uxJIN5Yg">&#35895;&#27468;&#21457;&#24067;&#24778;&#22825;&#40657;&#31185;&#25216;&#65292;&#26368;&#20255;&#22823;&#30340;&#39072;&#35206;&#21019;&#26032;&#26469;&#20020;&#12290;&#12290;&#12290;</a> <code class="fold">@</code></dt>
<dd><p>tango.</p>
<p>800 &#19975;&#20687;&#32032;&#21069;&#32622;&#25668;&#20687;&#22836;&#65292;1600 &#19975;&#20687;&#32032;&#21518;&#32622;&#25668;&#20687;&#22836;&#65292;&#21152;&#19978;&#19968;&#20010;&#26223;&#28145;&#25668;&#20687;&#22836;&#21644;&#19968;&#20010;&#29992;&#20110;&#24191;&#35282;&#25293;&#25668;&#30340;&#40060;&#30524;&#25668;&#20687;&#22836;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://cn.nikkei.com/columnviewpoint/column-special1/22130-2016-11-28-00-16-22.html?dt_platform=douban_broadcast&amp;dt_ref=02b380e3f459aa448e530105625086e91195684e56f41f43b05736aa2fdb8736&amp;dt_dapp=1">&#33521;&#35821;&#26159;&#38750;&#24471;&#35201;&#23398;&#30340;&#21527;&#65311;&#65288;&#19978;&#65289; &#26085;&#32463;&#20013;&#25991;&#32593;</a> <code class="fold">@</code></dt>
<dd><p>&#20551;&#22914;&#20174;&#23567;&#23601;&#24320;&#22987;&#23398;&#20064;&#20960;&#38376;&#35821;&#35328;&#65292;&#23398;&#20064;&#26102;&#38388;&#19981;&#22815;&#30340;&#35805;&#65292;&#26080;&#35770;&#21738;&#31181;&#35821;&#35328;&#37117;&#24456;&#23481;&#26131;&#25104;&#20026;&#21322;&#36884;&#32780;&#24223;&#30340;&#33021;&#21147;&#12290;&#22914;&#26524;&#27809;&#26377;&#38750;&#24120;&#29087;&#32451;&#22320;&#36816;&#29992;&#19968;&#38376;&#35821;&#35328;&#30340;&#33021;&#21147;&#65292;&#23601;&#19981;&#20250;&#20855;&#22791;&#29992;&#36825;&#38376;&#35821;&#35328;&#36827;&#34892;&#36923;&#36753;&#24615;&#24605;&#32500;&#30340;&#33021;&#21147;&#65292;&#20063;&#23601;&#19981;&#33021;&#23436;&#22909;&#22320;&#23653;&#34892;&#24037;&#20316;&#12290;</p>
<p>&#36807;&#21435;&#30340;&#26085;&#26412;&#20154;&#25152;&#38656;&#35201;&#30340;&#19981;&#26159;&#35762;&#22806;&#35821;&#30340;&#33021;&#21147;&#65292;&#32780;&#26159;&#36805;&#36895;&#20934;&#30830;&#38405;&#35835;&#22806;&#22269;&#20070;&#31821;&#30340;&#33021;&#21147;&#12290;&#26126;&#27835;&#26102;&#20195;&#30340;&#26085;&#26412;&#24076;&#26395;&#23613;&#21487;&#33021;&#24555;&#36895;&#22320;&#21560;&#25910;&#27431;&#32654;&#30340;&#25991;&#26126;&#21644;&#24605;&#24819;&#65292;&#23613;&#26089;&#25104;&#20026;&#24378;&#22823;&#30340;&#22269;&#23478;&#12290;&#23398;&#26657;&#25945;&#32946;&#37325;&#35270;&#38405;&#35835;&#33021;&#21147;&#65292;&#22312;&#23398;&#26657;&#20837;&#23398;&#32771;&#35797;&#20013;&#65292;&#37325;&#28857;&#25918;&#22312;&#32771;&#23519;&#38405;&#35835;&#33021;&#21147;&#30340;&#38382;&#39064;&#19978;&#12290;&#26085;&#26412;&#20154;&#25340;&#21629;&#25552;&#39640;&#22806;&#35821;&#30340;&#38405;&#35835;&#33021;&#21147;&#65292;&#20294;&#24573;&#35270;&#20102;&#21475;&#35821;&#21644;&#21548;&#21147;&#12290;</p>
<p>&#22312;&#21363;&#20351;&#19981;&#25026;&#22806;&#35821;&#20063;&#33021;&#29983;&#23384;&#30340;&#26085;&#26412;&#65292;&#26410;&#24517;&#20250;&#20248;&#24453;&#25026;&#22806;&#35821;&#30340;&#20154;&#65288;&#20250;&#35828;&#22806;&#35821;&#30340;&#20154;&#65289;&#12290;&#20856;&#22411;&#20363;&#23376;&#23601;&#26159;&#22806;&#20132;&#23448;&#12290;&#20013;&#22269;&#30340;&#22806;&#20132;&#23448;&#37117;&#26366;&#22312;&#22823;&#23398;&#37324;&#23398;&#20064;&#22806;&#35821;&#65292;&#33021;&#27969;&#21033;&#22320;&#35828;&#22806;&#35821;&#12290;&#32780;&#26085;&#26412;&#30340;&#22806;&#20132;&#23448;&#21017;&#22823;&#22810;&#27605;&#19994;&#20110;&#27861;&#23398;&#19987;&#19994;&#65292;&#20197;&#22806;&#35821;&#20316;&#20026;&#19987;&#19994;&#30340;&#20154;&#24456;&#23569;&#12290;&#22312;&#26085;&#26412;&#65292;&#22806;&#20132;&#23448;&#30340;&#24037;&#20316;&#19968;&#30452;&#34987;&#35748;&#20026;&#26159;&#29702;&#35299;&#22806;&#22269;&#30340;&#25919;&#27835;&#21644;&#31038;&#20250;&#21046;&#24230;&#24182;&#31614;&#32626;&#26465;&#32422;&#12290;&#36825;&#26679;&#19968;&#26469;&#65292;&#20154;&#20204;&#23601;&#35748;&#20026;&#19982;&#22806;&#35821;&#30456;&#27604;&#65292;&#27861;&#24459;&#30693;&#35782;&#26159;&#19981;&#21487;&#25110;&#32570;&#30340;&#65292;&#35828;&#22806;&#35821;&#21363;&#20351;&#19981;&#22826;&#25797;&#38271;&#20063;&#27809;&#20851;&#31995;&#12290;</p>
<p>refs and see also</p>
<ul>
<li><a href="http://cn.nikkei.com/columnviewpoint/column-special1/17541-20160111.html">&#26085;&#26412;&#20154;&#30340;&#33521;&#35821;&#27700;&#24179;&#20026;&#20309;&#27604;&#20013;&#22269;&#20154;&#24046;&#65311; &#26085;&#32463;&#20013;&#25991;&#32593;</a></li>
</ul>
</dd>
</dl></li>
<li><p><a href="https://mp.weixin.qq.com/s/XShy0Y04T8zxgqz58SMs6A">&#20303;&#23487;&#33293;&#20063;&#33021;&#24403;&#22823;&#21416;&#65306;&#21482;&#29992;&#19968;&#20010;&#30005;&#39277;&#38149;&#65292;&#23601;&#21487;&#20197;&#20570;&#20986;&#36229;&#22810;&#32654;&#21619;&#26009;&#29702;&#65281;</a></p></li>
<li><dl>
<dt><a href="http://mp.weixin.qq.com/s/WHHorUPchchjwg2U14KJFA">&#21861;&#65311;&#24615;&#26684;&#31455;&#28982;&#20063;&#33021;&#24433;&#21709;&#20320;&#30340;&#26234;&#21830;&#39640;&#20302;&#65311;&#65281;</a> <code class="fold">@</code></dt>
<dd><dl>
<dt>&#19982;&#26234;&#21830;&#27491;&#30456;&#20851;&#30340;&#20154;&#26684;&#32500;&#24230;&#65288;16&#65289;</dt>
<dd><p>&#26234;&#21147;&#25237;&#20837;&#12289;&#26234;&#21147;&#21019;&#36896;&#12289;&#24515;&#26234;&#25935;&#38160;&#24230;&#12289;&#26234;&#21147;&#33021;&#21147;&#12289;&#33258;&#30465;&#12289;&#21019;&#36896;&#21147;&#12289;&#24605;&#32771;&#28145;&#24230;&#12289;&#24819;&#35937;&#21147;&#12289;&#32452;&#32455;&#24615;&#12289;&#22362;&#24378;&#12289;&#25361;&#34885;&#12289;&#39046;&#23548;&#21147;&#12289;&#33258;&#25105;&#34920;&#38706;&#12289;&#24773;&#32490;&#31283;&#23450;&#24615;&#12289;&#36866;&#24230;&#20197;&#21450;&#24555;&#20048;&#12290;</p>
</dd>
<dt>&#19982;&#26234;&#21830;&#19981;&#30456;&#20851;&#30340;&#20154;&#26684;&#32500;&#24230;&#65288;24&#65289;</dt>
<dd><p>&#21512;&#32676;&#24615;&#12289;&#21451;&#21892;&#12289;&#33258;&#20449;&#12289;&#38543;&#21644;&#12289;&#20581;&#35848;&#12289;&#31038;&#20250;&#29702;&#35299;&#12289;&#28909;&#24773;&#12289;&#21644;&#21892;&#12289;&#20849;&#24773;&#12289;&#21512;&#20316;&#24615;&#12289;&#21516;&#24773;&#24515;&#12289;&#23613;&#36131;&#24615;&#12289;&#25928;&#29575;&#12289;&#39034;&#20174;&#12289;&#30446;&#30340;&#24615;&#12289;&#35880;&#24910;&#12289;&#29702;&#24615;&#12289;&#23436;&#32654;&#20027;&#20041;&#12289;&#24179;&#38745;&#12289;&#20914;&#21160;&#25511;&#21046;&#12289;&#20919;&#38745;&#12289;&#27785;&#30528;&#12289;&#23545;&#32654;&#30340;&#25935;&#24863;&#24615;&#20197;&#21450;&#24179;&#21644;&#12290;</p>
</dd>
<dt>&#19982;&#26234;&#21830;&#36127;&#30456;&#20851;&#30340;&#20154;&#26684;&#32500;&#24230;&#65288;5&#65289;</dt>
<dd><p>&#26465;&#29702;&#24615;&#12289;&#36947;&#24503;&#24863;&#12289;&#20048;&#20110;&#21161;&#20154;&#12289;&#24863;&#24615;&#21644;&#31038;&#20132;&#33021;&#21147;&#12290;</p>
</dd>
</dl>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://mirrors.tuna.tsinghua.edu.cn/" class="hearts">&#28165;&#21326;&#22823;&#23398;&#24320;&#28304;&#36719;&#20214;&#38236;&#20687;&#31449; | Tsinghua Open Source Mirror</a> <code class="fold">@</code></dt>
<dd><p>2016-11-06 &#26032;&#22686; Tensorflow &#31561;&#19968;&#31995;&#21015;&#38236;&#20687;</p>
<p>&#21463;&#36817;&#26399; &#20013;&#31185;&#22823;&#24320;&#28304;&#36719;&#20214;&#38236;&#20687;&#31449;&#25925;&#38556; &#30340;&#24433;&#21709;&#65292;TUNA Mirrors &#27969;&#37327;&#22823;&#24133;&#19978;&#21319;&#65292;&#30446;&#21069;&#24050;&#25509;&#36817;&#24102;&#23485;&#26497;&#38480;&#65292;&#23545;&#30913;&#30424;&#38453;&#21015;&#30340; I/O &#20135;&#29983;&#20102;&#36739;&#22823;&#21387;&#21147;&#12290;&#20026;&#20102;&#20445;&#35777;&#38453;&#21015;&#27491;&#24120;&#24037;&#20316;&#65292;&#25105;&#20204;&#23558;&#20248;&#20808;&#20445;&#35777; HTTP/HTTPS &#26381;&#21153;&#36136;&#37327;&#65292;&#32780;&#22312;&#39640;&#23792;&#26399;&#23545; rsync &#26381;&#21153;&#30340;&#30913;&#30424; I/O &#36827;&#34892;&#38480;&#21046;&#12290;&#23626;&#26102;&#20197; TUNA &#20026;&#19978;&#28216;&#36827;&#34892; rsync &#21516;&#27493;&#36895;&#24230;&#23558;&#20250;&#19979;&#38477;&#65292;&#25964;&#35831;&#35845;&#35299;&#12290;&#22914;&#26524;&#26041;&#20415;&#65292;&#35831;&#23613;&#37327;&#36873;&#25321;&#20940;&#26216;&#38169;&#23792;&#21516;&#27493;&#12290;&#24674;&#22797;&#26102;&#38388;&#23558;&#20250;&#21478;&#34892;&#36890;&#30693;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="http://mp.weixin.qq.com/s/gnZ4rDCvPa3ABMjfqhnntQ">Q &#26032;&#38395;&#20008;&#24494;&#36719;&#21457;&#24067; Visual Studio Mac &#39044;&#35272;&#29256;&#65307;ThoughtWorks &#38647;&#36798;&#19978;&#30340;&#26032;&#22855;&#21464;&#21270;&#65307;Blisk&#65306;&#24320;&#21457;&#20154;&#21592;&#30340;&#27983;&#35272;&#22120;</a></p></li>
<li><dl>
<dt><a href="http://matrix.sspai.com/p/c7a3c9c0">&#19968;&#24180;&#20102;&#65292;&#37027;&#20010;&#38395;&#21517;&#36944;&#36841;&#30340; Mou &#20320;&#36824;&#35760;&#24471;&#21527;&#65311; - Matrix</a> <code class="fold">@</code></dt>
<dd><p>&#36305;&#36335;&#20102;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="https://github.com/kovacsv/Online3DViewer">kovacsv/Online3DViewer: Online 3D Model Viewer - http://3dviewer.net/</a></p></li>
<li><p><a href="https://github.com/va3c/viewer">va3c/viewer: 3D Model Viewer with Three.js</a></p></li>
<li><dl>
<dt><a href="http://huangxuan.me/2016/02/01/React-vs-Angular2/">React vs Angular 2&#65306;&#20912;&#19982;&#28779;&#20043;&#27468;&#12300;&#35793;&#12301; - &#40644;&#29572;&#30340;&#21338;&#23458; | Hux Blog</a> <code class="fold">@</code></dt>
<dd><p>angular &#20307;&#31995;&#19979;&#24456;&#20840;&#38754;&#12290;&#32780;&#19988; typescript &#26159;&#27491;&#30830;&#30340;&#36873;&#25321;&#12290;&#32780;&#19988;&#27604;&#36739;&#31283;&#23450;&#20102;&#12290;</p>
<p>react &#30340;&#35805;&#65292;jsx &#19981;&#38169;&#12290;&#20197; js &#20026;&#20013;&#24515;&#12290;</p>
<p>&#20026;&#20102;&#20570;&#19968;&#20010;&#26356;&#30495;&#23454;&#30340;&#23545;&#27604;&#65292;&#25105;&#23558; Angular 2 &#23448;&#26041;&#25945;&#31243;&#20013;&#30340; Tour of Heroes &#24212;&#29992;&#29992; Angular 2 &#21644; React&#65288;&#36824;&#29992;&#19978;&#20102;&#26032;&#30340; React Slingshot &#20837;&#38376;&#22871;&#20214;&#65289;&#37117;&#23454;&#29616;&#20102;&#19968;&#36941;&#65292;&#32467;&#26524;&#22914;&#20309;&#21602;&#65311;</p>
<ul>
<li>Angular 2: 764k &#21387;&#32553;&#21518;</li>
<li>React + Redux: 151k &#21387;&#32553;&#21518;</li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://manu.ninja/webgl-3d-model-viewer-using-three-js" class="hearts">WebGL 3D Model Viewer Using three.js | manu.ninja</a> <code class="fold">@</code></dt>
<dd><p>&#23601;&#26159;&#25105;&#30340;&#37027;&#20010; demo&#8230;&#8230;&#21442;&#32771;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="https://www.douban.com/note/592677725/">&#20013;&#22269;&#30340;&#24038;&#32764;&#33258;&#30001;&#20027;&#20041;&#32773;&#20026;&#20160;&#20040;&#19981;&#24212;&#35813;&#26159;&#8220;&#30333;&#24038;&#8221;</a></p></li>
<li><dl>
<dt><a href="https://www.douban.com/people/huangjingyun/status/1920088041/">&#40644;&#38742;&#26112;&#30340;&#24191;&#25773;</a> <code class="fold">@</code></dt>
<dd><blockquote>
<p>&#30707;&#33487;&#20804;&#35828;&#36807;&#19968;&#30058;&#20851;&#20110;&#39575;&#26415;&#30340;&#24635;&#25324;&#65292;&#25105;&#28145;&#20197;&#20026;&#28982;&#12290;&#28436;&#32462;&#19968;&#19979;&#65306;&#31163;&#38065;&#36234;&#36817;&#30340;&#34892;&#19994;&#65292;&#39575;&#26415;&#23601;&#36234;&#23481;&#26131;&#25104;&#20026;&#26085;&#24120;&#35268;&#33539;&#65292;&#27450;&#39575;&#26080;&#38750;&#20998;&#20026;&#33258;&#27450;&#19982;&#27450;&#20154;&#12290;&#25919;&#23458;&#31881;&#39280;&#22826;&#24179;&#32534;&#36896;&#22269;&#21490;&#27450;&#19978;&#30610;&#19979;&#25423;&#36896;&#26159;&#38750;&#25351;&#40575;&#20026;&#39532;&#20599;&#22825;&#25442;&#26085;&#65292;&#23547;&#24120;&#22899;&#23376;&#25972;&#23481;&#21270;&#22918;&#32654;&#22270;&#20134;&#20026;&#22686;&#21152;&#28857;&#36190;&#25289;&#21319;&#36716;&#21270;&#65292;&#21069;&#32773;&#20026;&#31363;&#22269;&#65292;&#21518;&#32773;&#20026;&#34394;&#33635;&#65292;&#26412;&#36136;&#19978;&#21364;&#27809;&#26377;&#20160;&#20040;&#21306;&#21035;&#12290;&#36234;&#25104;&#21151;&#65292;&#22871;&#36335;&#36234;&#23092;&#29087;&#12290;</p>
</blockquote>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.oschina.net/news/57894/daocloud">&#22269;&#20869;&#39318;&#20010; Docker Hub &#38236;&#20687;&#26381;&#21153; DaoCloud &#19978;&#32447; - &#24320;&#28304;&#20013;&#22269;&#31038;&#21306;</a> <code class="fold">@</code></dt>
<dd><ul>
<li>&#21457;&#24067;&#20110; 2014 &#24180; 12 &#26376; 13 &#26085;</li>
</ul>
<p>&#25105;&#20204;&#21487;&#20197;&#21457;&#29616;&#25105;&#20204;&#24120;&#35828;&#30340;&#8220;ubuntu&#8221;&#38236;&#20687;&#20854;&#23454;&#19981;&#26159;&#19968;&#20010;&#38236;&#20687;&#21517;&#31216;&#65292;&#32780;&#26159;&#20195;&#34920;&#20102;&#19968;&#20010;&#21517;&#20026; ubuntu &#30340; Repository&#65292;&#21516;&#26102;&#22312;&#36825;&#20010; Repository &#19979;&#38754;&#26377;&#19968;&#31995;&#21015;&#25171;&#20102; tag &#30340; Image&#65292; Image &#30340;&#26631;&#35760;&#26159;&#19968;&#20010; GUID&#65292;&#20026;&#20102;&#26041;&#20415;&#20063;&#21487;&#20197;&#36890;&#36807; Repository:tag &#26469;&#24341;&#29992;&#12290;</p>
<p>&#37027;&#20040; Registry &#21448;&#26159;&#20160;&#20040;&#21602;&#65311;Registry &#23384;&#20648;&#38236;&#20687;&#25968;&#25454;&#65292;&#24182;&#19988;&#25552;&#20379;&#25289;&#21462;&#21644;&#19978;&#20256;&#38236;&#20687;&#30340;&#21151;&#33021;&#12290;Registry &#20013;&#38236;&#20687;&#26159;&#36890;&#36807; Repository &#26469;&#32452;&#32455;&#30340;&#65292;&#32780;&#27599;&#20010; Repository &#21448;&#21253;&#21547;&#20102;&#33509;&#24178;&#20010; Image&#12290;</p>
<ul>
<li>Registry &#21253;&#21547;&#19968;&#20010;&#25110;&#22810;&#20010; Repository</li>
<li>Repository &#21253;&#21547;&#19968;&#20010;&#25110;&#22810;&#20010; Image</li>
<li>Image &#29992; GUID &#34920;&#31034;&#65292;&#26377;&#19968;&#20010;&#25110;&#22810;&#20010; Tag &#19982;&#20043;&#20851;&#32852;</li>
</ul>
<p>&#37027;&#20040;&#22312;&#21738;&#37324;&#25351;&#23450; Registry &#21602;&#65311;&#35753;&#25105;&#20204;&#20877;&#25289;&#21462;&#19968;&#20010;&#26356;&#23436;&#25972;&#21629;&#21517;&#30340;&#38236;&#20687;&#21543;&#65306;</p>
<p>&#26368;&#21518;&#65292;&#35201;&#24863;&#35874;&#22269;&#20869;&#23384;&#20648;&#34892;&#19994;&#39046;&#20808;&#20225;&#19994;&#19971;&#29275;&#20113;&#23384;&#20648;&#22312;&#23384;&#20648;&#21644; CDN &#26041;&#38754;&#25552;&#20379;&#30340;&#22823;&#21147;&#25903;&#25345;&#65292;&#27491;&#22240;&#20026;&#26377;&#20102;&#20687;&#19971;&#29275;&#36825;&#26679;&#25216;&#26415;&#39046;&#20808;&#21448;&#28909;&#24515;&#20419;&#36827;&#20114;&#32852;&#32593;&#29983;&#24577;&#21457;&#23637;&#30340;&#20225;&#19994;&#30340;&#31215;&#26497;&#21442;&#19982;&#65292;&#25105;&#20204;&#25165;&#33021;&#32473;&#24320;&#21457;&#32773;&#25552;&#20379;&#26356;&#22810;&#39640;&#36136;&#37327;&#30340;&#26381;&#21153;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://mp.weixin.qq.com/s/qD9jmBi2idz2myPhC_Q-oQ">&#22914;&#26524;&#20320;&#30475;&#28165;&#20102;&#36825;&#24352;&#22270;&#65292;&#37027;&#20320;&#22810;&#21322;&#20063;&#24739;&#19978;&#36825;&#31181;&#8220;&#30149;&#8221;&#20102;&#65281;</a> <code class="fold">@</code></dt>
<dd><p>&#35270;&#21147;&#21644;&#20809;&#29031;&#24378;&#24230;&#26377;&#20851;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://daily.zhihu.com/story/9007657">&#29992;&#20110;&#23621;&#20303;&#30340;&#24314;&#35774;&#29992;&#22320;&#20351;&#29992;&#26435;&#21482;&#26377; 70 &#24180;&#65292;70 &#24180;&#21518;&#24590;&#20040;&#21150;&#65311;</a> <code class="fold">@</code></dt>
<dd><p>&#39318;&#20808;&#35201;&#20102;&#35299;&#65292;&#20854;&#23454;&#65292;&#25105;&#20204;&#36141;&#20080;&#21508;&#31867;&#21830;&#21697;&#25151;&#20043;&#21518;&#65292;&#33719;&#24471;&#26159;&#25151;&#23627;&#20135;&#26435;&#65292;&#21253;&#25324;&#20102;&#25151;&#23627;&#25152;&#26377;&#26435;&#21644;&#22303;&#22320;&#20351;&#29992;&#26435;&#20004;&#37096;&#20998;&#12290;</p>
<p>&#25151;&#23627;&#20135;&#26435; = &#25151;&#23627;&#25152;&#26377;&#26435; + &#22303;&#22320;&#20351;&#29992;&#26435;</p>
<p>&#20854;&#20013;&#65292;&#25151;&#23627;&#25152;&#26377;&#26435;&#30340;&#26399;&#38480;&#20026;&#27704;&#20037;&#12290;&#26159;&#31169;&#26377;&#36130;&#20135;&#30340;&#19968;&#31181;&#65292; &#25105;&#22269;&#27861;&#24459;&#35268;&#23450;&#65288;&#12298;&#20013;&#21326;&#20154;&#27665;&#20849;&#21644;&#22269;&#23466;&#27861;&#20013;&#21326;&#20154;&#27665;&#20849;&#21644;&#22269;&#29289;&#26435;&#27861;&#12299;&#65289;&#65292;&#31169;&#20154;&#23545;&#20854;&#21512;&#27861;&#30340;&#25910;&#20837;&#12289;&#25151;&#23627;&#12289;&#29983;&#27963;&#29992;&#21697;&#12289;&#29983;&#20135;&#24037;&#20855;&#12289;&#21407;&#26448;&#26009;&#31561;&#19981;&#21160;&#20135;&#21644;&#21160;&#20135;&#20139;&#26377;&#25152;&#26377;&#26435;&#12290;</p>
<p>&#20854;&#20013;&#65292;&#22303;&#22320;&#20351;&#29992;&#26435;&#30340;&#26399;&#38480;&#26159;&#26377;&#24180;&#38480;&#30340;</p>
<p>&#22240;&#27492;&#65292;&#30001;&#20110;&#25151;&#23627;&#26377;&#25240;&#26087;&#65292;&#26085;&#24120;&#29983;&#27963;&#20013;&#30340;&#25151;&#20135;&#22686;&#20540;&#65292;&#26159;&#22240;&#20026;&#20854;&#25152;&#21344;&#29992;&#22303;&#22320;&#22686;&#20540;&#12290;&#22914;&#26524;&#35201;&#20080;&#25151;&#65292;&#19968;&#23450;&#35201;&#27880;&#24847;&#23427;&#30340;&#22303;&#22320;&#20351;&#29992;&#26435;&#24180;&#38480;&#65292;&#33509;&#21097;&#20313;&#24180;&#38480;&#36739;&#30701;&#65292;&#38656;&#35880;&#24910;&#36141;&#20080;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://sspai.com/36100">&#25216;&#24039;&#65306;&#21033;&#29992; Workflow &#35760;&#24405;&#20070;&#31821; / &#24433;&#21095;&#21040; Airtable | Matrix &#31934;&#36873; - &#23569;&#25968;&#27966;</a> <code class="fold">@</code></dt>
<dd><p>Airtable: We&#8217;ll be back shortly.</p>
<p>&#32467;&#35770;&#26159;&#65306;&#31532;&#19977;&#26041;&#30340;&#19996;&#35199;&#21834;&#65292;&#19981;&#38752;&#35889;&#65281;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://sspai.com/36265">&#21253;&#26376;&#20511;&#20070;&#30340; Kindle Unlimited&#65292;&#21040;&#24213;&#20540;&#19981;&#20540;&#65311; - &#23569;&#25968;&#27966;</a> <code class="fold">@</code></dt>
<dd><p>&#25454; Kindle &#32473;&#20986;&#30340; 2015 &#24180;&#30340;&#25968;&#25454;&#65292;&#20854;&#30005;&#23376;&#20070;&#30340;&#20070;&#30446;&#20174; 2012 &#24180;&#21040; 2015 &#24180;&#25552;&#21319;&#20102;&#36275;&#36275;&#26377; 12 &#20493;&#65292;&#21487;&#35265;&#20122;&#39532;&#36874;&#20013;&#22269;&#22312;&#20070;&#30446;&#30340;&#25552;&#21319;&#19978;&#26377;&#22810;&#35802;&#24847;&#20102;&#12290;&#32780;&#22312;&#36825;&#19977;&#21313;&#19975;&#20876;&#30340;&#20070;&#20013;&#65292;&#36827;&#21475;&#20070;&#23601;&#21344;&#20102;&#36817;&#19968;&#21322;&#30340;&#25968;&#37327;&#65292;&#21487;&#35265;&#20122;&#39532;&#36874;&#22312;&#36825;&#22359;&#26377;&#22810;&#20040;&#19978;&#24515;&#12290;</p>
<p>&#21578;&#21035;&#23663;&#20070;&#20064;&#24815;&#65292;&#23398;&#20250;&#31185;&#23398;&#35835;&#20070;</p>
<p>&#25454;&#26412;&#20154;&#35266;&#23519;&#65292;&#36523;&#36793;&#19981;&#20047;&#23663;&#20070;&#29233;&#22909;&#32773;&#65292;&#26412;&#20154;&#26366;&#32463;&#20063;&#26159;&#12290;&#20294;&#26159;&#36141;&#20080;&#20102; KU &#24182;&#36866;&#24403;&#30340;&#36827;&#34892;&#35843;&#25972;&#21518;&#65292;&#36825;&#20010;&#30151;&#29366;&#30830;&#23454;&#26377;&#25152;&#32531;&#35299;&#65292;&#22823;&#23478;&#21487;&#20197;&#21442;&#32771;&#20511;&#37492;&#19968;&#19979;&#12290;</p>
<p>2016/11/25 ~ 2017/11/25</p>
</dd>
</dl></li>
<li><p><a href="http://weibo.wbdacdn.com/user/1788911247/status4045463928104052.html#utm_source=rss">&#35895;&#22823;&#30333;&#35805;:# &#27599;&#26085;&#19968;&#35789; #&#12304;unrequited love&#12305;&#21333;&#24651;&#65292;&#21333;&#30456;&#24605;&#65292;&#26410;&#24471;&#21040;&#22238;&#24212;&#30340;&#29233;&#12290;&#20063;&#21483; one-sided love</a></p></li>
<li><dl>
<dt><a href="https://np.reddit.com/r/autotldr/comments/31bfht/theory_autotldr_concept/" class="hearts">[Theory] AutoTLDR Concept : autotldr</a> <code class="fold">@</code></dt>
<dd><p>reddit &#30340;&#33258;&#21160;&#25688;&#35201;&#26426;&#22120;&#20154;&#12290;</p>
<ul>
<li>It doesn&#8217;t create laziness, it only responds to it</li>
<li>It can make sophisticated topics more relevant to mainstream Reddit</li>
<li>It decreases Reddit&#8217;s dependency on external sites</li>
<li>Only useful tl;dr&#8217;s are posted</li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.reuters.com/article/us-usa-muslims-idUSKBN13I2PK?feedType=RSS&amp;feedName=topNews&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+reuters%2FtopNews+%28News+%2F+US+%2F+Top+News%29">Polling calls to U.S. Muslims raise surveillance fears | Reuters</a> <code class="fold">@</code></dt>
<dd><p>&#30417;&#35270;</p>
<p>???</p>
</dd>
</dl></li>
<li><p><a href="https://www.engadget.com/2016/11/23/nasa-hopes-for-more-1-year-iss-missions/">NASA hopes for five more year-long ISS missions</a></p></li>
<li><dl>
<dt><a href="https://opensource.apple.com/release/os-x-1012.html">macOS 10.12 - Source</a> <code class="fold">@</code></dt>
<dd><p>&#33529;&#26524;&#24320;&#28304;&#12290;</p>
<p>&#26377;&#24456;&#22810;&#24037;&#20855;&#30340;&#28304;&#30721;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.reuters.com/article/us-china-economy-tpp-idUSKBN13J082?feedType=RSS&amp;feedName=topNews&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+reuters%2FtopNews+%28News+%2F+US+%2F+Top+News%29">China says it will promote trade deals regardless of TPP, RCEP direction | Reuters</a> <code class="fold">@</code></dt>
<dd><p>China said it will actively participate in bilateral and multilateral trade deals, with the goal of deepening reform and opening up its economy, regardless of the direction the <strong>Trans Pacific Partnership (TPP)</strong> or the <strong>China-backed Regional Comprehensive Economic Partnership (RCEP)</strong> might take.</p>
<p>The China Daily, the official state-run English-language newspaper, said many Chinese commentators &#35780;&#35770;&#21592; were revelling in the demise &#27515;&#20129; of the TPP, and called it an &#8220;excessively complex&#8221; deal that was &#8220;doomed from the start&#8221;.</p>
<p>&#8220;Encumbering <code>[&#618;n'k&#652;mb&#602;]</code> &#25302;&#32047; a trade arrangement with too many politics isn&#8217;t the right way to do business,&#8221; the paper said in an editorial, adding that the TPP was &#8220;more of a political weapon than a real business deal&#8221;.</p>
<p>&#8220;So long as it is meant to be genuine real trade, China is happy to write the rules with all its partners,&#8221; it said.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/2201566133/status4045341634683154.html#utm_source=rss">&#38472;&#34382;&#24179;: &#22238;&#22797; &#27743;&#36793; mark: &#26159;&#21834;&#65281;&#19968;&#24320;&#22987;&#23601;&#26159;&#21834;&#65281;&#24320;&#22987;&#30340;&#24320;&#22987;&#65292;&#23601;&#26159;&#21834;&#65281;&#23601;&#20687;&#33258;&#30001;&#31454;&#20105;&#24517;&#28982;&#21457;&#23637;&#20026;&#23521;&#22836;&#31454;&#20105;&#65292;&#23521;&#22836;&#31454;&#20105;&#24517;&#28982;&#21457;&#23637;&#20026;&#22269;&#23478;&#36164;&#26412;&#31454;&#20105;&#65292;&#26368;&#21518;&#24418;&#24577;&#30340;&#36164;&#26412;&#20027;&#20041;&#20063;&#24517;&#28982;&#21457;&#23637;&#21040;&#31038;&#20250;&#20027;&#20041;&#12290;&#25152;&#20197;&#65292;&#31038;&#20250;&#20027;&#20041;&#26159;&#36164;&#26412;&#20027;&#20041;&#30340;&#31995;&#32479;&#21319;&#32423;&#22043;&#65281;</a> <code class="fold">@</code></dt>
<dd><p>&#21518;&#21457;&#24037;&#19994;&#22269;&#30452;&#25509;&#19978;&#36731;&#24037;&#65292;&#23601;&#20250;&#36896;&#25104;&#20381;&#38468;&#65292;&#25104;&#20026;&#22269;&#38469;&#24037;&#19994;&#24490;&#29615;&#20013;&#30340;&#20302;&#31471;&#29615;&#33410;&#65292;&#21453;&#20381;&#38468;&#19982;&#21453;&#27542;&#27665;&#30340;&#35805;&#35821;&#26159;&#25509;&#36817;&#30340;&#12290;&#22312;&#24037;&#19994;&#36335;&#32447;&#19978;&#23601;&#26159;&#36208;&#36827;&#21475;&#26367;&#20195;&#65292;&#36827;&#21475;&#26367;&#20195;&#38656;&#35201;&#24066;&#22330;&#25903;&#25345;&#65292;&#25289;&#32654;&#20869;&#37096;&#24066;&#22330;&#22826;&#23567;&#65292;&#25630;&#20102;&#20108;&#19977;&#21313;&#24180;&#23601;&#25630;&#19981;&#19979;&#21435;&#20102;&#65292;&#33487;&#32852;&#21450;&#20854;&#25511;&#21046;&#22320;&#21306;&#24066;&#22330;&#36739;&#22823;&#65292;&#24310;&#32493;&#26102;&#38388;&#38271;&#19968;&#20493;&#12290;</p>
<p>&#20013;&#22269;&#30452;&#25509;&#19978;&#37325;&#24037;&#65292;&#20808;&#26159;&#24341;&#36827;&#65292;&#21518;&#26469;&#34987;&#36843;&#29420;&#31435;&#33258;&#20027;&#65292;&#36825;&#23601;&#26377;&#20010;&#24066;&#22330;&#38382;&#39064;&#65292;&#24066;&#22330;&#22826;&#23567;&#65292;&#35201;&#39640;&#31215;&#32047;&#25552;&#39640;&#36164;&#37329;&#65292;&#20111;&#20063;&#35201;&#20570;&#65292;&#28040;&#36153;&#23601;&#34987;&#21387;&#21040;&#24456;&#20302;&#27700;&#24179;&#12290;&#36825;&#23601;&#30456;&#24403;&#20110;&#20840;&#22269;&#26159;&#19968;&#20010;&#22823;&#24037;&#21378;&#65292;&#27599;&#20010;&#20154;&#30340;&#28040;&#36153;&#27700;&#24179;&#37117;&#34987;&#25511;&#21046;&#12290;&#20294;&#28040;&#36153;&#29992;&#30340;&#29289;&#36164;&#19981;&#20250;&#24179;&#22343;&#20998;&#37197;&#65292;&#32780;&#26159;&#19968;&#25353;&#31561;&#32423;&#65292;&#19968;&#25353;&#22478;&#20065;&#12290;&#24037;&#21378;&#22312;&#22478;&#24066;&#65292;&#36827;&#21378;&#65292;&#29983;&#27963;&#22909;&#19968;&#20123;&#65292;&#20892;&#26449;&#20154;&#36827;&#19981;&#20102;&#21378;&#65292;&#29983;&#27963;&#23601;&#24046;&#24456;&#22810;&#12290;&#22478;&#20065;&#24046;&#36317;&#26159;&#21518;&#21457;&#24037;&#19994;&#22269;&#37325;&#24037;&#20248;&#20808;&#36335;&#32447;&#19979;&#22312;&#22478;&#20065;&#20043;&#38388;&#20998;&#37197;&#19981;&#22343;&#30340;&#32467;&#26524;&#12290;</p>
<p>&#36825;&#31181;&#24773;&#20917;&#22312;&#25913;&#38761;&#24320;&#25918;&#21518;&#20381;&#28982;&#24310;&#32493;&#65292;&#20892;&#27665;&#22909;&#20102;&#20960;&#24180;&#65292;&#29983;&#27963;&#38382;&#39064;&#35299;&#20915;&#20102;&#65292;1984&#24180;&#20197;&#21518;&#23601;&#27809;&#26377;&#22826;&#22810;&#25552;&#39640;&#20102;&#65292;&#21518;&#26469;&#38500;&#20102;&#25630;&#36215;&#20065;&#38215;&#20225;&#19994;&#30340;&#27743;&#27993;&#21644;&#23569;&#25968;&#22478;&#37066;&#22320;&#21306;&#20197;&#22806;&#65292;&#22810;&#25968;&#20892;&#27665;&#35201;&#25552;&#39640;&#25910;&#20837;&#21482;&#33021;&#36890;&#36807;&#22806;&#20986;&#25171;&#24037;&#12290;</p>
<p>&#21040;&#20102;2000&#24180;&#20195;&#65292;&#22478;&#24066;&#37325;&#24037;&#19994;&#20225;&#19994;&#20063;&#26377;&#20102;&#22312;&#24066;&#22330;&#19978;&#33258;&#24049;&#29983;&#23384;&#30340;&#33021;&#21147;&#65292;&#20854;&#20135;&#21697;&#30340;&#38144;&#21806;&#23545;&#35937;&#36824;&#26159;&#22478;&#24066;&#23621;&#27665;&#21644;&#20065;&#38215;&#20225;&#19994;&#21457;&#36798;&#30340;&#38271;&#29664;&#19977;&#35282;&#22320;&#21306;&#12290;&#22478;&#20065;&#24046;&#21035;&#20381;&#28982;&#23384;&#22312;&#65292;&#24182;&#19988;&#22312;&#37325;&#24037;&#19994;&#21270;&#21644;&#22478;&#24066;&#21270;&#38454;&#27573;&#65292;&#36824;&#36234;&#26469;&#36234;&#22823;&#12290;</p>
<p>&#19968;&#30452;&#20197;&#26469;&#65292;&#20013;&#22269;&#20005;&#26684;&#25511;&#21046;&#22823;&#22478;&#24066;&#21457;&#23637;&#65292;&#22240;&#20026;&#20892;&#27665;&#36827;&#22478;&#20250;&#31232;&#37322;&#22478;&#24066;&#23621;&#27665;&#30340;&#20998;&#37197;&#25152;&#24471;&#65292;&#19981;&#21033;&#20110;&#24037;&#19994;&#31215;&#32047;&#65292;&#25919;&#24220;&#20316;&#20026;&#20197;&#21069;&#26159;&#21807;&#19968;&#12289;&#19988;&#19968;&#30452;&#20197;&#26469;&#37117;&#26159;&#26368;&#22823;&#30340;&#24037;&#19994;&#20225;&#19994;&#20027;&#65292;&#26368;&#22823;&#21270;&#33258;&#36523;&#21033;&#30410;&#30340;&#26041;&#27861;&#33258;&#28982;&#26159;&#23613;&#21487;&#33021;&#21387;&#20302;&#38750;&#22478;&#24066;&#37096;&#38376;&#30340;&#24037;&#36164;&#27700;&#24179;&#12290;&#30452;&#21040;&#36817;&#20960;&#24180;&#65292;&#25165;&#25552;&#20986;&#21457;&#23637;&#22478;&#24066;&#32676;&#65292;&#20294;&#21322;&#24515;&#21322;&#24847;&#12290;&#37325;&#24037;&#19994;&#26080;&#27861;&#33258;&#36127;&#30408;&#20111;&#26102;&#25152;&#35201;&#27714;&#30340;&#21033;&#30410;&#29306;&#29298;&#22312;&#37325;&#24037;&#19994;&#33021;&#22815;&#33258;&#31435;&#30340;&#26102;&#20505;&#22833;&#21435;&#24847;&#20041;&#65292;&#22823;&#23398;&#29983;&#20808;&#34987;&#20801;&#35768;&#36827;&#22478;&#65292;&#28982;&#21518;&#26159;&#29087;&#32451;&#25216;&#26415;&#30340;&#20892;&#27665;&#24037;&#12290;&#36825;&#37096;&#20998;&#32553;&#23567;&#20102;&#22478;&#20065;&#24046;&#36317;&#12290;</p>
<p>&#20294;&#26159;&#65292;&#22478;&#24066;&#20869;&#37096;&#30340;&#25910;&#20837;&#20998;&#37197;&#19981;&#20165;&#26159;&#36135;&#24065;&#21270;&#30340;&#24037;&#36164;&#65292;&#36824;&#26377;&#21508;&#31181;&#19982;&#25143;&#21475;&#25414;&#32465;&#22312;&#19968;&#36215;&#30340;&#25945;&#32946;&#21644;&#21307;&#30103;&#31119;&#21033;&#12290;&#36825;&#20123;&#31119;&#21033;&#33267;&#20170;&#27809;&#26377;&#33073;&#38057;&#65292;&#20027;&#35201;&#21407;&#22240;&#19982;&#20960;&#21313;&#24180;&#21069;&#30340;&#22478;&#20065;&#25511;&#21046;&#20381;&#28982;&#26377;&#20851;&#65292;&#19981;&#36807;&#20854;&#24418;&#24577;&#20174;&#22478;&#24066;&#25143;&#21475;&#19982;&#20892;&#19994;&#25143;&#21475;&#30340;&#24046;&#21035;&#31649;&#29702;&#65292;&#21464;&#25104;&#20102;&#20154;&#21475;&#27969;&#20837;&#22478;&#24066;&#19982;&#20154;&#21475;&#27969;&#20986;&#22320;&#21306;&#30340;&#24046;&#21035;&#31649;&#29702;&#12290;&#20197;&#21069;&#26159;&#37325;&#24037;&#19994;&#21450;&#20854;&#22478;&#24066;&#35201;&#27714;&#20892;&#27665;&#39640;&#31215;&#32047;&#20302;&#28040;&#36153;&#65292;&#20892;&#27665;&#20165;&#20165;&#20316;&#20026;&#36164;&#37329;&#25552;&#20379;&#32773;&#27963;&#30528;&#65292;&#29616;&#22312;&#26159;&#20808;&#21457;&#23637;&#22478;&#24066;&#35201;&#27714;&#21518;&#21457;&#23637;&#22320;&#21306;&#21482;&#20379;&#32473;&#21171;&#21160;&#21147;&#19981;&#35201;&#27714;&#31038;&#20250;&#20445;&#38556;&#21644;&#21307;&#30103;&#25945;&#32946;&#65292;&#26032;&#31227;&#27665;&#24180;&#36731;&#20154;&#21644;&#20892;&#27665;&#24037;&#37117;&#20165;&#20165;&#21482;&#20316;&#20026;&#21171;&#21160;&#21147;&#25552;&#20379;&#32773;&#27963;&#30528;&#65292;&#21482;&#34987;&#24403;&#20316;&#29983;&#20135;&#35201;&#32032;&#65292;&#19981;&#34987;&#24403;&#20316;&#23436;&#25972;&#30340;&#24037;&#19994;&#21644;&#22478;&#24066;&#20154;&#12290;</p>
<p>&#20013;&#22830;&#34429;&#28982;&#36890;&#36807;&#36716;&#31227;&#25903;&#20184;&#32531;&#35299;&#21457;&#36798;&#22320;&#21306;&#19982;&#20013;&#35199;&#37096;&#22320;&#21306;&#30340;&#30683;&#30462;&#65292;&#20294;&#26159;&#65292;&#21147;&#24230;&#36807;&#23567;&#65292;&#32780;&#19988;&#65292;&#21457;&#36798;&#22320;&#21306;&#36824;&#21487;&#20197;&#29992;&#8220;&#25105;&#24050;&#32463;&#20132;&#31246;&#20102;&#21834;&#8220;&#26469;&#25642;&#22622;&#33258;&#24049;&#26412;&#24212;&#25215;&#25285;&#30340;&#21171;&#21160;&#21147;&#20877;&#29983;&#20135;&#21644;&#31038;&#20250;&#20445;&#38556;&#30340;&#32844;&#36131;&#12290;&#20182;&#20204;&#21033;&#29992;&#20102;&#36825;&#20123;&#21171;&#21160;&#21147;&#65292;&#21033;&#29992;&#23436;&#20102;&#23601;&#24076;&#26395;&#20182;&#20204;&#28378;&#22238;&#33258;&#24049;&#21407;&#26469;&#30340;&#22320;&#26041;&#21435;&#12290;</p>
<p>&#36825;&#31181;&#24773;&#20917;&#22312;&#32654;&#22269;&#31532;&#20108;&#27425;&#24037;&#19994;&#38761;&#21629;&#30340;&#27773;&#36710;&#26102;&#20195;&#20063;&#21457;&#29983;&#36807;&#12290;&#32654;&#22269;&#36890;&#36807;&#36827;&#27493;&#36816;&#21160;&#12289;&#35874;&#23572;&#26364;&#21453;&#22404;&#26029;&#27861;&#12289;&#24037;&#20250;&#38598;&#20307;&#24037;&#36164;&#35848;&#21028;&#12289;&#31038;&#20250;&#20445;&#38556;&#31995;&#32479;&#65292;&#35299;&#20915;&#20102;&#36164;&#26412;&#23478;&#19982;&#21171;&#21160;&#32773;&#30340;&#36825;&#31181;&#30683;&#30462;&#65292;&#38477;&#20302;&#20102;&#25910;&#20837;&#20998;&#37197;&#24046;&#36317;&#12290;&#36825;&#31181;&#20570;&#27861;&#21463;&#21040;&#25919;&#24220;&#24378;&#26377;&#21147;&#25903;&#25345;&#65292;&#19968;&#24320;&#22987;&#23545;&#20225;&#19994;&#20027;&#19981;&#21033;&#65292;&#20294;&#21364;&#24456;&#24555;&#36716;&#21270;&#20026;&#22478;&#24066;&#21270;&#30340;&#28558;&#28227;&#21160;&#21147;&#65292;&#25193;&#22823;&#21644;&#28145;&#21270;&#20102;&#20225;&#19994;&#37325;&#24037;&#19994;&#20135;&#21697;&#30340;&#20869;&#37096;&#24066;&#22330;&#65292;&#32467;&#26524;&#26159;&#22521;&#32946;&#20986;&#26032;&#20852;&#30340;&#22478;&#24066;&#20013;&#20135;&#38454;&#32423;&#65292;&#20063;&#20026;&#36164;&#26412;&#23478;&#23547;&#25214;&#21040;&#26356;&#22823;&#30340;&#21033;&#28070;&#31354;&#38388;&#12290;</p>
<p>&#20013;&#22269;&#30340;&#24050;&#21457;&#23637;&#22320;&#21306;&#30340;&#25919;&#24220;&#20381;&#28982;&#39640;&#24230;&#25903;&#25345;&#20225;&#19994;&#20027;&#21644;&#22478;&#24066;&#21407;&#20303;&#27665;&#65292;&#20225;&#22270;&#32487;&#32493;&#27048;&#21462;&#26032;&#36827;&#24037;&#20154;&#21644;&#24180;&#36731;&#20154;&#65292;&#20165;&#20165;&#25226;&#20182;&#20204;&#20316;&#20026;&#21363;&#25554;&#21363;&#29992;&#12289;&#29992;&#23436;&#25172;&#25481;&#30340;&#29983;&#20135;&#35201;&#32032;&#12290;&#36825;&#31181;&#23616;&#38754;&#33021;&#22815;&#32487;&#32493;&#19979;&#21435;&#21527;&#65311;&#36825;&#31181;&#23616;&#38754;&#24212;&#35813;&#32487;&#32493;&#19979;&#21435;&#21527;&#65311;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://bazaarvoice.github.io/jolt/">Jolt by bazaarvoice</a> <code class="fold">@</code></dt>
<dd><ul>
<li>JSON to JSON transformation library written in Java where the &#8220;specification&#8221; for the transform is itself a JSON document.</li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/1932835417/status4045100445097330.html#utm_source=rss">&#35199;&#29916;&#22823;&#20024;&#23376;&#27748;:&#36825;&#26159;&#21322;&#24180;&#21069;&#20889;&#30340;&#12290;&#24456;&#39640;&#20852;&#25105;&#20204;&#24456;&#24555;&#23601;&#26377;&#19968;&#20010;&#38750;&#24120;&#20248;&#31168;&#30340;&#20135;&#21697;&#32463;&#29702;&#12290;</a> <code class="fold">@</code></dt>
<dd><p>&#20135;&#21697;&#32463;&#29702;&#20854;&#23454;&#38754;&#20020;&#30340;&#24456;&#22810;&#38382;&#39064;&#37117;&#21644; CEO &#19968;&#26679;&#65292;&#35201;&#24179;&#34913;&#22909;&#25216;&#26415;&#30446;&#26631;&#12289;&#21830;&#19994;&#30446;&#26631;&#12289;&#32452;&#32455;&#30446;&#26631;&#31561;&#31561;&#35832;&#22810;&#30456;&#20114;&#30683;&#30462;&#30340;&#38382;&#39064;&#12290;&#21487;&#20197;&#35828;&#65292;&#20135;&#21697;&#32463;&#29702;&#23703;&#20301;&#26159; CEO &#30340;&#35757;&#32451;&#33829;&#12290;&#19968;&#20010;&#22909;&#30340;&#20135;&#21697;&#32463;&#29702;&#65292;&#22312;&#32463;&#21382;&#20102;&#29420;&#24403;&#19968;&#38754;&#30340;&#25361;&#25112;&#20197;&#21518;&#65292;&#26159;&#21487;&#20197;&#32988;&#20219;&#21021;&#21019;&#20844;&#21496;&#30340; CEO &#30340;&#35282;&#33394;&#30340;&#12290;</p>
<ol style="list-style-type: decimal">
<li><p>&#21021;&#27493;&#30340;&#20135;&#21697;&#32463;&#29702;&#23601;&#26159;&#30011;&#21407;&#22411;&#65292;&#35774;&#35745;&#29992;&#25143;&#20132;&#20114;&#65292;&#35848;&#8220;&#29992;&#25143;&#20307;&#39564;&#8221;&#65292;&#30447;&#30528;&#30475;&#25968;&#25454;&#12290;</p></li>
<li><p>&#36827;&#38454;&#30340;&#20135;&#21697;&#32463;&#29702;&#20542;&#21548;&#29992;&#25143;&#30340;&#22768;&#38899;&#65292;&#36807;&#28388;&#25481;&#37027;&#20123;&#8220;&#26356;&#24555;&#30340;&#39532;&#8221;&#65292;&#31649;&#29702;&#30456;&#20114;&#30683;&#30462;&#30340;&#38656;&#27714;&#65292;&#28145;&#21051;&#29702;&#35299;&#29992;&#25143;&#30011;&#20687;&#65292;&#21162;&#21147;&#20570;&#26356;&#23569;&#30340;&#20107;&#24773;&#26469;&#36798;&#25104;&#30446;&#26631;&#12290;</p></li>
<li><p>&#20877;&#27425;&#21319;&#21326;&#30340;&#20135;&#21697;&#32463;&#29702;&#25317;&#26377;&#34892;&#19994;&#30340;&#8220;&#27934;&#23519;&#21147;&#8221;&#65288;Insights&#65289;&#65292;&#19981;&#26159;&#22240;&#20026;&#29992;&#25143;&#30340;&#35775;&#35848;&#32780;&#20915;&#23450;&#20135;&#21697;&#30340;&#26041;&#21521;&#65292;&#32780;&#26159;&#28145;&#21051;&#29702;&#35299;&#34892;&#19994;&#30340;&#21457;&#23637;&#36235;&#21183;&#65292;&#24182;&#26126;&#30333;&#31361;&#30772;&#30340;&#27491;&#30830;&#27425;&#24207;&#12290;&#20063;&#23601;&#26159;&#34892;&#19994;&#30340;&#8220;&#36923;&#36753;&#8221;&#12290;</p></li>
</ol>
<p>&#20135;&#21697;&#30340;&#26681;&#26412;&#22312;&#20110;&#36923;&#36753;&#12290;&#27809;&#26377;&#20154;&#19968;&#19979;&#23376;&#23601;&#33021;&#26377;&#27491;&#30830;&#30340;&#36923;&#36753;&#12290;&#36923;&#36753;&#19968;&#23450;&#26159;&#22312;&#21453;&#22797;&#30340;&#38180;&#28860;&#20013;&#24471;&#21040;&#30340;&#12290;</p>
<p>&#20889;&#20316;&#26159;&#26368;&#38203;&#28860;&#36923;&#36753;&#30340;&#12290;&#20889;&#20316;&#20250;&#24378;&#36843;&#33258;&#24049;&#25910;&#38598;&#32032;&#26448;&#65292;&#25972;&#29702;&#24605;&#24819;&#65292;&#36873;&#25321;&#21512;&#29702;&#30340;&#34920;&#36798;&#12290;&#20889;&#20316;&#21487;&#20197;&#33719;&#24471;&#26356;&#24191;&#27867;&#12289;&#26356;&#25345;&#20037;&#30340;&#21453;&#39304;&#65292;&#27604;&#21475;&#22836;&#30340;&#20132;&#27969;&#26356;&#21152;&#24110;&#21161;&#36923;&#36753;&#30340;&#24418;&#25104;&#12290;</p>
<p>&#19981;&#20165;&#35201;&#22810;&#35835;&#65292;&#19968;&#23450;&#35201;&#22810;&#20889;&#12290;&#20135;&#21697;&#35774;&#35745;&#26041;&#27861;&#35770;&#30340;&#24515;&#24471;&#65292;&#36164;&#28304;&#30340;&#27719;&#24635;&#65292;&#19968;&#20123;&#21644;&#20855;&#20307;&#20135;&#21697;&#26080;&#20851;&#30340;&#19996;&#35199;&#65292;&#37117;&#24212;&#35813;&#20844;&#24320;&#20986;&#21435;&#65292;&#22312;&#20010;&#20154;&#30340;&#21338;&#23458;&#12289;&#24494;&#21338;&#12289;&#20844;&#20247;&#21495;&#19978;&#35753;&#21035;&#20154;&#30475;&#21040;&#12290;&#20869;&#37096;&#30340;&#20135;&#21697;&#24605;&#24819;&#65292;&#35201;&#23450;&#26399;&#65288;&#33267;&#23569;&#19968;&#20010;&#26376;&#19968;&#27425;&#21543;&#65289;&#20889;&#19968;&#20123;&#20070;&#38754;&#30340;&#24605;&#32771;&#30340;&#35760;&#24405;&#65288;&#19981;&#26159;&#37027;&#31181;&#32473;&#19978;&#38754;&#30475;&#30340;PPT&#65289;&#65292;&#32463;&#24120;&#22320;&#22238;&#26469;&#30475;&#20197;&#21069;&#30340;&#35760;&#24405;&#65292;&#23545;&#29031;&#36923;&#36753;&#30340;&#21464;&#36801;&#12290;</p>
<p>&#22914;&#26524;&#22312;&#20004;&#20010;&#20135;&#21697;&#32463;&#29702;&#20154;&#36873;&#20043;&#38388;&#29369;&#35947;&#65292;&#23601;&#36873;&#20889;&#20316;&#22810;&#30340;&#37027;&#20010;&#12290;</p>
<p>&#65288;&#20854;&#23454;&#19978;&#38754;&#36825;&#26465;&#23545;&#36873;&#31243;&#24207;&#21592;&#20063;&#36866;&#29992;&#65289;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/1932835417/status4045100981483486.html#utm_source=rss">&#35199;&#29916;&#22823;&#20024;&#23376;&#27748;:&#20135;&#21697;&#32463;&#29702;&#38656;&#35201;&#23545;&#20135;&#19994;&#30340;&#28145;&#21051;&#27934;&#23519;&#65292;&#24191;&#27867;&#30340;&#38405;&#35835;&#65292;&#20248;&#31168;&#30340;&#20889;&#20316;&#65292;&#24378;&#22823;&#30340;&#36923;&#36753;&#25512;&#29702;&#65292;&#20154;&#24615;&#30340;&#32454;&#33268;&#25226;&#25569;&#65292;&#24039;&#22937;&#30340;&#27807;&#36890;&#25216;&#26415;&#65292;&#25512;&#36827;&#26041;&#26696;&#30340;&#36802;&#22238;&#32784;&#24515;</a> <code class="fold">@</code></dt>
<dd><p>&#25105;&#32463;&#24120;&#21149;&#24819;&#36716;&#34892;&#24403;&#20135;&#21697;&#32463;&#29702;&#30340;&#31243;&#24207;&#21592;&#65292;&#19981;&#35201;&#36339;&#28779;&#22353;&#65292;&#22240;&#20026;&#25216;&#26415;&#36825;&#20010;&#34892;&#19994;&#36824;&#26159;&#23454;&#25171;&#23454;&#30340;&#65292;&#32780;&#20135;&#21697;&#32463;&#29702;&#36825;&#20010;&#34892;&#19994;&#36824;&#26159;&#35201;&#38752;&#36816;&#27668;&#30340;&#12290;</p>
<p>&#20570;&#25216;&#26415;&#65292;&#21482;&#35201;&#20320;&#25166;&#25166;&#23454;&#23454;&#30340;&#21435;&#35835;&#28304;&#20195;&#30721;&#65292;&#21435;&#23398;&#20064;&#22823;&#20844;&#21496;&#25918;&#20986;&#26469;&#30340;&#26550;&#26500;&#25991;&#26723;&#21644;&#35770;&#25991;&#65292;&#20320;&#27809;&#27969;&#37327;&#30340;&#26102;&#20505;&#20320;&#21487;&#20197;&#21387;&#27979;&#65292;&#27809;&#26381;&#21153;&#22120;&#30340;&#26102;&#20505;&#20320;&#21487;&#20197;&#20080;vps&#35013;&#23481;&#22120;&#12290;&#20320;&#25216;&#26415;&#25104;&#38271;&#30340;&#25152;&#38656;&#35201;&#30340;&#19996;&#35199;&#26159;&#20320;&#33258;&#24049;&#21487;&#25511;&#30340;&#12290;</p>
<p>&#32780;&#19968;&#20010;&#20135;&#21697;&#35201;&#20570;&#22909;&#65292;&#37027;&#24471;&#22825;&#26102;&#22320;&#21033;&#20154;&#21644;&#65292;&#23569;&#19968;&#26679;&#37117;&#19981;&#34892;&#12290;</p>
<p>&#39318;&#20808;&#20320;&#35201;&#24819;&#26377;&#22823;&#29992;&#25143;&#37327;&#20135;&#21697;&#30340;&#32463;&#39564;&#65292;&#23601;&#24471;&#21435;&#22823;&#20844;&#21496;&#12290;&#20294;&#20320;&#31639;&#31639;&#22823;&#20844;&#21496;&#37324;&#38754;&#33021;&#26377;&#22810;&#23569;&#20010;&#20135;&#21697;&#32463;&#29702;&#65311;&#29616;&#22312;&#23601;&#31639;&#19987;&#19994;&#30340;&#20135;&#21697;&#32463;&#29702;&#33021;&#21040;&#22823;&#20844;&#21496;&#37324;&#36793;&#31649;&#22823;&#39033;&#30446;&#30340;&#27604;&#20363;&#23601;&#38750;&#24120;&#30340;&#20302;&#65292;&#26356;&#20309;&#20917;&#20320;&#37027;&#20010;&#20174;&#25216;&#26415;&#36716;&#36807;&#21435;&#30340;&#21516;&#23398;&#21602;&#65311; &#28982;&#21518;&#23601;&#31639;&#20320;&#25226;&#20135;&#21697;&#26412;&#36523;&#20570;&#24471;&#38750;&#24120;&#19981;&#38169;&#65292;&#24066;&#22330;&#20570;&#19981;&#22909;&#65292;&#20154;&#23478;&#19981;&#30693;&#36947;&#20320;&#36825;&#20010;&#20135;&#21697;&#65292;&#36816;&#33829;&#20570;&#19981;&#22909;&#65292;&#29992;&#25143;&#27963;&#36291;&#21719;&#21719;&#24448;&#19979;&#25481;&#65292;&#38144;&#21806;&#20570;&#19981;&#22909;&#65292;&#20844;&#21496;&#19981;&#36186;&#38065;&#65292;&#20013;&#38388;&#23601;&#25346;&#25481;&#65292;&#21482;&#26377;&#36825;&#20123;&#30701;&#26495;&#20840;&#37096;&#37117;&#34917;&#40784;&#20102;&#65292;&#26368;&#21518;&#20135;&#21697;&#25165;&#33021;&#20570;&#22909;&#65292;&#28982;&#21518;&#20570;&#22909;&#20102;&#27599;&#20010;&#20154;&#37117;&#35273;&#24471;&#26159;&#33258;&#24049;&#30340;&#21151;&#21171;&#12290;</p>
<p>&#26368;&#21518;&#65292;&#20135;&#21697;&#32463;&#29702;&#25442;&#24037;&#20316;&#36824;&#25402;&#40635;&#28902;&#30340;&#12290; &#25216;&#26415;&#23703;&#20182;&#26159;&#19968;&#26631;&#20934;&#21697;&#65292;&#20320;&#21435;&#21738;&#20010;&#20844;&#21496;&#20320;&#37117;&#20889; php&#12290;&#25442;&#20010;&#20844;&#21496;&#65292;&#20063;&#23601;&#24212;&#29992;&#22330;&#26223;&#31245;&#24494;&#26377;&#19968;&#28857;&#19981;&#21516;&#65292;&#22823;&#37096;&#20998;&#37117;&#26159;&#19968;&#26679;&#30340;&#12290;&#32780;&#20135;&#21697;&#23703;&#36319;&#34892;&#19994;&#30340;&#20851;&#31995;&#32852;&#31995;&#22826;&#32039;&#23494;&#20102;&#65292;&#38548;&#34892;&#22914;&#38548;&#23665;&#22312;&#36825;&#20799;&#19968;&#28857;&#19981;&#38169;&#12290;&#27809;&#20960;&#20010;&#20570;&#20114;&#32852;&#32593;&#37329;&#34701;&#30340;&#20135;&#21697;&#32463;&#29702;&#33021;&#20570;&#22909;&#20108;&#27425;&#20803;&#31038;&#21306;&#12290; &#25442;&#20010;&#34892;&#19994;&#30340;&#25104;&#26412;&#36319;&#31243;&#24207;&#21592;&#25442;&#20010;&#35821;&#35328;&#24046;&#19981;&#22810;&#65292;&#36825;&#23601;&#24847;&#21619;&#30528;&#23454;&#38469;&#19978;&#20135;&#21697;&#32463;&#29702;&#25442;&#24037;&#20316;&#30340;&#36873;&#25321;&#38750;&#24120;&#30340;&#23569;&#65292;&#20063;&#23601;&#37027;&#20040;&#20960;&#23478;&#20844;&#21496;&#65292;&#36828;&#19981;&#22914;&#31243;&#24207;&#21592;&#12290;</p>
<p>&#25152;&#20197;&#20320;&#20204;&#21035;&#30475;&#20135;&#21697;&#32463;&#29702;&#32769;&#25913;&#20320;&#30340;&#38656;&#27714;&#23601;&#24819;&#30528;&#32769;&#23376;&#20063;&#35201;&#21435;&#24403;&#19968;&#20135;&#21697;&#32463;&#29702;&#20063;&#25913;&#19968;&#25913;&#20854;&#20182;&#31243;&#24207;&#21592;&#30340;&#38656;&#27714;&#65292;&#20294;&#20854;&#23454;&#37027;&#20135;&#21697;&#32463;&#29702;&#30340;&#34218;&#36164;&#35828;&#19981;&#23450;&#36824;&#27809;&#20320;&#39640;&#21602;&#12290;</p>
<p>&#28982;&#21518;&#20182;&#36824;&#24471;&#22825;&#22825;&#21548;CEO&#23545;&#20182;&#30340;&#20135;&#21697;&#25351;&#25163;&#30011;&#33050;&#65292;&#35828;&#20160;&#20040;&#20154;&#20154;&#37117;&#26159;&#20135;&#21697;&#32463;&#29702;&#12290;[&#25674;&#25163;]</p>
</dd>
</dl></li>
<li><p><a href="https://www.engadget.com/2016/11/23/autumn-statement-uk-politics-technology/">EVs, 5G and fintech: How the Autumn Statement affects UK tech</a></p></li>
<li><dl>
<dt><a href="http://weibo.wbdacdn.com/user/2201566133/status4045114244565559.html#utm_source=rss">&#38472;&#34382;&#24179;:&#20840;&#29699;&#25919;&#27835;&#20063;&#20687;&#24037;&#19994;&#19968;&#26679;&#65292;&#37117;&#22312;&#26631;&#20934;&#21270;&#12289;&#28526;&#27969;&#21270;&#12290;</a> <code class="fold">@</code></dt>
<dd><p>&#20013;&#22269;&#20869;&#37096;&#21387;&#21147;&#23558;&#25103;&#21095;&#21270;&#19978;&#21319;&#12290;&#20892;&#27665;&#24037;&#12289;&#25171;&#24037;&#32773;&#21644;&#22478;&#24066;&#26032;&#31227;&#27665;&#31561;&#26032;&#20852;&#32676;&#20307;&#21644;&#36793;&#32536;&#32676;&#20307;&#30340;&#21033;&#30410;&#35785;&#27714;&#23558;&#21095;&#22686;&#65307;&#21407;&#26377;&#24314;&#21046;&#27966;&#21033;&#30410;&#23558;&#36973;&#21040;&#25361;&#25112;&#65307;&#19982;&#32654;&#22269;&#36164;&#26412;&#25509;&#36817;&#30340;&#20013;&#22269;&#37329;&#34701;&#22280;&#12289;&#23186;&#20307;&#22280;&#12289;&#20140;&#27818;&#31561;&#22823;&#22478;&#24066;&#22320;&#20135;&#22320;&#31199;&#21033;&#30410;&#22242;&#20307;&#65292;&#39318;&#24403;&#20854;&#20914;&#12290;&#36807;&#21435;&#20108;&#21313;&#24180;&#24535;&#24471;&#24847;&#28385;&#30340;&#65292;&#38632;&#25171;&#39118;&#21561;&#21435;&#30340;&#27010;&#29575;&#39640;&#12290;</p>
<p>refs and see also</p>
<ul>
<li><a href="http://weibo.com/ttarticle/p/show?id=2309404045109699176640">&#29305;&#26391;&#26222;&#26102;&#20195;&#26469;&#20020;&#65292;&#8220;&#26367;&#20195;&#24615;&#20445;&#23432;&#20027;&#20041;&#8221;&#33021;&#20154;&#38598;&#22242;&#25104;&#20026;&#32654;&#22269;&#26032;&#20013;&#22362;</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://superuser.com/questions/132029/how-do-you-reload-your-vimrc-file-without-restarting-vim">How do you reload your .vimrc file without restarting vim? - Super User</a> <code class="fold">@</code></dt>
<dd><p><code>:so %</code> (source)</p>
<pre class="vim"><code>let s:patternLinux      = &#39;^\(.* \)\([1-9][0-9]*\)$&#39;
let s:patternWindows    = &#39;^\(.* \)\([1-9][0-9]*\)\(.*\)$&#39;
let s:minfontsize       = 6
let s:maxfontsize       = 16
function! AdjustFontSize(amount)
    if has(&quot;gui_gtk2&quot;) &amp;&amp; has(&quot;gui_running&quot;)
        &quot; set guifont=Inconsolata\ 14
        let fontname = substitute(&amp;guifont, s:patternLinux, &#39;\1&#39;, &#39;&#39;)
        let cursize  = substitute(&amp;guifont, s:patternLinux, &#39;\2&#39;, &#39;&#39;)
        let newsize = cursize + a:amount
        if (newsize &gt;= s:minfontsize) &amp;&amp; (newsize &lt;= s:maxfontsize)
            let newfont = fontname . newsize
            let &amp;guifont = newfont
        endif
  elseif has(&quot;gui_win32&quot;) &amp;&amp; has(&quot;gui_running&quot;)
      &quot; set guifont=Consolas:h14:cANSI
      let fontname = substitute(&amp;guifont, s:patternWindows, &#39;\1&#39;, &#39;&#39;)
      let cursize  = substitute(&amp;guifont, s:patternWindows, &#39;\2&#39;, &#39;&#39;)
      let tail     = substitute(&amp;guifont, s:patternWindows, &#39;\3&#39;, &#39;&#39;)
      let newsize = cursize + a:amount
      if (newsize &gt;= s:minfontsize) &amp;&amp; (newsize &lt;= s:maxfontsize)
          let newfont = fontname . newsize .tail
          let &amp;guifont = newfont
      endif
  else
      echoerr &quot;You need to run the GTK2 version of Vim to use this function.&quot;
  endif
endfunction

function! LargerFont()
  call AdjustFontSize(1)
endfunction
command! LargerFont call LargerFont()

function! SmallerFont()
  call AdjustFontSize(-1)
endfunction
command! SmallerFont call SmallerFont()</code></pre>
<p>refs and see also</p>
<ul>
<li><a href="http://vim.wikia.com/wiki/Change_font_size_quickly">Change font size quickly | Vim Tips Wiki | Fandom powered by Wikia</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.howtogeek.com/196958/the-3-best-ways-to-make-a-window-always-on-top-on-windows/">The 3 Best Ways to Make a Window Always-on-Top on Windows</a> <code class="fold">@</code></dt>
<dd><p>refs and see also</p>
<ul>
<li><a href="http://www.howtogeek.com/howto/13784/keep-a-window-on-top-with-a-handy-autohotkey-script/">Keep a Window on top with a handy AutoHotkey script</a></li>
<li><a href="http://www.labnol.org/software/tutorials/keep-window-always-on-top/5213/">Download Always on Top - Keep Any Window Visible Always</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.cnblogs.com/xishuai/p/cmder-git-bash.html">cmder git bash &#20351;&#29992; - &#30000;&#22253;&#37324;&#30340;&#34763;&#34752; - &#21338;&#23458;&#22253;</a> <code class="fold">@</code></dt>
<dd><p><code>&quot;C:\Program Files\Git\bin\sh.exe&quot; --login -i  -new_console:d:D:\tzx\git</code></p>
<p>&#28982;&#21518;&#35774;&#32622;&#25104; default task for now console&#12290;</p>
<p>&#28982;&#21518;&#25226; cmder &#36335;&#24452;&#21152;&#21040; %PATH%&#65292;&#28982;&#21518;&#31649;&#29702;&#21592;&#26435;&#38480;&#36816;&#34892; <code>Cmder.exe /REGISTER ALL</code>&#12290;</p>
<p>&#26368;&#21518;&#65292;&#21487;&#20197;&#35843;&#19968;&#19979; transparency&#12290;</p>
<p>&#36824;&#21487;&#20197;&#22797;&#21046;&#24403;&#21069; console&#65306;&#28857;&#19968;&#19979;&#30446;&#26631; tab&#65292;&#21491;&#38190;&#65292;restart or duplicate&#65292;duplicate root&#8230;&#12290;</p>
<p>&#28857;&#20987;&#28155;&#21152; console &#30340;&#26102;&#20505;&#65292;&#21487;&#20197;&#36873;&#25321; to bottom &#25110;&#32773; to right &#26469;&#20998;&#23631;&#65288;&#40664;&#35748;&#26159; layered&#65289;&#12290;</p>
<p>&#24403;&#28982;&#65292;&#24555;&#25463;&#38190;&#20854;&#23454;&#37117;&#26159;&#21487;&#20197;&#33258;&#24049;&#23450;&#20041;&#30340;&#12290;</p>
<div class="sourceCode"><pre class="sourceCode bash"><code class="sourceCode bash"><span class="kw">-new_console</span>:d:C:\Users\mfranc\Dropbox <span class="st">&quot;%ProgramFiles(x86)%\Vim\vim74\vim.exe&quot;</span> /k
<span class="kw">-new_console</span>:d:D:<span class="dt">\ </span><span class="st">&quot;%ProgramFiles(x86)%\Vim\vim74\vim.exe&quot;</span> /k -cur_console:n
<span class="kw">-cur_console</span>:d:D:<span class="dt">\ </span><span class="st">&quot;%ProgramFiles(x86)%\Git\bin\sh.exe&quot;</span> --login -i -cur_console:n:sT25V
<span class="kw">-cur_console</span>:d:D:<span class="dt">\ </span><span class="st">&quot;%ProgramFiles(x86)%\Git\bin\sh.exe&quot;</span> --login -i -cur_console:n:sT66H
<span class="kw">cmd.exe</span> -new_console:d:D:<span class="dt">\ </span>-i -cur_console:n:sT50H</code></pre></div>
<p>What does those commands do ? 1. Creates new screen and opens Vim in my Dropbox folder context 2. Creates new screen with Vim pointing to D:<br />
3. Initializes shell in new window and splits current screen into 75%/25% Horizontaly</p>
<p>&#36825;&#27573;&#23545;&#35805;&#20063;&#26159;&#21500;&#65306;</p>
<ul>
<li><p>After installing with cmder first thing you need to do - update ConEmu to latest preview or alpha build.</p></li>
<li><p>I haven&#8217;t done that. My current version is 140&#8230; . I can see on SourceForge that there is 1503.. available. Any serious changes in new preview ?</p>
<p>Wow actually there are a lot of changes. <a href="https://code.google.com/p/conemu-maximus5/wiki/Whats_New">https://code.google.com/p/cone&#8230;</a></p></li>
</ul>
<p>refs and see also</p>
<ul>
<li><a href="http://bg.biedalian.com/2014/09/11/cmder.html">&#36870;&#22825;&#31070;&#22120; cmder</a></li>
<li><a href="http://rakhesh.com/windows/whee-cmder-can-do-split-panes/">Whee! Cmder can do split panes! &#171; rakhesh.com</a></li>
<li><a href="http://mfranc.com/uncategorized/boost-your-dev-productivity-with-cmder-conemu/">Boost your dev productivity with cmder + ConEmu | Michal Franc</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.jeffjade.com/2016/03/11/2016-03-11-autohotkey/">Win &#19979;&#26368;&#29233;&#25928;&#29575;&#31070;&#22120;:AutoHotKey | &#26202;&#26228;&#24189;&#33609;&#36713;</a> <code class="fold">@</code></dt>
<dd><pre class="ahk"><code>;   # &#21495;&#20195;&#34920; Win &#38190;&#65307;&#65288;&#22270;&#24418;&#65289;
;   ! &#21495;&#20195;&#34920; Alt &#38190;&#65307;&#65288;&#36716;&#25442;&#65289;
;   ^ &#21495;&#20195;&#34920; Ctrl &#38190;&#65307;&#65288;&#24125;&#23376;&#65292;control&#65289;
;   + &#21495;&#20195;&#34920; shift &#38190;&#65307;&#65288;another layer&#65289;

;   :: &#21495;(&#20004;&#20010;&#33521;&#25991;&#20882;&#21495;)&#36215;&#20998;&#38548;&#20316;&#29992;&#65307;
;   run&#65292;&#38750;&#24120;&#24120;&#29992; &#30340; AHK &#21629;&#20196;&#20043;&#19968;;
;   ; &#21495;&#20195;&#34920; &#27880;&#37322;&#21518;&#38754;&#19968;&#34892;&#20869;&#23481;&#65307;</code></pre>
<pre class="ahk"><code>::/mail::mail.qq.com
::/tangzx::http://tangzx.qiniudn.com/</code></pre>
<p>&#19981;&#30693;&#36947;&#20026;&#20160;&#20040;&#25105;&#30340;&#19981;&#31649;&#29992;&#12290;</p>
</dd>
</dl></li>
<li><p><code>WIN</code> + <code>W</code> &#22909;&#21500;</p></li>
<li><dl>
<dt><a href="http://article.yeeyan.org/view/265546/309669">&#35793;&#35328;-&#20026;&#20160;&#20040;&#35201;&#25506;&#32034;&#23431;&#23449;</a> <code class="fold">@</code></dt>
<dd><p>&#37027;&#26159;&#22312; 400 &#24180;&#21069;&#65292;&#24503;&#22269;&#26576;&#23567;&#38215;&#37324;&#26377;&#19968;&#20301;&#20271;&#29237;&#12290;&#20182;&#26159;&#20010;&#24515;&#22320;&#21892;&#33391;&#30340;&#20154;&#65292;&#20182;&#23558;&#33258;&#24049;&#25910;&#20837;&#30340;&#19968;&#22823;&#37096;&#20998;&#25424;&#32473;&#20102;&#38215;&#23376;&#19978;&#30340;&#31351;&#20154;&#12290;&#36825;&#21313;&#20998;&#20196;&#20154;&#38054;&#20329;&#65292;&#22240;&#20026;&#20013;&#19990;&#32426;&#26102;&#31351;&#20154;&#24456;&#22810;&#65292;&#32780;&#19988;&#37027;&#26102;&#32463;&#24120;&#29190;&#21457;&#24109;&#21367;&#20840;&#22269;&#30340;&#30239;&#30123;&#12290;&#19968;&#22825;&#65292;&#20271;&#29237;&#30896;&#21040;&#20102;&#19968;&#20010;&#22855;&#24618;&#30340;&#20154;&#65292;&#20182;&#23478;&#20013;&#26377;&#19968;&#20010;&#24037;&#20316;&#21488;&#21644;&#19968;&#20010;&#23567;&#23454;&#39564;&#23460;&#65292;&#20182;&#30333;&#22825;&#21334;&#21147;&#24037;&#20316;&#65292;&#27599;&#22825;&#26202;&#19978;&#30340;&#20960;&#23567;&#26102;&#30340;&#26102;&#38388;&#19987;&#24515;&#36827;&#34892;&#30740;&#31350;&#12290;&#20182;&#25226;&#23567;&#29627;&#29827;&#29255;&#30740;&#30952;&#25104;&#38236;&#29255;&#65292;&#28982;&#21518;&#25226;&#30740;&#30952;&#22909;&#30340;&#38236;&#29255;&#35013;&#21040;&#38236;&#31570;&#37324;&#65292;&#29992;&#27492;&#26469;&#35266;&#23519;&#32454;&#23567;&#30340;&#29289;&#20214;&#12290;&#20271;&#29237;&#34987;&#36825;&#20010;&#21069;&#25152;&#26410;&#35265;&#30340;&#21487;&#20197;&#25226;&#19996;&#35199;&#25918;&#22823;&#35266;&#23519;&#30340;&#23567;&#21457;&#26126;&#36855;&#20303;&#20102;&#12290;&#20182;&#36992;&#35831;&#36825;&#20010;&#24618;&#20154;&#20303;&#21040;&#20102;&#20182;&#30340;&#22478;&#22561;&#37324;&#65292;&#20316;&#20026;&#20271;&#29237;&#30340;&#38376;&#23458;&#65292;&#27492;&#21518;&#20182;&#21487;&#20197;&#19987;&#24515;&#25237;&#20837;&#25152;&#26377;&#30340;&#26102;&#38388;&#26469;&#30740;&#31350;&#36825;&#20123;&#20809;&#23398;&#22120;&#20214;&#12290;</p>
<p>&#28982;&#32780;&#65292;&#38215;&#23376;&#19978;&#30340;&#20154;&#24471;&#30693;&#20271;&#29237;&#22312;&#36825;&#20040;&#19968;&#20010;&#24618;&#20154;&#21644;&#20182;&#37027;&#20123;&#26080;&#29992;&#30340;&#29609;&#24847;&#20799;&#19978;&#33457;&#36153;&#37329;&#38065;&#20043;&#21518;&#65292;&#37117;&#24456;&#29983;&#27668;&#12290;&#8220;&#25105;&#20204;&#36824;&#22312;&#21463;&#30239;&#30123;&#30340;&#33510;&#65292;&#8221;&#20182;&#20204;&#25265;&#24616;&#36947;&#65292;&#8220;&#32780;&#20182;&#21364;&#20026;&#37027;&#20010;&#38386;&#20154;&#21644;&#20182;&#27809;&#29992;&#30340;&#29233;&#22909;&#20081;&#33457;&#38065;&#65281;&#8221;&#20271;&#29237;&#21548;&#21040;&#21518;&#19981;&#20026;&#25152;&#21160;&#12290;&#8220;&#25105;&#20250;&#23613;&#21487;&#33021;&#22320;&#25509;&#27982;&#22823;&#23478;&#65292;&#8221;&#20182;&#34920;&#31034;&#65292;&#8220;&#20294;&#25105;&#20250;&#32487;&#32493;&#36164;&#21161;&#36825;&#20010;&#20154;&#21644;&#20182;&#30340;&#24037;&#20316;&#65292;&#25105;&#30830;&#20449;&#32456;&#26377;&#19968;&#22825;&#20250;&#26377;&#22238;&#25253;&#12290;&#8221;</p>
<p>&#26524;&#19981;&#20854;&#28982;&#65292;&#20182;&#30340;&#24037;&#20316;&#65288;&#20197;&#21450;&#21516;&#26102;&#26399;&#20854;&#20182;&#20154;&#30340;&#21162;&#21147;&#65289;&#36194;&#26469;&#20102;&#20016;&#21402;&#30340;&#22238;&#25253;&#65306;&#26174;&#24494;&#38236;&#12290;&#26174;&#24494;&#38236;&#30340;&#21457;&#26126;&#32473;&#21307;&#23398;&#24102;&#26469;&#20102;&#21069;&#25152;&#26410;&#26377;&#30340;&#21457;&#23637;&#65292;&#30001;&#27492;&#23637;&#24320;&#30340;&#30740;&#31350;&#21450;&#20854;&#25104;&#26524;&#65292;&#28040;&#38500;&#20102;&#19990;&#30028;&#19978;&#22823;&#37096;&#20998;&#22320;&#21306;&#32902;&#34384;&#30340;&#30239;&#30123;&#21644;&#20854;&#20182;&#19968;&#20123;&#20256;&#26579;&#24615;&#30142;&#30149;&#12290;</p>
<p>&#20271;&#29237;&#20026;&#25903;&#25345;&#36825;&#39033;&#30740;&#31350;&#21457;&#26126;&#25152;&#33457;&#36153;&#30340;&#37329;&#38065;&#65292;&#20854;&#26368;&#32456;&#32467;&#26524;&#22823;&#22823;&#20943;&#36731;&#20102;&#20154;&#31867;&#25152;&#36973;&#21463;&#30340;&#33510;&#38590;&#65292;&#36825;&#22238;&#25253;&#36828;&#36828;&#36229;&#36807;&#21333;&#32431;&#23558;&#36825;&#20123;&#38065;&#29992;&#26469;&#25937;&#27982;&#37027;&#20123;&#36973;&#21463;&#30239;&#30123;&#30340;&#20154;&#12290;</p>
<p>&#30331;&#26376;&#24037;&#31243;&#38656;&#35201;&#21382;&#21490;&#19978;&#21069;&#25152;&#26410;&#26377;&#30340;&#39640;&#31934;&#24230;&#21644;&#39640;&#21487;&#38752;&#24615;&#12290;&#38754;&#23545;&#22914;&#27492;&#20005;&#33499;&#30340;&#35201;&#27714;&#65292;&#25105;&#20204;&#35201;&#23547;&#25214;&#26032;&#26448;&#26009;&#65292;&#26032;&#26041;&#27861;&#65307;&#24320;&#21457;&#20986;&#26356;&#22909;&#30340;&#24037;&#31243;&#31995;&#32479;&#65307;&#29992;&#26356;&#21487;&#38752;&#30340;&#21046;&#20316;&#27969;&#31243;&#65307;&#35753;&#20202;&#22120;&#30340;&#24037;&#20316;&#23551;&#21629;&#26356;&#38271;&#20037;&#65307;&#29978;&#33267;&#38656;&#35201;&#25506;&#32034;&#20840;&#26032;&#30340;&#33258;&#28982;&#35268;&#24459;&#12290;</p>
<p>&#36825;&#20123;&#20026;&#30331;&#26376;&#21457;&#26126;&#30340;&#26032;&#25216;&#26415;&#21516;&#26679;&#21487;&#20197;&#29992;&#20110;&#22320;&#38754;&#19978;&#30340;&#24037;&#31243;&#39033;&#30446;&#12290;</p>
<div class="figure">
<img src="http://farm8.staticflickr.com/7251/7724458444_0e91f569b3_o.jpg" />

</div>
<p>refs and see also</p>
<ul>
<li><a href="http://www.lettersofnote.com/2012/08/why-explore-space.html">Letters of Note: Why Explore Space?</a></li>
<li><a href="https://en.wikipedia.org/wiki/Ernst_Stuhlinger">Ernst Stuhlinger - Wikipedia</a></li>
</ul>
</dd>
</dl></li>
<li><p><a href="https://www.douban.com/note/593376308/">&#25105;&#20026;&#20160;&#20040;&#27809;&#33021;&#31934;&#20998;</a></p></li>
<li><dl>
<dt><a href="http://neuronstar.cc/spiking-neuron-models/24.From_individual_neurons_to_collective_bursting/">24. From individual neurons to collective bursting &#8211; NEURONSTAR</a> <code class="fold">@</code></dt>
<dd><p>&#31456;&#40060;&#21941;&#12290;</p>
<p>Neuronstar is a website about neurons and network.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.douban.com/note/594056541/">&#20160;&#20040;&#26159;&#25991;&#31508;&#65311;&#65288;&#36716;&#65289;</a> <code class="fold">@</code></dt>
<dd><p>&#25105;&#20204;&#35201;&#20570;&#24456;&#22810;&#35757;&#32451;&#26469;&#33719;&#24471;&#22522;&#26412;&#30340;&#25551;&#36848;&#21644;&#27427;&#36175;&#33021;&#21147;&#30340;&#12290;&#32780;&#25105;&#35201;&#25552;&#37266;&#30340;&#26159;&#65292;&#25991;&#31508;&#33021;&#21147;&#26377;&#20004;&#23618;&#65292;&#19968;&#23618;&#26159;&#20934;&#30830;&#65292;&#31532;&#20108;&#23618;&#25165;&#26159;&#32654;&#24863;&#12290;&#22833;&#21435;&#20102;&#20934;&#30830;&#65292;&#21482;&#26377;&#8220;&#25152;&#35859;&#32654;&#24863;&#8221;&#30340;&#25991;&#23383;&#20854;&#23454;&#26159;&#38750;&#24120;&#19985;&#38475;&#30340;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/26/cern-large-hadrone-collider-tim-robot-inspector/">CERN introduces Large Hadron Collider&#8217;s robotic inspectors</a> <code class="fold">@</code></dt>
<dd><p>hadron <code>['h&#230;dr&#594;n]</code> n. (&#39640;&#33021;) &#24378;&#23376;</p>
<dl>
<dt>CERN <code class="foldable">@</code></dt>
<dd><div class="figure">
<img src="https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/CERN-Logo.svg/225px-CERN-Logo.svg.png" align="right" />

</div>
<p>The European Organization for Nuclear Research (French: Organisation europ&#233;enne pour la recherche nucl&#233;aire), known as CERN (<code>/&#712;s&#604;&#720;rn/</code>; French pronunciation: <code>[s&#603;&#641;n]</code>; derived from the name &#8220;Conseil Europ&#233;en pour la Recherche Nucl&#233;aire&#8221;; see History), is a European research organization that operates the largest particle physics laboratory in the world. Established in 1954, the organization is based in a northwest suburb of Geneva on the Franco &#8211;Swiss border, (46&#176;14&#8242;3&#8243;N 6&#176;3&#8242;19&#8243;E) and has 22 member states. Israel is the only non-European country granted full membership.</p>
<p>The term CERN is also used to refer to the laboratory, which in 2013 had 2,513 staff members, and hosted some 12,313 fellows, associates, apprentices as well as visiting scientists and engineers representing 608 universities and research facilities.</p>
<p>CERN&#8217;s main function is to provide the <strong>particle accelerators</strong> and other infrastructure needed for <strong>high-energy physics research</strong> &#8211; as a result, numerous experiments have been constructed at CERN through international collaborations.</p>
<p>CERN is also the <strong>birthplace of the World Wide Web</strong>. The main site at Meyrin has a large computer facility containing powerful data processing facilities, primarily for experimental-data analysis; because of the need to make these facilities available to researchers elsewhere, it has historically been a major wide area network hub.</p>
</dd>
</dl>
<p>Since the <strong>Large Hadron Collider (LHC)</strong> &#22823;&#22411;&#24378;&#23376;&#30896;&#25758;&#22411;&#21152;&#36895;&#35013;&#32622; needs to be in tip-top shape to discover new particles, it has two inspectors making sure everything&#8217;s in working order. The two of them are called TIM, short not for Timothy (&#20154;&#21517;&#65292;&#26799;&#29287;&#33609;), but for <strong>Train Inspection Monorail</strong> (&#21333;&#36712;). These mini autonomous monorails that keep an eye on the world&#8217;s largest particle collider follow a pre-defined route and get around using tracks suspended from the ceiling. According to CERN&#8217;s post introducing the machines, the tracks are remnants from the time the tunnel housed the Large Electron Positron instead of the LHC. The LEP&#8217;s monorail was bigger, but not quite as high-tech: it was mainly used to transport materials and workers.</p>
<p>&#20063;&#23601;&#26159;&#26377;&#20004;&#20010; TIM&#65288;Train Inspection Monorail&#65289;&#22312; CERN &#30340;&#38567;&#36947;&#37324;&#30417;&#27979;&#12290;</p>
<p>As for what the machines can do, the answer is &#8220;quite a few.&#8221; They can monitor the tunnel&#8217;s structure, oxygen percentage, temperature and communication bandwidth in real time. Both TIMs can also take visual and infrared images, as well as pull small wagons behind them if needed. You can watch them in action below &#8211; as you can see, they&#8217;re not much to look at with their boxy silver appearance. But without them, it&#8217;ll be tough monitoring a massive circular tunnel with a 17-mile circumference. &#65288;CERN &#22909;&#22823;&#8230;&#8230;&#65289;</p>
</dd>
</dl></li>
<li><p><a href="http://mp.weixin.qq.com/s/Ucaw6W-DIYWOsLM0ESAbdw">&#29305;&#26391;&#26222;&#26102;&#20195;&#21069;&#20256;&#65306;&#20998;&#28165;&#37324;&#26681;&#21644;&#20811;&#26519;&#39039;&#65292;&#20102;&#35299;&#20170;&#22825;&#19990;&#30028;&#38382;&#39064;&#30340;&#36215;&#28304;</a></p></li>
<li><dl>
<dt><a href="http://cj.sina.com.cn/article/normal_detail?url=http://finance.sina.com.cn/roll/2016-11-27/doc-ifxyawmp0268372.shtml&amp;cre=financew&amp;mod=f&amp;loc=3&amp;r=0&amp;doct=0&amp;rfunc=84&amp;tj=none&amp;s=0&amp;wm=5312_0010">&#32769;&#21326;&#20026;&#20154;&#30524;&#20013;5G&#21069;&#36335;&#65306;2020&#24180;&#21830;&#29992;&#22826;&#28608;&#36827; &#25216;&#26415;&#20173;&#24453;&#31361;&#30772;_&#36130;&#32463;&#22836;&#26465;</a> <code class="fold">@</code></dt>
<dd><p>&#20840;&#29699; 5G &#27491;&#22312;&#21927;&#22179;&#20013;&#25512;&#34892;&#65292;&#20808;&#26159;&#22312; 4G &#33853;&#21518;&#30340;&#26085;&#38889;&#65292;&#38750;&#24120;&#31215;&#26497;&#25237;&#20837; 5G&#65292;&#28982;&#21518;&#20013;&#22269;&#20063;&#21464;&#24471;&#31215;&#26497;&#65292;&#27431;&#32654;&#34429;&#28982;&#27604;&#36739;&#29702;&#24615;&#65292;&#20294;&#20063;&#24597;&#20013;&#26085;&#38889;&#25250;&#20102;&#20808;&#26426;&#65292;&#21487;&#20197;&#30475;&#21040;&#25972;&#20010;&#19990;&#30028;&#19978; 5G&#26631;&#20934;&#20105;&#22842;&#22823;&#25112;&#24840;&#28436;&#24840;&#28872;&#65292;&#22312;&#32534;&#30721;&#38454;&#27573;&#65292;&#20013;&#22269;&#21326;&#20026;&#30340; Polarcode &#26041;&#26696;&#31454;&#20105;&#23545;&#25163;&#65292;&#20027;&#35201;&#21253;&#25324;&#20197;&#32654;&#22269;&#20844;&#21496;&#20026;&#39318;&#30340; LDPC&#65292;&#27861;&#22269;&#30340; Turbo2.0 &#26041;&#26696;&#65292;&#20854;&#20013;&#32654;&#22269;&#39640;&#36890;&#25512; LD-PC &#26041;&#26696;&#65292;&#34987;&#30830;&#23450;&#20026; 5G &#30340;&#20013;&#25968;&#25454;&#20449;&#36947;&#30340;&#32534;&#30721;&#26041;&#26696;&#12290;</p>
<p>&#25105;&#30340;&#35266;&#28857;&#26159;&#65292;&#22914;&#26524;&#27809;&#26377;&#22522;&#30784;&#29702;&#35770;&#21644;&#26680;&#24515;&#25216;&#26415;&#30340;&#31361;&#30772;&#65292;&#38590;&#20197;&#24418;&#25104;&#19968;&#20195;&#36890;&#20449;&#31995;&#32479;&#12290;&#24403;&#28982;&#65292;&#36890;&#20449;&#26631;&#20934;&#24182;&#19981;&#26159;&#21333;&#32431;&#30340;&#25216;&#26415;&#38382;&#39064;&#65292;&#20854;&#20013;&#21830;&#19994;&#31454;&#20105;&#21644;&#25919;&#27835;&#21338;&#24328;&#20063;&#36215;&#21040;&#38750;&#24120;&#22823;&#20316;&#29992;&#12290;</p>
<p>&#65288;&#26472;&#23398;&#24535;&#27605;&#19994;&#20110;&#28165;&#21326;&#22823;&#23398;&#65292;2000.7~2012.9 &#20219;&#32844;&#21326;&#20026;&#65292;IEEESeniorMember&#65292;4G &#22880;&#22522;&#24615;&#25216;&#26415;&#8220;&#36719;&#39057;&#29575;&#22797;&#29992;&#8221;&#30340;&#21457;&#26126;&#20154;&#65292;&#12298;&#36890;&#20449;&#20043;&#36947;&#12299;&#20316;&#32773;&#65292;&#29616;&#20026;&#26080;&#32447;&#36890;&#20449;&#25216;&#26415;&#29420;&#31435;&#30740;&#31350;&#32773;&#12290;&#26412;&#25253;&#35760;&#32773;&#20911;&#24198;&#33395;&#12289;&#21016;&#21019;&#37319;&#35775;&#25972;&#29702;&#65289;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://cn.engadget.com/2016/11/26/vlc-360-preview/">VLC &#25773;&#25918;&#22120;&#20063;&#35201;&#25903;&#25345; 360 &#24230;&#35270;&#39057;&#25773;&#25918;&#20102;</a> <code class="fold">@</code></dt>
<dd><p>VLC &#30340;&#24320;&#21457;&#22242;&#38431; VideoLan &#19982; 360 &#24230;&#35270;&#39057;&#24320;&#21457;&#21830; Giroptic &#21512;&#20316;&#24320;&#21457;&#36825;&#21151;&#33021;&#65292;&#23427;&#33021;&#25903;&#25345;&#25773;&#25918;&#30456;&#29255;&#12289;&#20840;&#26223;&#30456;&#29255;&#21644;&#35270;&#39057;&#12290;&#20351;&#29992;&#32773;&#21482;&#35201;&#29992;&#40736;&#26631;&#21644;&#38190;&#30424;&#23601;&#33021;&#25511;&#21046;&#35270;&#28857;&#12290;</p>
<p>refs and see also</p>
<ul>
<li><a href="https://www.engadget.com/2016/04/26/giroptics-360-degree-waterproof-camera-starts-shipping/">Giroptic&#8217;s 360-degree waterproof camera starts shipping</a></li>
</ul>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/23/us-proposes-driver-mode-for-phones/">US proposes a phone &#8216;driver mode&#8217; to reduce in-car distractions</a> <code class="fold">@</code></dt>
<dd><p>Specifically, officials would like the driving mode to disable &#8220;manual text entry&#8221; (think keyboards), photo and video playback, non-essential text, social networking and the web. Don&#8217;t expect it to automatically kick in, though. While the agency would like the mode to launch whenever you&#8217;re moving faster than a crawling pace (5MPH), it knows that it&#8217;s difficult to tell the difference between a driver and a passenger. You may have to invoke it yourself until technology catches up, and there would be an override if there&#8217;s an app you simply have to use.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://github.com/drduh/macOS-Security-and-Privacy-Guide">drduh/macOS-Security-and-Privacy-Guide: A practical guide to securing macOS.</a> <code class="fold">@</code></dt>
<dd><p>9,000+ stars.</p>
<p>This is a collection of thoughts on securing a modern Apple Mac computer using macOS (formerly &#8220;OS X&#8221;) 10.12 &#8220;Sierra&#8221;, as well as steps to improving online privacy.</p>
<p>This guide is targeted to &#8220;power users&#8221; who wish to adopt enterprise-standard security, but is also suitable for novice users with an interest in improving their privacy and security on a Mac.</p>
<p>A system is only as secure as its administrator is capable of making it. There is no one single technology, software, nor technique to guarantee perfect computer security; a modern operating system and computer is very complex, and requires numerous incremental changes to meaningfully improve one&#8217;s security and privacy posture.</p>
<p>I am not responsible if you break a Mac by following any of these steps.</p>
<p>If you wish to make a correction or improvement, please send a pull request or open an issue.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/23/doj-cinemas-must-offer-tech-for-blind-and-deaf-customers/">DOJ: Cinemas must offer tech for blind and deaf customers</a> <code class="fold">@</code></dt>
<dd><p>&#39069;&#8230;&#8230;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.reuters.com/article/us-europe-space-mars-idUSKBN13I2BA?feedType=RSS&amp;feedName=topNews&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+reuters%2FtopNews+%28News+%2F+US+%2F+Top+News%29">Navigation system failure cited in crash of European Mars lander | Reuters</a> <code class="fold">@</code></dt>
<dd><p>&#19981;&#36896;&#36825;&#20010; cited &#24590;&#20040;&#32763;&#35793;&#25104;&#20013;&#25991;&#27604;&#36739;&#36866;&#21512;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.engadget.com/2016/11/23/mit-builds-low-cost-synthetic-muscles-out-of-nylon-cord/">MIT builds low-cost synthetic muscles out of nylon cord</a> <code class="fold">@</code></dt>
<dd><p>https://www.youtube.com/watch?v=Q3GG4JJQRQA</p>
<p>Nylon &#65288;&#23612;&#40857;&#8212;should be&#8212;&gt;&#33713;&#40857;&#65289; Fiber&#12290;</p>
<p>Researchers have been trying to build durable, low-cost synthetic muscles <strong>for years but to no avail</strong>. The systems developed so far have either been too expensive to produce en mass (like carbon nanotube) or too delicate and power hungry (looking at you, <strong>shape-memory alloys</strong>) to be useful outside of laboratory conditions. But a team from MIT have just struck upon the Goldilocks zone of robo-muscles with nylon fiber of all things.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.washingtonpost.com/news/to-your-health/wp/2016/11/23/many-lasik-patients-may-wind-up-with-glare-halos-or-other-visual-symptoms-study-suggests/?hpid=hp_hp-more-top-stories_lasik-1115am%3Ahomepage%2Fstory&amp;utm_term=.3f746f9a21f4">Many LASIK patients may wind up with glare, halos or other visual symptoms, study suggests - The Washington Post</a> <code class="fold">@</code></dt>
<dd><p>LASIK&#65292;abbr. &#38253;&#23556;&#35270;&#21147;&#30699;&#27491;&#25163;&#26415;&#65288;Laser Assisted In-situ Keratomi&#65289;</p>
<p>The study analyzed outcomes for two groups of LASIK patients. In the first group, which included 262 Navy personnel with an average age of 29.1, it was 43 percent reporting new symptoms. And in the second, consisting of 312 civilians at five practice and academic centers and with a median age of 31.5, it was 46 percent. In addition, about 28 percent of patients who had never had dry-eye symptoms before developed mild, moderate or severe symptoms three months after the procedure.</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.jianshu.com/p/c66422224537">&#23567;&#31859;&#30340;&#25104;&#21151;&#65292;&#20320;&#20204;&#26410;&#24517;&#30475;&#24471;&#25026; - &#31616;&#20070;</a> <code class="fold">@</code></dt>
<dd><p>&#21326;&#20026;&#25454;&#35828;&#26159;&#20013;&#22269;&#25928;&#30410;&#26368;&#22909;&#30340;&#20225;&#19994;&#65292;&#19968;&#23478;&#21326;&#20026;&#30340;&#24635;&#25910;&#20837;&#36229;&#36807; BAT &#30340;&#24635;&#21644;&#12290;</p>
<p>2016 &#24180;&#30340;&#25968;&#25454;&#26174;&#31034;&#65292;&#21326;&#20026;&#22312;&#20013;&#22269;&#20116;&#30334;&#24378;&#20225;&#19994;&#20013;&#65292;&#20197; 3950.09 &#20159;&#20803;&#30340;&#24180;&#33829;&#19994;&#25910;&#20837;&#25104;&#20026; 500 &#24378;&#27036;&#39318;&#12290;</p>
<p>&#23567;&#31859;&#30340;&#24180;&#33829;&#25910;&#20837;&#21482;&#26377; 743 &#20159; &#12290;&#21482;&#26377;&#21326;&#20026;&#30340; 18.8%&#12290;</p>
<p>&#20294;&#26159;&#65292;&#22914;&#26524;&#20877;&#30475;&#19968;&#19979;&#20004;&#23478;&#20844;&#21496;&#30340;&#21592;&#24037;&#20154;&#25968;&#65306;&#21326;&#20026;&#26159; 17 &#19975;&#20154;&#65292;&#23567;&#31859;&#26159; 8 &#21315;&#22810;&#20154;&#12290;&#21326;&#20026;&#30340;&#20154;&#25968;&#22823;&#32422;&#26159;&#23567;&#31859;&#30340; 20 &#20493;&#12290;&#36825;&#26679;&#19968;&#27604;&#36739;&#65292;&#23567;&#31859;&#30340;&#20154;&#22343;&#24180;&#33829;&#25910;&#20837;&#26159;&#21326;&#20026;&#30340; 3.7 &#20493;&#12290;</p>
</dd>
</dl></li>
</ul>
<script src="../lazyload.min.js"></script>
<script src="../jquery-3.0.0.min.js"></script>
<script src="../jquery.idTabs.min.js"></script>
<script src="../egg.min.js"></script>
<script src="../clipboard.min.js"></script>
<script src="../notes.js"></script>
</body>
</html>
