<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <meta http-equiv="Content-Style-Type" content="text/css" />
    <meta name="author" content="district10" />
    <meta http-equiv="x-ua-compatible" content="ie=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Notes 3</title>
    <link rel="stylesheet" href="../github-markdown.css" type="text/css" />
    <link rel="stylesheet" href="../highlight.css" type="text/css" />
    <link rel="stylesheet" href="../notes.css" type="text/css" />
</head>
<body class="markdown-body">
<a href="https://github.com/district10/notes">
    <img
        style="position: absolute; top: 0; right: 0; border: 0; width: 149px; height: 149px;"
        src="../fork-me-on-github.png" alt="Fork me on GitHub"></a>
<div id="navigator"><a id="gotoindex" href="index.html" title="&#12304;&#22238;&#21040;&#31508;&#35760;&#32034;&#24341; | Back to Index&#12305;">&#9763;</a>
</div>
<span id="help">&#25353;&#19979; "h" &#33719;&#21462;&#39029;&#38754;&#24110;&#21161;&#12290;</span>
<ul>
<li><dl>
<dt><a href="http://stackoverflow.com/questions/4089430/how-can-i-determine-the-url-that-a-local-git-repository-was-originally-cloned-fr">github - How can I determine the URL that a local Git repository was originally cloned from? - Stack Overflow</a> <code class="fold">@</code></dt>
<dd><div class="sourceCode"><pre class="sourceCode java"><code class="sourceCode java">git remote show origin
git remote -v</code></pre></div>
</dd>
</dl></li>
<li><dl>
<dt>&#33853;&#21518;&#20174;&#36828;&#22788;&#30475;&#32463;&#24120;&#35753;&#33041;&#23376;&#19981;&#22909;&#20351;&#30340;&#20154;&#20135;&#29983;&#20102;&#19968;&#31181;&#12304;&#28010;&#28459;&#12305;&#30340;&#38169;&#35273;&#65292;&#27604;&#22914;&#35199;&#34255;&#12290; <code class="fold">@</code></dt>
<dd><div class="figure">
<img src="https://img3.doubanio.com/view/status/median/public/1a8fb7273e40d92.jpg" />

</div>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://m.weibo.cn/1477045392/4033895752425543?uicode=10000002&amp;moduleID=feed&amp;mid=4033895752425543&amp;luicode=10000198&amp;_status_id=4033895752425543&amp;lfid=1076031477045392_-_WEIBO_SECOND_PROFILE_WEIBO&amp;sourcetype=page&amp;lcardid=1076031477045392_-_WEIBO_SECOND_PROFILE_WEIBO_-_4033895752425543&amp;sudaref=www.douban.com&amp;retcode=6102">&#32769;&#30007;&#20154;</a> <code class="fold">@</code></dt>
<dd><blockquote>
<p>&#25105;&#19981;&#22826;&#21916;&#27426;&#35848;&#24863;&#24773;&#38382;&#39064;&#65292;&#20063;&#19981;&#38752;&#36825;&#20010;&#28151;&#25991;&#23383;&#27743;&#28246;&#65292;&#20294;&#30475;&#20102;&#19978;&#26465;&#25105;&#36716;&#21457;&#30340;&#24494;&#21338;&#20043;&#21518;&#65292;&#35273;&#24471;&#26377;&#20960;&#21477;&#35805;&#36319;&#24895;&#24847;&#21548;&#30340;&#26379;&#21451;&#35828;&#35828;&#12290;</p>
<p>&#20316;&#20026;&#19968;&#20010;&#26377;&#28857;&#20799;&#38405;&#21382;&#12289;&#26377;&#28857;&#20799;&#32463;&#27982;&#22522;&#30784;&#30340;&#32769;&#30007;&#20154;&#65292;&#23545;&#20110;&#25105;&#20204;&#36825;&#31181;&#20154;&#26469;&#35828;&#65292;&#38500;&#38750;&#26159;&#19981;&#24819;&#65292;&#21542;&#21017;&#30495;&#24515;&#27809;&#21861;&#27873;&#19981;&#19978;&#30340;&#26222;&#36890;&#28418;&#20142;&#22942;&#20799;&#65292;&#25110;&#32773;&#35828;&#30561;&#19978;&#20063;&#34892;&#12290;&#24744;&#30495;&#21035;&#19981;&#20449;&#65292;&#36825;&#26159;&#30495;&#24515;&#35805;&#12290;&#25152;&#26377;&#30340;&#22871;&#36335;&#26089;&#24050;&#20889;&#22909;&#65292;&#26089;&#23601;&#23092;&#29087;&#21040;&#26412;&#33021;&#21453;&#24212;&#30340;&#31243;&#24230;&#12290;</p>
<p>&#20294;&#20316;&#20026;&#19968;&#20010;&#22899;&#20154;&#24744;&#35201;&#30693;&#36947;&#65292;&#25105;&#20204;&#36825;&#31181;&#20154;&#20250;&#21916;&#27426;&#24744;&#65292;&#19981;&#26159;&#22240;&#20026;&#24744;&#34850;&#21040;&#21482;&#33021;&#25746;&#23047;&#65292;&#22312;&#25105;&#20204;&#24515;&#37324;&#19968;&#20010;&#22899;&#20154;&#30340;&#29305;&#36136;&#25353;&#29031;&#36825;&#20010;&#39034;&#24207;&#25490;&#21015;&#65306;&#32874;&#26126;&#12289;&#19981; zuo&#12289;&#29420;&#31435;&#12289;&#36523;&#26448;&#12289;&#28418;&#20142;&#12290;&#21482;&#26377;&#21518;&#20004;&#20010;&#30340;&#35805;&#65292;&#24744;&#23601;&#26159;&#19968;&#20010;&#26114;&#36149;&#30340;&#35013;&#39280;&#21697;&#65292;&#25105;&#20204;&#20250;&#20026;&#27492;&#22475;&#21333;&#65292;&#20294;&#19981;&#20250;&#35753;&#36825;&#20107;&#20799;&#26377;&#32467;&#26524;&#12290;</p>
<p>&#20026;&#21861;&#65311;&#24456;&#31616;&#21333;&#21834;&#65292;&#19981;&#33021;&#22312;&#26234;&#21147;&#19978;&#12289;&#24773;&#21830;&#19978;&#37197;&#21512;&#65292;&#26085;&#23376;&#30495;&#24515;&#36807;&#19981;&#19979;&#21435;&#22043;&#12290;&#25105;&#36825;&#20799;&#29730;&#30952;&#30528;&#20844;&#21496;&#21830;&#21153;&#27169;&#24335;&#65292;&#24744;&#36319;&#25105;&#35828;&#35201;&#38506;&#30528;&#36891;&#34903;&#65307;&#25105;&#36825;&#20799;&#35835;&#20070;&#27491;&#22312;&#19978;&#30270;&#65292;&#24744;&#35828;&#25105;&#27809;&#21450;&#26102;&#22238;&#22797;&#24494;&#20449;&#12290;&#35828;&#24471;&#26356;&#30452;&#30333;&#19968;&#20123;&#65292;&#24744;&#38500;&#20102;&#35013;&#39280;&#21697;&#19982;&#24202;&#19978;&#20215;&#20540;&#20043;&#22806;&#65292;&#20854;&#23427;&#37117;&#26159;&#20010;&#40635;&#28902;&#12290;</p>
<p>&#36825;&#35805;&#35828;&#24471;&#26159;&#19981;&#26159;&#24456;&#30007;&#26435;&#12289;&#24456;&#26080;&#24773;&#65311;&#27809;&#38169;&#65292;&#36825;&#23601;&#26159;&#32769;&#30007;&#20154;&#30340;&#19990;&#30028;&#65292;&#19981;&#26159;&#22240;&#20026;&#26377;&#29305;&#21035;&#22810;&#30340;&#35825;&#24785;&#65292;&#32780;&#26159;&#29983;&#27963;&#26412;&#36523;&#38656;&#35201;&#25105;&#20204;&#36825;&#20040;&#20570;&#65292;&#25110;&#32773;&#26159;&#25105;&#20204;&#38656;&#35201;&#23547;&#27714;&#19968;&#31181;&#26377;&#33258;&#24049;&#19987;&#27880;&#24230;&#30340;&#29983;&#27963;&#12290;&#32780;&#19988;&#25105;&#20204;&#26377;&#33258;&#24049;&#19981;&#33021;&#30896;&#30340;&#24213;&#32447;&#65292;&#21487;&#33021;&#36825;&#26465;&#24213;&#32447;&#24456;&#20302;&#65292;&#20294;&#19968;&#30452;&#23384;&#22312;&#65292;&#30896;&#21040;&#23601;&#26159;&#30456;&#20114;&#20851;&#31995;&#30340;&#39640;&#21387;&#32447;&#65292;&#31435;&#21051;&#23601;&#33021;&#30701;&#36335;&#12290;</p>
<p>&#23681;&#25968;&#22823;&#20102;&#65292;&#24456;&#22810;&#20107;&#24773;&#30475;&#24471;&#29305;&#21035;&#24320;&#19982;&#29305;&#21035;&#19981;&#24320;&#65292;&#20004;&#32773;&#37117;&#24448;&#26497;&#31471;&#19978;&#36208;&#20102;&#12290;</p>
<p>&#22914;&#26524;&#19968;&#20010;&#32769;&#30007;&#20154;&#24895;&#24847;&#20570;&#24456;&#22810;&#19981;&#24895;&#24847;&#20570;&#30340;&#20107;&#65288;&#23601;&#26159;&#19978;&#19968;&#26465;&#24494;&#21338;&#37324;&#37027;&#20123;&#65289;&#65292;&#22522;&#26412;&#19978;&#19981;&#26159;&#36824;&#27809;&#30561;&#36807;&#24744;&#65292;&#23601;&#26159;&#36824;&#27809;&#30561;&#28902;&#24744;&#65292;&#19968;&#23450;&#19981;&#26159;&#20182;&#22810;&#29233;&#24744;&#12290;</p>
<p>&#26126;&#30333;&#36825;&#19968;&#28857;&#30340;&#22993;&#23064;&#65292;&#26368;&#32456;&#20250;&#24378;&#22823;&#33258;&#24049;&#65292;&#19981;&#38656;&#35201;&#36825;&#26679;&#30340;&#30007;&#20154;&#65292;&#20294;&#26368;&#32456;&#20250;&#25214;&#21040;&#19968;&#20010;&#21516;&#26679;&#24378;&#22823;&#32780;&#24895;&#24847;&#20026;&#22905;&#20570;&#36825;&#26679;&#20107;&#30340;&#30007;&#20154;&#65292;&#21363;&#20351;&#22905;&#19981;&#38656;&#35201;&#12290;</p>
<p>&#36825;&#23601;&#26159;&#29983;&#27963;&#65292;&#24819;&#35201;&#30340;&#19981;&#20250;&#32473;&#24744;&#65292;&#24744;&#19981;&#38656;&#35201;&#20102;&#20063;&#23601;&#33021;&#24471;&#21040;&#20102;&#12290;&#22825;&#20043;&#36947;&#65292;&#25439;&#26377;&#20313;&#32780;&#34917;&#19981;&#36275;&#65307;&#20154;&#20043;&#36947;&#65292;&#25439;&#19981;&#36275;&#32780;&#22857;&#26377;&#20313;&#12290;</p>
</blockquote>
<hr />
<blockquote>
<p>&#32769;&#30007;&#20154;&#35848;&#24651;&#29233;&#26377;&#20004;&#31181;&#22871;&#36335;&#65292;&#19968;&#31181;&#26159;&#20828;&#20828;&#36716;&#36716;&#23601;&#26159;&#19981;&#29301;&#25163;&#65292;&#19968;&#31181;&#26159;&#19968;&#20999;&#37117;&#24456;&#32654;&#22909;&#31361;&#28982;&#26469;&#20010;&#25746;&#25163;&#12290;&#21069;&#32773;&#24120;&#34987;&#35823;&#35748;&#20026;&#26159;&#28195;&#30007;&#65292;&#21518;&#32773;&#30452;&#21040;&#25746;&#25163;&#20102;&#25165;&#21457;&#29616;&#26159;&#28195;&#30007;&#12290;</p>
</blockquote>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.zhihu.com/question/45150083/answer/119993802">&#29616;&#22312;&#26377;&#21738;&#20123;&#21487;&#20197;&#19981;&#29992;&#25163;&#26426;&#21495;&#23601;&#33021;&#27880;&#20876;&#30340;&#37038;&#31665;&#65311; - &#30693;&#20046;&#29992;&#25143;&#30340;&#22238;&#31572; - &#30693;&#20046;</a> <code class="fold">@</code></dt>
<dd><p>Gmail &#30340;&#30830;&#26159;&#19968;&#20010;&#24456;&#37325;&#22823;&#30340;&#21457;&#26126;&#65292;&#24320;&#21019;&#20102;&#20813;&#36153;&#37038;&#31665;&#26080;&#23481;&#37327;&#38480;&#21046;&#30340;&#26102;&#20195;&#65292;&#20294;&#22312;&#20170;&#22825;&#36825;&#20010;&#26102;&#20195;&#65292;&#20182;&#23436;&#20840;&#35828;&#19981;&#19978;&#26159;&#20160;&#20040;&#26368;&#20248;&#31168;&#26368;&#22909;&#29992;&#30340;&#19968;&#27454;&#37038;&#31665;&#26381;&#21153;&#12290;&#24403;&#28982;&#36825;&#31181;&#20107;&#24773;&#22823;&#23478;&#21508;&#26377;&#25152;&#22909;&#65292;&#20320;&#21916;&#27426;&#29992; Gmail &#25105;&#21916;&#27426;&#29992; Outlook &#26412;&#26469;&#37117;&#27809;&#26377;&#38169;&#12290;&#21482;&#26159;&#24456;&#22810;&#20154;&#35828;&#30340;&#22909;&#20687;&#27809;&#20102; Gmail &#23601;&#27809;&#26377;&#37038;&#31665;&#29992;&#20102;&#19968;&#26679;&#65292;&#30495;&#26159;&#22909;&#31505;&#65292;&#38500;&#20102;&#30699;&#24773;&#36824;&#33021;&#24590;&#20040;&#24418;&#23481;&#21602;&#65311;</p>
<p>&#26368;&#35752;&#21388;&#22312;&#30693;&#20046;&#19978;&#30475;&#35265;&#25991;&#23383;&#31895;&#37145;&#30340;&#22238;&#31572;&#65292;&#38590;&#36947;&#38750;&#35201;&#29992;&#36825;&#31181;&#35821;&#35328;&#25165;&#33021;&#34920;&#36798;&#20320;&#30340;&#24773;&#24863;&#21527;&#65311;</p>
<p>&#22914;&#20309;&#25913;&#21464;&#22823;&#33041;&#31070;&#32463;&#38142;&#25509;&#65292;&#26159;&#22797;&#26434;&#30340;&#12290;&#36825;&#20960;&#26412;&#20070;&#35201;&#35835;&#25026;&#65306;&#19982;&#31070;&#23545;&#35805;&#65292;&#19968;&#19975;&#23567;&#26102;&#22825;&#25165;&#29702;&#35770;&#65292;&#19975;&#19975;&#27809;&#24819;&#21040;&#65292;&#24433;&#21709;&#21147;&#65292;&#31934;&#23376;&#25112;&#20105;&#12290;&#27491;&#37034;&#20004;&#27966;&#37117;&#35201;&#26377;&#12290;</p>
<p>&#24456;&#22810;&#20154;&#20174;&#19981;&#35748;&#20026;&#33258;&#24049;&#29486;&#23194;&#65292;&#22823;&#22810;&#35273;&#24471;&#33258;&#24049;&#29420;&#31435;&#33258;&#20027;&#21448;&#29702;&#26234;&#65292;&#20294;&#24403;&#20182;&#20204;&#38754;&#23545;&#27604;&#33258;&#24049;&#26377;&#38065;&#65292;&#24069;&#27668;&#65292;&#28418;&#20142;&#30340;&#21516;&#24615;&#21644;&#24322;&#24615;&#65292;&#35328;&#35848;&#20030;&#27490;&#23601;&#20250;&#26292;&#38706;&#20986;&#37027;&#31181;&#24578;&#21644;&#29486;&#23194;&#65292;&#24076;&#26395;&#21560;&#24341;&#27604;&#33258;&#24049;&#26465;&#20214;&#26356;&#22909;&#30340;&#20154;&#27880;&#24847;&#12290;&#33258;&#21329;&#36825;&#31181;&#19996;&#35199;&#26080;&#35770;&#22914;&#20309;&#20063;&#25513;&#39280;&#19981;&#20303;&#12290;&#33021;&#20570;&#21040;&#22352;&#24576;&#19981;&#20081;&#30340;&#20154;&#65292;&#38656;&#35201;&#26377;&#30456;&#24403;&#30340;&#22478;&#24220;&#21644;&#24378;&#22823;&#30340;&#20869;&#24515;&#12290;&#24456;&#38590;&#65292;&#20294;&#20540;&#24471;&#27599;&#20010;&#20154;&#21435;&#30952;&#32451;&#21644;&#25913;&#21464;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://mp.weixin.qq.com/s?__biz=MzA5ODA0NDUyNA==&amp;mid=2650894154&amp;idx=1&amp;sn=fa129c27c3ccaf50d59054e5af9dd140&amp;chksm=8b625049bc15d95ff5e50404d340076b00d3a13eb8911b62d7363b54a1aac907f5dbeedf82ce&amp;mpshare=1&amp;scene=2&amp;srcid=1119iYB0QKRqHxxAmISwQae7&amp;from=timeline&amp;isappinstalled=0&amp;dt_ref=02B380E3F459AA448E530105625086E91195684E56F41F43B05736AA2FDB8736&amp;dt_dapp=1#wechat_redirect">&#27604;&#36215;&#20013;&#22269;&#36825;&#20214;&#37324;&#31243;&#30865;&#24335;&#30340;&#22823;&#20107;&#65292;&#29305;&#26391;&#26222;&#35201;&#20462;&#22260;&#22681;&#31616;&#30452;&#24369;&#29190;&#20102;&#65281;</a> <code class="fold">@</code></dt>
<dd><div class="figure">
<img src="http://whudoc.qiniudn.com/2016/guadaergang.jpg" />

</div>
<p>&#20170;&#24180; 9 &#26376;&#65292;&#29916;&#36798;&#23572;&#28207;&#33258;&#30001;&#21306;&#21551;&#21160;&#65292;&#23436;&#25104;&#20102;&#20174;&#32431;&#28207;&#21475;&#21521;&#24037;&#19994;&#22253;&#21306;&#30340;&#22823;&#34581;&#21464;&#65292;&#20013;&#22269;&#30340; 460 &#20159;&#32654;&#20803;&#25237;&#36164;&#25442;&#26469;&#20102;&#30005;&#21378;&#12289;&#27700;&#22365;&#21644;&#20844;&#36335;&#12289;&#38081;&#36335;&#31561;&#22522;&#30784;&#35774;&#26045;&#65292;&#30636;&#38388;&#35753;&#36825;&#20010;&#20102;&#26080;&#29983;&#27668;&#30340;&#22320;&#26041;&#21464;&#24471;&#26397;&#27668;&#34028;&#21187;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="http://cn.soulmachine.me/2016-08-13-my-deep-learning-workstation-assemble-process-note/" class="hearts">&#25105;&#30340;&#28145;&#24230;&#23398;&#20064;&#24037;&#20316;&#31449;&#25874;&#26426;&#36807;&#31243;&#35760;&#24405; | &#28789;&#39746;&#26426;&#22120;</a></p></li>
<li><dl>
<dt>Emojis from QQ history dir <code class="fold">@</code></dt>
<dd><p><img src="http://whudoc.qiniudn.com/2016/emoji/0x00a9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x00ae.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x18ce3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1c0e3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1c4e3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1c8e3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1cce3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1d0e3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1d4e3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1d8e3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1dce3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1e0e3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1e4e3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f004.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f0cf.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f170.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f171.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f17e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f17f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f18e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f191.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f192.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f193.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f194.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f195.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f196.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f197.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f198.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f199.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f19a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1e8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1e9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1eb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1ee.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1f1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1f6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e60x1f1ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1e7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1e9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1eb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1ed.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1ee.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1ef.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1f1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1f6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e70x1f1ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1e8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1e9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1eb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1ed.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1ee.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1f1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1f5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e80x1f1ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e81f1f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e90x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e90x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e90x1f1ef.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e90x1f1f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e90x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e90x1f1f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e90x1f1ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1e91f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ea0x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ea0x1f1e8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ea0x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ea0x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ea0x1f1ed.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ea0x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ea0x1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ea0x1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ea0x1f1fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ea1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1eb0x1f1ee.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1eb0x1f1ef.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1eb0x1f1f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1eb0x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1eb0x1f1f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1eb0x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1eb1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1e7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1e9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1eb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1ed.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1ee.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1f1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1f5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1f6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec0x1f1fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ec1f1e7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ed0x1f1f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ed0x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ed0x1f1f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ed0x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ed0x1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ed0x1f1fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ee0x1f1e8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ee0x1f1e9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ee0x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ee0x1f1f1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ee0x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ee0x1f1f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ee0x1f1f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ee0x1f1f6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ee0x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ee0x1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ee0x1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ee1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ef0x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ef0x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ef0x1f1f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ef0x1f1f5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ef1f1f5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f00x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f00x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f00x1f1ed.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f00x1f1ee.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f00x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f00x1f1f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f00x1f1f5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f00x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f00x1f1fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f00x1f1fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f00x1f1ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f01f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f10x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f10x1f1e7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f10x1f1e8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f10x1f1ee.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f10x1f1f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f10x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f10x1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f10x1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f10x1f1fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f10x1f1fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f10x1f1fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1e8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1e9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1eb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1ed.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1f1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1f5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1f6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f20x1f1ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f30x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f30x1f1e8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f30x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f30x1f1eb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f30x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f30x1f1ee.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f30x1f1f1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f30x1f1f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f30x1f1f5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f30x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f30x1f1fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f30x1f1ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f40x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1eb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1ed.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1f1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f50x1f1fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f60x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f70x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f70x1f1f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f70x1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f70x1f1fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f70x1f1fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f71f1fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1e7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1e8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1e9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1ed.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1ee.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1ef.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1f1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f80x1f1ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1e8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1e9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1eb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1ed.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1ef.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1f1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1f90x1f1ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fa0x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fa0x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fa0x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fa0x1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fa0x1f1fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fa0x1f1ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fa1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fb0x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fb0x1f1e8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fb0x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fb0x1f1ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fb0x1f1ee.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fb0x1f1f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fb0x1f1fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fc0x1f1eb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fc0x1f1f8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fd0x1f1f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fe0x1f1ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1fe0x1f1f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ff0x1f1e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ff0x1f1f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f1ff0x1f1fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f201.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f202.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f21a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f22f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f232.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f233.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f234.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f235.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f236.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f237.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f238.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f239.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f23a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f250.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f251.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f300.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f301.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f302.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f303.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f304.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f305.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f306.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f307.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f308.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f309.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f30a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f30b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f30c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f30d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f30e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f30f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f310.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f311.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f312.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f313.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f314.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f315.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f316.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f317.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f318.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f319.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f31a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f31b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f31c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f31d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f31e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f31f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f320.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f330.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f331.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f332.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f333.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f334.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f335.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f337.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f338.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f339.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f33a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f33b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f33c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f33d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f33e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f33f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f340.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f341.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f342.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f343.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f344.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f345.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f346.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f347.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f348.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f349.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f34a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f34b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f34c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f34d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f34e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f34f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f350.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f351.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f352.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f353.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f354.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f355.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f356.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f357.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f358.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f359.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f35a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f35b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f35c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f35d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f35e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f35f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f360.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f361.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f362.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f363.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f364.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f365.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f366.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f367.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f368.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f369.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f36a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f36b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f36c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f36d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f36e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f36f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f370.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f371.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f372.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f373.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f374.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f375.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f376.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f377.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f378.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f379.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f37a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f37b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f37c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f380.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f381.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f382.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f383.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f384.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f385.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3850x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3850x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3850x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3850x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3850x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f386.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f387.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f388.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f389.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f38a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f38b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f38c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f38d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f38e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f38f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f390.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f391.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f392.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f393.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3a0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3a1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3a2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3a3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3a4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3a5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3a6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3a7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3a8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3a9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3aa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ab.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ac.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ad.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ae.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3af.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3b0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3b1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3b2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3b3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3b4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3b5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3b6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3b7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3b8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3b9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ba.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3bb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3bc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3bd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3be.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3bf.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c30x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c30x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c30x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c30x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c30x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c40x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c40x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c40x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c40x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c40x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3c9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ca.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ca0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ca0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ca0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ca0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ca0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3cb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3cb0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3cb0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3cb0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3cb0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3cb0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3e0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3e1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3e2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3e3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3e4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3e5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3e7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3e8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3e9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3eb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ed.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ee.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ef.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f400.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f401.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f402.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f403.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f404.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f405.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f406.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f407.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f408.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f409.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f40a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f40b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f40c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f40d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f40e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f40f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f410.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f411.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f412.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f413.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f414.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f415.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f416.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f417.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f418.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f419.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f41a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f41b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f41c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f41d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f41e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f41f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f420.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f421.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f422.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f423.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f424.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f425.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f426.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f427.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f428.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f429.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f42a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f42b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f42c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f42d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f42e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f42f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f430.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f431.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f432.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f433.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f434.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f435.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f436.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f437.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f438.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f439.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f43a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f43b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f43c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f43d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f43e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f440.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f442.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4420x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4420x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4420x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4420x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4420x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f443.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4430x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4430x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4430x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4430x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4430x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f444.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f445.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f446.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4460x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4460x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4460x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4460x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4460x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f447.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4470x1f3fB.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4470x1f3fC.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4470x1f3fD.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4470x1f3fE.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4470x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f448.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4480x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4480x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4480x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4480x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4480x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f449.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4490x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4490x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4490x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4490x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4490x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44a0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44a0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44a0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44a0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44a0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44b0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44b0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44b0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44b0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44b0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44c0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44c0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44c0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44c0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44c0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44d0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44d0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44d0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44d0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44d0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44e0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44e0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44e0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44e0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44e0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44f0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44f0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44f0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44f0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f44f0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f450.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4500x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4500x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4500x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4500x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4500x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f451.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f452.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f453.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f454.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f455.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f456.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f457.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f458.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f459.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f45a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f45b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f45c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f45d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f45e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f45f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f460.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f461.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f462.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f463.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f464.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f465.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f466.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4660x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4660x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4660x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4660x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4660x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f467.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4670x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4670x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4670x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4670x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4670x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f468.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4680x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4680x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4680x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4680x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4680x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f469.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4690x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4690x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4690x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4690x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4690x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f46a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f46b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f46c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f46d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f46e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f46e0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f46e0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f46e0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f46e0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f46e0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f46f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f470.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4700x1f3fB.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4700x1f3fC.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4700x1f3fD.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4700x1f3fE.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4700x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f471.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4710x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4710x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4710x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4710x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4710x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f472.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4720x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4720x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4720x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4720x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4720x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f473.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4730x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4730x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4730x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4730x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4730x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f474.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4740x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4740x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4740x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4740x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4740x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f475.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4750x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4750x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4750x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4750x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4750x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f476.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4760x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4760x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4760x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4760x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4760x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f477.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4770x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4770x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4770x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4770x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4770x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f478.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4780x1f3fB.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4780x1f3fC.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4780x1f3fD.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4780x1f3fE.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4780x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f479.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f47a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f47b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f47c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f47c0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f47c0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f47c0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f47c0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f47c0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f47d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f47e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f47f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f480.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f481.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4810x1f3fB.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4810x1f3fC.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4810x1f3fD.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4810x1f3fE.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4810x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f482.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4820x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4820x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4820x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4820x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4820x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f483.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4830x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4830x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4830x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4830x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4830x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f484.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f485.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4850x1f3fB.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4850x1f3fC.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4850x1f3fD.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4850x1f3fE.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4850x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f486.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4860x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4860x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4860x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4860x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4860x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f487.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4870x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4870x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4870x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4870x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4870x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f488.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f489.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f48a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f48b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f48c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f48d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f48e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f48f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f490.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f491.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f492.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f493.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f494.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f495.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f496.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f497.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f498.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f499.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f49a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f49b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f49c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f49d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f49e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f49f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4a0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4a1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4a2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4a3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4a4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4a5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4a6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4a7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4a8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4a9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4aa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4aa0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4aa0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4aa0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4aa0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4aa0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4ab.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4ac.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4ad.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4ae.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4af.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4b0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4b1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4b2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4b3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4b4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4b5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4b6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4b7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4b8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4b9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4ba.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4bb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4bc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4bd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4be.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4bf.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4c0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4c1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4c2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4c3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4c4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4c5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4c6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4c7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4c8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4c9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4ca.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4cb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4cc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4cd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4ce.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4cf.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4d0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4d1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4d2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4d3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4d4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4d5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4d6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4d7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4d8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4d9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4da.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4db.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4dc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4dd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4de.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4df.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4e0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4e1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4e2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4e3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4e4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4e5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4e6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4e7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4e8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4e9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4eb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4ed.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4ee.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4ef.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4f1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4f4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4f5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4f6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4f7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f4fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f500.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f501.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f502.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f503.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f504.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f505.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f506.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f507.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f508.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f509.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f50a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f50b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f50c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f50d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f50e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f50f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f510.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f511.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f512.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f513.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f514.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f515.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f516.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f517.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f518.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f519.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f51a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f51b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f51c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f51d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f51e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f51f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f520.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f521.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f522.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f523.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f524.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f525.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f526.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f527.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f528.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f529.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f52a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f52b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f52c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f52d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f52e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f52f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f530.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f531.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f532.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f533.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f534.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f535.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f536.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f537.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f538.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f539.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f53a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f53b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f53c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f53d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f550.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f551.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f552.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f553.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f554.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f555.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f556.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f557.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f558.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f559.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f55a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f55b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f55c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f55d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f55e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f55f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f560.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f561.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f562.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f563.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f564.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f565.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f566.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f567.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f575.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f590.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5900x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5900x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5900x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5900x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5900x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f595.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5950x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5950x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5950x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5950x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5950x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f596.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5960x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5960x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5960x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5960x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5960x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f5ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f600.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f601.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f602.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f603.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f604.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f605.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f606.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f607.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f608.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f609.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f60a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f60b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f60c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f60d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f60e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f60f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f610.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f611.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f612.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f613.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f614.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f615.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f616.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f617.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f618.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f619.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f61a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f61b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f61c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f61d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f61e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f61f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f620.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f621.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f622.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f623.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f624.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f625.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f626.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f627.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f628.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f629.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f62a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f62b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f62c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f62d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f62e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f62f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f630.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f631.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f632.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f633.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f634.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f635.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f636.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f637.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f638.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f639.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f63a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f63b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f63c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f63d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f63e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f63f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f640.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f645.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6450x1f3fB.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6450x1f3fC.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6450x1f3fD.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6450x1f3fE.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6450x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f646.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6460x1f3fB.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6460x1f3fC.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6460x1f3fD.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6460x1f3fE.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6460x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f647.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6470x1f3fB.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6470x1f3fC.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6470x1f3fD.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6470x1f3fE.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6470x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f648.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f649.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64B0x1f3fB.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64B0x1f3fC.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64B0x1f3fD.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64B0x1f3fE.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64B0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64c0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64c0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64c0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64c0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64c0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64d0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64d0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64d0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64d0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64d0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64e0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64e0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64e0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64e0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64e0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64f0x1f3fB.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64f0x1f3fC.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64f0x1f3fD.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64f0x1f3fE.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f64f0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f680.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f681.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f682.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f683.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f684.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f685.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f686.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f687.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f688.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f689.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f68a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f68b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f68c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f68d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f68e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f68f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f690.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f691.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f692.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f693.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f694.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f695.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f696.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f697.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f698.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f699.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f69a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f69b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f69c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f69d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f69e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f69f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a30x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a30x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a30x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a30x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a30x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6a9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6aa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6ab.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6ac.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6ad.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6ae.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6af.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b40x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b40x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b40x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b40x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b40x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b50x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b50x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b50x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b50x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b50x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b60x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b60x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b60x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b60x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b60x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b7.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b8.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6b9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6ba.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6bb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6bc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6bd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6be.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6bf.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6c0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6c00x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6c00x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6c00x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6c00x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6c00x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6c1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6c2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6c3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6c4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f6c5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f918.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f9180x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f9180x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f9180x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f9180x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x1f9180x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x203c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2049.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2122.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2139.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2194.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2195.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2196.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2197.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2198.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2199.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x21a9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x21aa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x231a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x231b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x23e9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x23ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x23eb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x23ec.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x23f0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x23f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x24c2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x25aa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x25ab.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x25b6.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x25c0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x25fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x25fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x25fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x25fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2600.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2601.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x260e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2611.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2614.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2615.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x261d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x261d0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x261d0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x261d0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x261d0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x261d0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x263a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2648.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2649.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x264a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x264b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x264c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x264d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x264e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x264f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2650.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2651.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2652.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2653.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2660.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2663.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2665.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2666.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2668.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x267b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x267f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2693.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26a0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26a1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26aa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26ab.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26bd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26be.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26c4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26c5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26ce.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26d4.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26ea.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26f2.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26f3.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26f5.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26f9.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26f90x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26f90x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26f90x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26f90x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26f90x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26fa.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x26fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2702.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2705.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2708.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2709.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270a0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270a0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270a0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270a0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270a0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270b0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270b0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270b0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270b0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270b0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270c0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270c0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270c0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270c0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270c0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270d0x1f3fb.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270d0x1f3fc.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270d0x1f3fd.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270d0x1f3fe.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270d0x1f3ff.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x270f.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2712.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2714.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2716.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2728.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2733.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2734.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2744.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2747.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x274c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x274e.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2753.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2754.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2755.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2757.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2764.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2795.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2796.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2797.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x27a1.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x27b0.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x27bf.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2934.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2935.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2b05.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2b06.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2b07.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2b1b.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2b1c.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2b50.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x2b55.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x3030.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x303d.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x3297.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0x3299.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/0xe50a.png" /> <img src="http://whudoc.qiniudn.com/2016/emoji/emoji_021.png" /></p>
</dd>
</dl></li>
<li><p><a href="https://www.zhihu.com/topic/19811373/top-answers?page=2">&#32440;&#29260;&#23627;&#65288;House of Cards&#65289; - &#35805;&#39064;&#31934;&#21326; - &#30693;&#20046;</a></p>
<dl>
<dt>My English <code class="fold">@</code></dt>
<dd><ul>
<li>&#39640;&#32771;&#65306;88.7</li>
<li>&#22235;&#32423;&#65306;87.3</li>
<li>&#20845;&#32423;&#65306;70.1</li>
</ul>
</dd>
</dl></li>
<li><p><a href="https://zm8.sm-tc.cn/?src=http%3A%2F%2Fwww.chinanews.com%2Fcj%2Fkong%2Fnews%2F2008%2F04-11%2F1218367.shtml&amp;uid=2bacf658f69ee51311b37a62abcf0e25&amp;hid=fc573d784e8f906db53ed878b6a09e33&amp;pos=1&amp;cid=9&amp;time=1479551718667&amp;from=click&amp;restype=1&amp;pagetype=0000000000008402&amp;bu=structure_web_info&amp;query=%E5%88%98%E5%BF%97%E5%86%9B%E8%AF%95%E8%BD%A6&amp;mode=&amp;uc_param_str=dnntnwvepffrgibijbprsvdsei">&#39318;&#21015;&#20013;&#22269;&#36896;&#26368;&#39640;&#36895;&#21160;&#36710;&#32452;&#19979;&#32447; &#38081;&#36947;&#37096;&#38271;&#20146;&#39550;&#35797;&#36710;</a></p></li>
<li><dl>
<dt><a href="https://manage.conoha.jp/Dashboard">ConoHa&#25511;&#21046;&#38754;&#26495;</a> <code class="fold">@</code></dt>
<dd><p><code class="sourceCode bash"><span class="kw">ssh</span> root@133.130.124.160</code></p>
</dd>
<dt>&#38463;&#30007; <code class="fold">@</code></dt>
<dd><p><a href="https://www.douban.com/note/586107928/">&#12302;&#38463;&#30007;&#38386;&#32842;&#12303;&#38463;&#30007;&#30340;&#25237;&#36164;&#35266;&#65288;&#19978;&#65289;</a></p>
<p><a href="https://www.douban.com/note/586219658/">&#12302;&#38463;&#30007;&#38386;&#32842;&#12303;&#38463;&#30007;&#30340;&#25237;&#36164;&#35266;&#65288;&#19979;&#65289;</a></p>
<dl>
<dt><a href="https://www.douban.com/note/590984170/">&#12302;&#38463;&#30007;&#38386;&#32842;&#12303;&#65290;&#23398;&#36825;&#20010;&#19996;&#35199;&#65292;&#21040;&#24213;&#26377;&#20160;&#20040;&#29992;&#65311;&#65290;</a> <code class="fold">@</code></dt>
<dd><p>&#25152;&#20197;&#20197;&#21518;&#24403;&#20320;&#34987;&#38382;&#21040;&#65292;&#8220;&#23398;&#20064;&#36825;&#20010;&#19996;&#35199;&#26377;&#20160;&#20040;&#29992;&#65311;&#8221;&#65292;&#36825;&#31181;&#38382;&#39064;&#26102;&#65292;&#21487;&#20197;&#24494;&#31505;&#30528;&#35828;&#65306;&#8220;&#25105;&#21487;&#20197;&#22238;&#31572;&#36825;&#20010;&#38382;&#39064;&#65292;&#20320;&#26377;10&#20998;&#38047;&#26102;&#38388;&#32784;&#24515;&#21548;&#21527;&#65311;&#8221;</p>
</dd>
<dt><a href="https://www.douban.com/note/590636369/">&#12302;&#20851;&#20110;&#32534;&#31243;&#36825;&#20214;&#20107;&#65292;&#38463;&#30007;&#24819;&#25512;&#33616;&#30340;&#19968;&#20123;&#22909;&#20070;&#12303;&#65290;&#23398;&#20064;&#27719;&#32534;&#35821;&#35328;&#26159;&#19975;&#37324;&#20043;&#34892;&#31532;&#19968;&#27493;&#65290;</a></dt>
<dd><p>&#27719;&#32534;&#21644;&#30828;&#20214;&#20197;&#21450;&#25805;&#20316;&#31995;&#32479;&#30340;&#32806;&#21512;&#24615;&#12290;</p>
<p>&#27719;&#32534;&#35821;&#35328;&#22240;&#20026;&#23601;&#26159;&#26426;&#22120;&#30452;&#25509;&#25191;&#34892;&#30340;&#26426;&#22120;&#30721;&#30340;&#19968;&#20010;&#31616;&#21333;&#26144;&#23556;&#65292;&#25152;&#20197;&#24517;&#28982;&#21644;&#20855;&#20307;&#30340;&#35745;&#31639;&#26426;&#30340;&#25152;&#26377;&#32454;&#33410;&#37117;&#26377;&#24456;&#24378;&#30340;&#30456;&#20851;&#24615;&#12290;</p>
</dd>
</dl>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://www.howtogeek.com/207887/how-to-use-vertical-tree-style-tabs-in-your-web-browser/" class="hearts">How (and Why) to Use Vertical, Tree Style Tabs in Your Web Browser</a> <code class="fold">@</code></dt>
<dd><p>FireFox: <a href="https://addons.mozilla.org/en-US/firefox/addon/tree-style-tab/">Tree Style Tab :: Add-ons for Firefox</a></p>
<p>Chrome: <a href="https://chrome.google.com/webstore/detail/tabs-outliner/eggkanocgddhmamlbiijnphhppkpkmkl?hl=en">Tabs Outliner</a></p>
<p>the dev: <a href="http://piro.sakura.ne.jp/xul/_treestyletab.html">XUL Apps &gt; Tree Style Tab - outsider reflex</a></p>
</dd>
<dt>Youtube video downloader <code class="fold">@</code></dt>
<dd><p><a href="http://www.clipconverter.cc" class="uri">http://www.clipconverter.cc</a></p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://github.com/liuchengxu/git-commit-emoji-cn/blob/master/README.md">git-commit-emoji-cn/README.md at master &#183; liuchengxu/git-commit-emoji-cn &#183; GitHub</a> <code class="fold">@</code></dt>
<dd><h1 id="git-commit-emoji-&#20351;&#29992;&#25351;&#21335;">git commit emoji &#20351;&#29992;&#25351;&#21335;</h1>
<h3 id="commit-&#26684;&#24335;">commit &#26684;&#24335;</h3>
<p>git commit &#26102;&#65292;&#25552;&#20132;&#20449;&#24687;&#36981;&#24490;&#20197;&#19979;&#26684;&#24335;&#65306;</p>
<pre><code>:emoji1: :emoji2: &#20027;&#39064;

&#25552;&#20132;&#20449;&#24687;&#20027;&#20307;

Ref &lt;###&gt;</code></pre>
<p>&#21021;&#27425;&#25552;&#20132;&#31034;&#20363;&#65306;</p>
<pre><code>git commit -m &quot;:tada: Initialize Repo&quot;</code></pre>
<h3 id="emoji-&#25351;&#21335;">emoji &#25351;&#21335;</h3>
<table>
<thead>
<tr class="header">
<th align="left">emoji</th>
<th align="left">emoji &#20195;&#30721;</th>
<th align="left">commit &#35828;&#26126;</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td align="left">&#127912; (&#35843;&#33394;&#26495;)</td>
<td align="left"><code>:art:</code></td>
<td align="left">&#25913;&#36827;&#20195;&#30721;&#32467;&#26500;/&#20195;&#30721;&#26684;&#24335;</td>
</tr>
<tr class="even">
<td align="left">&#9889; (&#38378;&#30005;)</td>
<td align="left"><code>:zap:</code></td>
<td align="left">&#25552;&#39640;&#24615;&#33021;</td>
</tr>
<tr class="odd">
<td align="left">&#128293; (&#28779;&#28976;)</td>
<td align="left"><code>:fire:</code></td>
<td align="left">&#31227;&#38500;&#20195;&#30721;&#25110;&#25991;&#20214;</td>
</tr>
<tr class="even">
<td align="left">&#128027; (bug)</td>
<td align="left"><code>:bug:</code></td>
<td align="left">&#20462;&#22797; bug</td>
</tr>
<tr class="odd">
<td align="left">&#128657; (&#24613;&#25937;&#36710;)</td>
<td align="left"><code>:ambulance:</code></td>
<td align="left">&#37325;&#35201;&#34917;&#19969;</td>
</tr>
<tr class="even">
<td align="left">&#10024; (&#28779;&#33457;)</td>
<td align="left"><code>:sparkles:</code></td>
<td align="left">&#24341;&#20837;&#26032;&#21151;&#33021;</td>
</tr>
<tr class="odd">
<td align="left">&#128221; (&#22791;&#24536;&#24405;)</td>
<td align="left"><code>:memo:</code></td>
<td align="left">&#25776;&#20889;&#25991;&#26723;</td>
</tr>
<tr class="even">
<td align="left">&#128640; (&#28779;&#31661;)</td>
<td align="left"><code>:rocket:</code></td>
<td align="left">&#37096;&#32626;&#21151;&#33021;</td>
</tr>
<tr class="odd">
<td align="left">&#128132; (&#21475;&#32418;)</td>
<td align="left"><code>:lipstick:</code></td>
<td align="left">&#26356;&#26032; UI &#21644;&#26679;&#24335;&#25991;&#20214;</td>
</tr>
<tr class="even">
<td align="left">&#127881; (&#24198;&#31069;)</td>
<td align="left"><code>:tada:</code></td>
<td align="left">&#21021;&#27425;&#25552;&#20132;</td>
</tr>
<tr class="odd">
<td align="left">&#9989; (&#30333;&#33394;&#22797;&#36873;&#26694;)</td>
<td align="left"><code>:white_check_mark:</code></td>
<td align="left">&#22686;&#21152;&#27979;&#35797;</td>
</tr>
<tr class="even">
<td align="left">&#128274; (&#38145;)</td>
<td align="left"><code>:lock:</code></td>
<td align="left">&#20462;&#22797;&#23433;&#20840;&#38382;&#39064;</td>
</tr>
<tr class="odd">
<td align="left">&#127822; (&#33529;&#26524;)</td>
<td align="left"><code>:apple:</code></td>
<td align="left">&#20462;&#22797; macOS &#19979;&#30340;&#38382;&#39064;</td>
</tr>
<tr class="even">
<td align="left">&#128039; (&#20225;&#40517;)</td>
<td align="left"><code>:penguin:</code></td>
<td align="left">&#20462;&#22797; Linux &#19979;&#30340;&#38382;&#39064;</td>
</tr>
<tr class="odd">
<td align="left">&#127937; (&#26071;&#24092;)</td>
<td align="left"><code>:checked_flag:</code></td>
<td align="left">&#20462;&#22797; Windows &#19979;&#30340;&#38382;&#39064;</td>
</tr>
<tr class="even">
<td align="left">&#128278; (&#20070;&#31614;)</td>
<td align="left"><code>:bookmark:</code></td>
<td align="left">&#21457;&#34892;/&#29256;&#26412;&#26631;&#31614;</td>
</tr>
<tr class="odd">
<td align="left">&#128680; (&#35686;&#36710;&#28783;)</td>
<td align="left"><code>:rotating_light:</code></td>
<td align="left">&#31227;&#38500; linter &#35686;&#21578;</td>
</tr>
<tr class="even">
<td align="left">&#128679; (&#26045;&#24037;)</td>
<td align="left"><code>construction</code></td>
<td align="left">&#24037;&#20316;&#36827;&#34892;&#20013;</td>
</tr>
<tr class="odd">
<td align="left">&#128154; (&#32511;&#24515;)</td>
<td align="left"><code>:green_heart:</code></td>
<td align="left">&#20462;&#22797; CI &#26500;&#24314;&#38382;&#39064;</td>
</tr>
<tr class="even">
<td align="left">&#11015;&#65039; (&#19979;&#38477;&#31661;&#22836;)</td>
<td align="left"><code>:arrow_down:</code></td>
<td align="left">&#38477;&#32423;&#20381;&#36182;</td>
</tr>
<tr class="odd">
<td align="left">&#11014;&#65039; (&#19978;&#21319;&#31661;&#22836;)</td>
<td align="left"><code>:arrow_up:</code></td>
<td align="left">&#21319;&#32423;&#20381;&#36182;</td>
</tr>
<tr class="even">
<td align="left">&#128119; (&#24037;&#20154;)</td>
<td align="left"><code>:construction_worker:</code></td>
<td align="left">&#28155;&#21152; CI &#26500;&#24314;&#31995;&#32479;</td>
</tr>
<tr class="odd">
<td align="left">&#128200; (&#19978;&#21319;&#36235;&#21183;&#22270;)</td>
<td align="left"><code>:chart_with_upwards_trend:</code></td>
<td align="left">&#28155;&#21152;&#20998;&#26512;&#25110;&#36319;&#36394;&#20195;&#30721;</td>
</tr>
<tr class="even">
<td align="left">&#128296; (&#38180;&#23376;)</td>
<td align="left"><code>:hammer:</code></td>
<td align="left">&#37325;&#22823;&#37325;&#26500;</td>
</tr>
<tr class="odd">
<td align="left">&#10134; (&#20943;&#21495;)</td>
<td align="left"><code>:heavy_minus_sign:</code></td>
<td align="left">&#20943;&#23569;&#19968;&#20010;&#20381;&#36182;</td>
</tr>
<tr class="even">
<td align="left">&#128051; (&#40120;&#40060;)</td>
<td align="left"><code>:whale:</code></td>
<td align="left">Docker &#30456;&#20851;&#24037;&#20316;</td>
</tr>
<tr class="odd">
<td align="left">&#10133; (&#21152;&#21495;)</td>
<td align="left"><code>:heavy_plug_sign:</code></td>
<td align="left">&#22686;&#21152;&#19968;&#20010;&#20381;&#36182;</td>
</tr>
<tr class="even">
<td align="left">&#128295; (&#25203;&#25163;)</td>
<td align="left"><code>:wrench:</code></td>
<td align="left">&#20462;&#25913;&#37197;&#32622;&#25991;&#20214;</td>
</tr>
<tr class="odd">
<td align="left">&#127760; (&#22320;&#29699;)</td>
<td align="left"><code>:globe_with_meridians:</code></td>
<td align="left">&#22269;&#38469;&#21270;&#19982;&#26412;&#22320;&#21270;</td>
</tr>
<tr class="even">
<td align="left">&#9999;&#65039; (&#38085;&#31508;)</td>
<td align="left"><code>:pencil2:</code></td>
<td align="left">&#20462;&#22797; typo</td>
</tr>
</tbody>
</table>
<h3 id="&#21442;&#32771;">&#21442;&#32771;</h3>
<ul>
<li><a href="https://github.com/carloscuesta/gitmoji/">gitmoji</a></li>
<li><a href="https://gitmoji.carloscuesta.me/">An emoji guide for your commit messages</a></li>
<li><a href="https://github.com/slashsBin/styleguide-git-commit-message">styleguide-git-commit-message</a></li>
</ul>
</dd>
</dl></li>
<li><p><a href="https://www.linuxbabe.com/desktop-linux/how-to-install-and-use-shadowsocks-command-line-client">Install And Use Shadowsocks Command Line Client on Linux - LinuxBabe.Com</a></p></li>
<li><p><a href="http://www.tuicool.com/articles/jUnMJjM">Linux&#19979;&#37197;&#32622;ShadowSocks(Server&amp;Client) - &#25512;&#37239;</a></p></li>
<li><p><a href="http://www.citigroup.com/citi/news/2012/121123a.htm">Citibank Launches First Smart Banking Branch in the Philippines</a></p></li>
<li><p><a href="https://xuri.me/2014/08/14/shadowsocks-setup-guide.html">ShadowSocks Setup Guide | Ri Xu Online</a></p></li>
<li><dl>
<dt><a href="https://zhidao.baidu.com/question/239560090808183044.html">&#20026;&#20160;&#20040;&#35201;&#29992;&#20820;&#23376;&#20195;&#34920;&#20013;&#22269;_&#30334;&#24230;&#30693;&#36947;</a> <code class="fold">@</code></dt>
<dd><p>&#35831;&#21442;&#32771;&#28246;&#21335;&#21475;&#38899;&#65306;&#12300;&#20820;&#23376;&#20204;&#65292;&#34430;&#31859;&#20204;&#65292;&#29482;&#23614;&#24052;&#65281;&#19981;&#35201;&#37233;&#29916;&#65292;&#21688;&#33756;&#22826;&#36149;&#21862;&#65281;&#65281;&#12301; (&#32763;&#35793;&#65306;&#21516;&#24535;&#20204;&#65292;&#20065;&#27665;&#20204;&#65292;&#27880;&#24847;&#21543;&#65281;&#19981;&#35201;&#35762;&#35805;&#65292;&#29616;&#22312;&#24320;&#20250;&#21862;&#65281;&#65281;) &#8212;&#8212;&#21439;&#38271;&#35762;&#23436;&#20197;&#21518;&#65292;&#20027;&#25345;&#20154;&#35828;&#65306;&#12300;&#21688;&#33756;&#35831;&#39321;&#32928;&#37233;&#29916;&#65281;&#12301; &#65288;&#32763;&#35793;&#65306;&#29616;&#22312;&#35831;&#20065;&#38271;&#35762;&#35805;&#65281;&#65289;&#12298;&#37027;&#20820;&#12299;&#37324;&#38754;&#26368;&#24320;&#22987;&#31216;&#20849;&#20135;&#20826;&#20026;&#20820;&#23376;&#65292;&#20063;&#26159;&#22240;&#20026;&#27611;&#29239;&#29239;&#28246;&#21335;&#21475;&#38899;&#65306;&#21516;&#24535;&#20204;~~&#65288;&#35856;&#38899;&#21548;&#36215;&#26469;&#20687;&#20820;&#23376;&#20204;&#65292;&#20026;&#20102;&#35753;&#28459;&#30011;&#26356;&#22909;&#25509;&#21463;&#26377;&#24847;&#24605;&#23601;&#30452;&#25509;&#25311;&#20026;&#20820;&#23376;&#65289;&#24403;&#26102;&#30340;&#26102;&#20195;&#37117;&#26159;&#38761;&#21629;&#21516;&#24535;&#30340;&#21451;&#35850;&#65292;&#22362;&#19981;&#21487;&#25703;&#12290;&#20854;&#20182;&#30340;&#35828;&#20013;&#22269;&#27604;&#21947;&#25104;&#20820;&#23376;&#26159;&#22240;&#20026;&#20820;&#23376;&#36825;&#20010;&#29289;&#31181;&#30340;&#29305;&#24615;&#21644;&#20013;&#22269;&#20687;&#20160;&#20040;&#30340;&#65292;&#25105;&#26159;&#19981;&#35748;&#21516;&#30340;&#12290;</p>
<p>&#21442;&#35265;&#28459;&#30011;&#12298;&#37027;&#24180;&#37027;&#20820;&#37027;&#20123;&#20107;&#12299;&#65292;&#20854;&#20013;&#20013;&#22269;&#23601;&#34987;&#25311;&#20154;&#25104;&#20820;&#23376;&#65292;&#32780;&#32654;&#22269;&#23601;&#34987;&#25311;&#20154;&#25104;&#30333;&#22836;&#40560;&#12290;&#33267;&#20110;&#20026;&#20160;&#20040;&#19968;&#23450;&#35201;&#25311;&#20154;&#25104;&#20820;&#23376;&#65292;&#37027;&#26159;&#22240;&#20026;&#20820;&#23376;&#26377;&#19968;&#25307;&#21483;&#20570;&#8221;&#20820;&#23376;&#36460;&#40560;&#8220;&#65292;&#19987;&#23545;&#20184;&#32769;&#40560;&#65292;&#32780;&#40560;&#26159;&#32654;&#22269;&#30340;&#22270;&#33150;&#65292;&#32467;&#26524;&#23601;&#26174;&#32780;&#26131;&#35265;&#20102;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://news.ifeng.com/opinion/shouxipinglunyuan027/1.shtml">&#39318;&#24109;&#35780;&#35770;&#21592;&#20008;&#26519;&#36798;&#65306;&#24029;&#26222;&#19978;&#21488;&#65292;&#37027;&#22836;&#22823;&#35937;&#32456;&#20110;&#36305;&#20986;&#26469;&#20102;</a> <code class="fold">@</code></dt>
<dd><ul>
<li>&#26681;&#25454;&#32654;&#32852;&#31038;&#21644; BORC &#20844;&#20849;&#20107;&#21153;&#30740;&#31350;&#20013;&#24515;&#22312;&#20170;&#24180;&#20116;&#26376;&#30340;&#35843;&#26597;&#65292;&#26377;&#23558;&#36817;&#19977;&#20998;&#20043;&#20108;&#30340;&#32654;&#22269;&#20154;&#25343;&#19981;&#20986;&#19968;&#21315;&#32654;&#20803;&#24212;&#24613;&#12290;&#26681;&#25454;&#32852;&#20934;&#20250;&#21435;&#24180;&#30340;&#35843;&#26597;&#65292;47% &#30340;&#32654;&#22269;&#20154;&#29978;&#33267;&#25343;&#19981;&#20986;&#22235;&#30334;&#32654;&#20803;&#24212;&#24613;&#12290;</li>
<li>&#22885;&#24052;&#39532;&#30340;&#21307;&#25913;&#27861;&#26696;&#65292;&#31435;&#27861;&#32773;&#37117;&#27809;&#35835;&#23436;</li>
<li>&#21407;&#26469;&#20225;&#19994;&#34917;&#36148;&#21592;&#24037;&#30340;&#21307;&#20445;&#36153;&#29992;&#65292;&#25171;&#22312;&#31246;&#21069;&#24320;&#25903;&#37324;&#65292;&#32467;&#26524;&#22885;&#24052;&#39532;&#21307;&#25913;&#35268;&#23450;&#35201;&#25918;&#22312;&#31246;&#21518;&#12290;&#36825;&#26679;&#65292;&#22823;&#20225;&#19994;&#23601;&#21464;&#24471;&#26080;&#27861;&#25215;&#21463;&#65292;&#21482;&#33021;&#20943;&#23569;&#31119;&#21033;&#65292;&#35201;&#27714;&#38599;&#21592;&#20998;&#25285;&#12290;&#31119;&#21033;&#36825;&#20010;&#19996;&#35199;&#65292;&#37117;&#26159;&#8220;&#19978;&#21435;&#36731;&#36731;&#26494;&#26494;&#65292;&#19979;&#26469;&#35201;&#20986;&#20154;&#21629;&#8221;&#12290;&#20320;&#30475;&#30475;&#27861;&#22269;&#65292;&#20026;&#20102;&#19968;&#20010;&#31435;&#27861;&#65306;&#20196;&#20225;&#19994;&#26356;&#23481;&#26131;&#25226;&#24037;&#20316;&#23567;&#26102;&#25968;&#65292;&#30001;&#21407;&#26469;&#30340;&#27599;&#21608;&#19977;&#21313;&#20116;&#23567;&#26102;&#26377;&#25152;&#22686;&#21152;&#65292;&#23601;&#25239;&#35758;&#31034;&#23041;&#24471;&#32763;&#22825;&#35206;&#22320;&#65292;&#23601;&#21487;&#20197;&#30693;&#36947;&#65292;&#21066;&#20943;&#31119;&#21033;&#26377;&#22810;&#38590;&#12290;</li>
<li>&#20559;&#20559;&#22823;&#36873;&#26159;&#22312;&#24180;&#24213;&#65292;&#20559;&#20559;2017&#24180;&#30340;&#20445;&#36153;&#21333;&#27491;&#32439;&#32439;&#23492;&#21040;&#21508;&#23478;&#37038;&#31665;&#12290;&#37027;&#20123;&#20877;&#20063;&#8220;&#20184;&#19981;&#36215;&#8221;&#37027;&#20010;&#12298;&#20184;&#24471;&#36215;&#30340;&#21307;&#30103;&#29031;&#39038;&#27861;&#12299;&#30340;&#30334;&#22995;&#20204;&#65292;&#21482;&#26377;&#25163;&#37324;&#37027;&#24352;&#36873;&#31080;&#20102;&#12290;</li>
<li>&#22312;&#20182;&#20204;&#36973;&#36935;&#21307;&#20445;&#28798;&#38590;&#30340;&#21516;&#26102;&#65292;&#26032;&#38395;&#37324;&#65292;&#32654;&#22269;&#21307;&#30103;&#20107;&#25925;&#27515;&#20129;&#25104;&#20026;&#31532;&#19977;&#22823;&#27515;&#20129;&#21407;&#22240;&#65292;&#39640;&#20110;&#36710;&#31096;&#27515;&#20129;&#65307;&#21478;&#22806;&#65292;&#22885;&#24052;&#39532;&#24635;&#32479;&#25191;&#25919;&#20843;&#24180;&#26399;&#38388;&#65292;&#32654;&#22269;&#22269;&#20538;&#65292;&#34987;&#32763;&#20102;&#19968;&#20493;&#12290;</li>
</ul>
</dd>
</dl></li>
<li><p><a href="http://stackoverflow.blog/2016/11/How-We-Make-Money-at-Stack-Overflow-2016-Edition/">How We Make Money at Stack Overflow: 2016 Edition &#8211; Stack Overflow Blog &#8211; A destination for all things related to development at Stack Overflow</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzA4ODM4ODQ3MQ==&amp;mid=2651930132&amp;idx=1&amp;sn=5e2ff70340dcaa276317f53898e128bb&amp;chksm=8bcf780cbcb8f11a7b3fa2e0d50fdb161ed5ac4cf283fe970d18fe5d6cfd9768dd23a4bee070&amp;mpshare=1&amp;scene=2&amp;srcid=1116E21GeA6IzexUWjuQn9yV&amp;from=timeline&amp;isappinstalled=0#wechat_redirect">&#38472;&#34382;&#24179;&#65306;&#22914;&#20309;&#21521;&#35748;&#30693;&#31185;&#23398;&#22823;&#24072;&#23398;&#20889;&#20316;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8980953">&#20915;&#23450;&#20572;&#27490;&#28903;&#38065;&#20043;&#21518;&#65292;&#36158;&#36291;&#20141;&#25343;&#21040;&#20102;&#26469;&#33258;&#26657;&#21451;&#30340; 6 &#20159;&#32654;&#37329;&#25237;&#36164;</a></p></li>
<li><dl>
<dt><a href="https://github.com/Bilibili/flv.js">Bilibili/flv.js: HTML5 FLV Player</a> <code class="fold">@</code></dt>
<dd><p>bilibili HMTL5 flv &#25773;&#25918;&#22120;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://primitive.lol/">Primitive for macOS</a> <code class="fold">@</code></dt>
<dd><p>cool&#12290;&#19977;&#35282;&#32593;&#26684;&#21270;&#12290;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="http://mp.weixin.qq.com/s?__biz=MzAxMjI4Mzg2OQ==&amp;mid=2650245073&amp;idx=4&amp;sn=0c260f70ee882aab06fec6ffb08f931b&amp;chksm=83b71d63b4c09475d4ed3f49bed71d539dca921ac8c6b9cc5ed9e9dc0cec79e6a5806f250093&amp;mpshare=1&amp;scene=2&amp;srcid=1114BuDpmTxjGtTfrlR94IEO&amp;from=timeline#wechat_redirect">&#24464;&#23454;&#65306;&#32654;&#22269;&#8220;&#30333;&#24038;&#8221;&#21069;&#36884;&#22570;&#24551;</a> <code class="fold">@</code></dt>
<dd><p>&#25688;&#35201;</p>
<blockquote>
<p>&#8220;&#30333;&#24038;&#8221;&#30340;&#21069;&#36884;&#22256;&#22659;&#65292;&#28304;&#20110;&#35813;&#32676;&#20307;&#31177;&#25215;&#30340;&#29616;&#20195;&#33258;&#30001;&#20027;&#20041;&#24847;&#35782;&#24418;&#24577;&#12290;&#23427;&#21487;&#20197;&#31616;&#35201;&#27010;&#25324;&#20026;&#65306;&#19968;&#20010;&#20013;&#24515;&#65306;&#31038;&#20250;&#30340;&#22522;&#26412;&#21333;&#20301;&#26159;&#21407;&#23376;&#21270;&#30340;&#20010;&#20154;&#65292;&#20010;&#20154;&#20248;&#20808;&#20110;&#32676;&#20307;&#12289;&#31038;&#20250;&#12289;&#22269;&#23478;&#32780;&#23384;&#22312;&#12290;&#20004;&#20010;&#22522;&#26412;&#28857;&#65306;&#20154;&#26435;&#33267;&#39640;&#26080;&#19978;;&#31169;&#26377;&#36130;&#20135;&#31070;&#22307;&#19981;&#21487;&#20405;&#29359;&#12290;&#36825;&#22871;&#29609;&#24847;&#20854;&#23454;&#23601;&#26159;&#22269;&#20869;&#8220;&#20844;&#30693;&#8221;&#20204;&#21561;&#25447;&#30340;&#8220;&#26222;&#19990;&#20215;&#20540;&#8221;&#12290;&#28982;&#32780;&#65292;&#26080;&#35770;&#8220;&#30333;&#24038;&#8221;&#36824;&#26159;&#8220;&#20844;&#30693;&#8221;&#65292;&#37117;&#19981;&#26366;&#35748;&#30495;&#23457;&#35270;&#8220;&#26222;&#19990;&#20215;&#20540;&#8221;&#30340;&#19981;&#23436;&#22791;&#24615;&#21644;&#33258;&#30456;&#30683;&#30462;&#12290;</p>
</blockquote>
<p>&#20877;&#19982;&#19979;&#38754;&#36825;&#24352;&#22270;&#23545;&#27604;&#19968;&#19979;&#65292;&#20415;&#20250;&#21457;&#29616;&#38382;&#39064;&#25152;&#22312;&#65306;&#21253;&#21547;&#24191;&#22823;&#26080;&#20135;&#38454;&#32423;&#22312;&#20869;&#30340;&#32654;&#22269; 80% &#30340;&#20154;&#21475;&#65292;&#20165;&#25317;&#26377;&#31038;&#20250;&#36164;&#20135;&#20928;&#20540;&#30340; 12%&#65292;&#28982;&#21518;&#24037;&#36164;&#20195;&#25187;&#30340;&#20010;&#20154;&#25152;&#24471;&#31246;&#31455;&#28982;&#21344;&#25454;&#32852;&#37030;&#31246;&#25910;&#30340; 33%&#65292;&#20182;&#20204;&#24515;&#37324;&#33021;&#22909;&#21463;&#21527;? &#26412;&#26469;&#20313;&#31918;&#23601;&#19981;&#22810;&#65292;&#31246;&#29575;&#31455;&#28982;&#36825;&#20040;&#39640;?</p>
<p>&#8220;&#30333;&#24038;&#8221;&#25512;&#23815;&#30340;&#31038;&#20250;&#31119;&#21033;&#26412;&#36136;&#19978;&#26159;&#20174;&#24182;&#19981;&#23500;&#35029;&#30340;&#26080;&#20135;&#38454;&#32423;&#36523;&#19978;&#33719;&#21462;&#36130;&#23500;&#65292;&#22823;&#37327;&#29992;&#20110;&#34917;&#36148;&#19981;&#21171;&#32780;&#33719;&#30340;&#27969;&#27667;&#26080;&#20135;&#32773;&#12290;&#36825;&#31181;&#20570;&#27861;&#20005;&#37325;&#36341;&#36367;&#21171;&#21160;&#32773;&#26435;&#30410;&#65292;&#23458;&#35266;&#19978;&#40723;&#21169;&#22909;&#21507;&#25042;&#20570;&#65292;&#20351;&#24471;&#27969;&#27667;&#26080;&#20135;&#32773;&#30340;&#32676;&#20307;&#26085;&#30410;&#22766;&#22823;&#12290;</p>
<p>&#25152;&#20197;&#65292;&#24403;&#24029;&#26222;&#25552;&#20986;&#8220;&#35753;&#32654;&#22269;&#20877;&#27425;&#24378;&#22823;&#8221;(make America great again, MAGA)&#65292;&#35768;&#22810;&#8220;&#30333;&#24038;&#8221;&#31455;&#28982;&#22823;&#24785;&#19981;&#35299;&#65306;&#38590;&#36947;&#32654;&#22269;&#29616;&#22312;&#36825;&#20010;&#26679;&#23376;&#19981;&#22909;&#21527;? &#36825;&#20123;&#31934;&#33521;&#24635;&#20197;&#20026;&#21035;&#20154;&#37117;&#36807;&#30528;&#21644;&#20182;&#20204;&#19968;&#26679;&#30340;&#33298;&#36866;&#29983;&#27963;&#65292;&#20174;&#26410;&#20307;&#20250;&#36807;&#32463;&#27982;&#20572;&#28382;&#12289;&#21046;&#36896;&#19994;&#20939;&#38646;&#32473;&#26080;&#20135;&#38454;&#32423;&#21644;&#23567;&#22478;&#23621;&#27665;&#24102;&#26469;&#30340;&#28145;&#28145;&#32477;&#26395;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="https://mp.weixin.qq.com/s?__biz=MzA5OTA0NDIyMQ==&amp;mid=2653885406&amp;idx=1&amp;sn=877b85ed3a8f18798223ca1de562f531&amp;chksm=8b53edccbc2464da8755f56a95ab406831753dbafea6351d5e58f2bc80ea88d52e63fca8a4a2&amp;mpshare=1&amp;scene=1&amp;srcid=11150hKdcVsq8i2wQ2zkU6RW&amp;pass_ticket=8FVYLv0AYzfT9tZD626j2vB0qdcgpZWRJhZGmxz44HcnjNq%2FPmA8HYB%2BuWGLCSQ9#rd">&#21407;&#21019;&#20008;&#22823;&#20107;&#65281;&#29916;&#36798;&#23572;&#28207;&#24320;&#36890;&#65292;&#36825;&#20010;&#22269;&#23478;&#35201;&#20498;&#38665;&#65281;</a></p></li>
<li><dl>
<dt><a href="http://cj.sina.com.cn/article/detail/2949462582/98422?sudaref=www.yinwang.org&amp;retcode=0">&#30475;&#23436;&#29305;&#26391;&#26222;&#30340;&#20116;&#20010;&#25925;&#20107;&#65292;&#20320;&#20250;&#36873;&#20182;&#21527;&#65311;&#65288;&#20316;&#32773;&#65306;&#28037;&#27075;&#65289;_&#36130;&#32463;&#22836;&#26465;</a> <code class="fold">@</code></dt>
<dd><dl>
<dt>&#19968;&#20301;&#22823;&#20384; <code class="fold">@</code></dt>
<dd><p>&#36825;&#26679;&#30340;&#35805;&#25226;&#29305;&#26391;&#26222;&#24443;&#24213;&#28608;&#24594;&#20102;&#65292;&#35828;&#8220;&#23567;&#23376;&#20320;&#32473;&#25105;&#21548;&#30528;&#65292;&#22914;&#26524;&#20320;&#32487;&#32493;&#39578;&#25200;&#24076;&#23572;&#20808;&#29983;&#30340;&#23478;&#24237;&#65292;&#25105;&#23601;&#35753;&#25105;&#30340;&#24459;&#24072;&#22242;&#36215;&#35785;&#20320;&#20204;&#38134;&#34892;&#35851;&#26432;&#24076;&#23572;&#20808;&#29983;&#65292;&#35753;&#20320;&#20204;&#36180;&#22825;&#25991;&#25968;&#23383;&#65281;&#8221;&#38134;&#34892;&#32844;&#21592;&#31435;&#21051;&#22914;&#26790;&#26041;&#37266;&#65292;&#25552;&#20986;&#32477;&#23545;&#19981;&#20877;&#39578;&#25200;&#24076;&#23572;&#22826;&#22826;&#21644;&#24076;&#23572;&#30340;&#23401;&#23376;&#65292;&#36824;&#38065;&#22909;&#35828;&#65292;&#21482;&#35201;&#21035;&#38393;&#36825;&#26679;&#22823;&#30340;&#21160;&#38745;&#65292;&#36825;&#28857;&#38065;&#30495;&#30340;&#19981;&#31639;&#20160;&#20040;&#12290;</p>
</dd>
</dl>
<p>&#19968;&#20010;&#22899;&#20154;</p>
<p>&#19968;&#26550;&#39134;&#26426;</p>
<p>&#19968;&#20010;&#28316;&#20912;&#22330;</p>
<p>&#19968;&#20010;&#37202;&#24196;</p>
</dd>
</dl></li>
<li><p><a href="https://www.douban.com/note/591953479/">&#32842;&#32842;&#36828;&#31243;&#24037;&#20316;&#8212;&#8212;&#25105;&#20204;&#30340;&#22242;&#38431;&#19982;&#24037;&#20316;&#26041;&#24335;</a></p></li>
<li><p><a href="http://finance.china.com.cn/money/fund/special/jjzk17/20120229/564010.shtml">&#36130;&#36890;&#22522;&#37329;&#8220;&#23506;&#20908;&#8221;&#33392;&#38590;&#24230;&#26085; &#36164;&#26412;&#37329;&#21322;&#24180;&#20111;&#25481;&#20845;&#25104;_&#36130;&#32463;_&#20013;&#22269;&#32593;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8969332">&#36335;&#36793;&#25670;&#25674;&#30340;&#33402;&#20154;&#30011;&#26126;&#26143;&#30011;&#24471;&#22909;&#20687;&#65292;&#26159;&#25955;&#33853;&#27665;&#38388;&#30340;&#22823;&#31070;&#21527;&#65311;</a></p></li>
<li><p><a href="https://github.com/MOBX/EasySearch">MOBX/EasySearch: &#23553;&#35013;elasticsearch,lucene&#31561;&#32034;&#24341;&#24037;&#20855;&#30340;&#32454;&#33410;,&#25552;&#20379;&#36890;&#29992;&#25628;&#32034;&#26381;&#21153;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8977065?utm_campaign=in_app_share&amp;utm_medium=Android&amp;utm_source=com.ideashower.readitlater.activity.AddActivity">&#29609;&#20799;&#23616;&#22823;&#23500;&#32705;&#65292;&#22522;&#26412;&#30340;&#37329;&#34701;&#27010;&#24565;&#23601;&#33021;&#20840;&#37096;&#20102;&#35299;&#19968;&#36941;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8976313">&#25104;&#21151;&#25276;&#23453;&#29305;&#26391;&#26222;&#19981;&#31639;&#20160;&#20040; &#65292;&#36825;&#20154;&#30340;&#20256;&#22855;&#20107;&#36857;&#23454;&#22312;&#22826;&#22810;</a></p></li>
<li><p><a href="https://www.douban.com/note/591918948/">&#29579;&#36335;&#65306;&#22788;&#30007;&#32670;&#36785;</a></p></li>
<li><p><a href="https://www.v2ex.com/t/320285#reply0">&#26089;&#20135;&#30340; 2016 &#24180;&#32456;&#24635;&#32467; - V2EX</a></p></li>
<li><p><a href="https://github.com/WorksApplications">Works Applications</a></p></li>
<li><p><a href="https://www.zhihu.com/question/38849258/answer/79421605">&#19978;&#28023;&#21271;&#20140;&#24456;&#22823;&#27604;&#20363;&#30340;&#20154;&#20013;&#32771;&#26080;&#27861;&#21319;&#20837;&#26222;&#36890;&#39640;&#20013;&#65292;&#26377;&#25509;&#36817;&#19968;&#21322;&#21435;&#20013;&#32844;&#65292;&#26159;&#21527;&#65311;&#26159;&#21542;&#21271;&#19978;&#24191;&#22823;&#22478;&#24066;&#30340;&#32844;&#26222;&#27604;&#26356;&#39640;&#65311; - &#20811;&#37324;&#26031;&#33922;&#23068;&#37233;&#30340;&#22238;&#31572; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzA4NzE0NjY3NA==&amp;mid=2649997534&amp;idx=1&amp;sn=c514a78747e02cc65f66d8bb84c67cab&amp;chksm=883a8903bf4d0015baadad75d69360ca886fc1683474050f5d8e8dc0792c5f54c62101e5c6e6&amp;mpshare=1&amp;scene=2&amp;srcid=1110DB3UscdRkpG3R6QgERMt&amp;from=timeline&amp;isappinstalled=0#wechat_redirect">&#24029;&#26222;&#30340;&#32654;&#22269;&#65292;&#31532;&#19968;&#22825;&#12290;</a></p></li>
<li><p><a href="http://www.upmedia.mg/news_info.php?SerialNo=7249">&#12300;&#19981;&#26159;&#25105;&#30340;&#32317;&#32113;&#65281;&#12301;&#12288;&#21453;&#24029;&#26222;&#36938;&#34892;&#27243;&#25475;&#32654;&#22283;10&#22478; &#8211; &#19978;&#22577; / &#22283;&#38555;</a></p></li>
<li><p><a href="https://www.douban.com/note/591420935/">&#25919;&#27835;&#27491;&#30830;&#21644;&#31181;&#26063;&#27495;&#35270;&#65306;&#20026;&#20160;&#20040;&#25105;&#21453;&#23545;&#24029;&#26222;&#65292;&#20026;&#20160;&#20040;&#25105;&#20204;&#19981;&#33021;&#39554;&#20154;</a></p></li>
<li><p><a href="file:///F:/TZX/git/notes/publish/2016/note1.html">Working Notes</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzI3MTA0MTk1MA==&amp;mid=2651988994&amp;idx=1&amp;sn=316929d82857d4a8faff34372ecb71b3&amp;chksm=f12150f3c656d9e5f6b429e9a05c6e5ad35331328695157afcb5d4d9068997538e89d72a6ab0&amp;scene=0#wechat_redirect">&#26426;&#22120;&#23398;&#20064;&#32463;&#20856; Python Machine Learning &#20316;&#32773;&#65306;&#26032;&#20070;&#35745;&#21010;&#26333;&#20809;&#65292;&#20998;&#20139;&#23454;&#25112;&#32463;&#39564;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzA5NTIyODgzOQ==&amp;mid=2650185864&amp;idx=3&amp;sn=c5fa7e383698bb54e218d0513bcbb23b&amp;chksm=88408640bf370f56cf29b7438821b66276b9c5cb95ed83dcaa2c1c8d96ae87f25d491b785ced&amp;scene=0#wechat_redirect">&#35762;&#30495;&#65292;&#22909;&#23401;&#23376;&#19981;&#26159;&#22840;&#20986;&#26469;&#28404;&#65281;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzAxNTc4MTAwMg==&amp;mid=2651147611&amp;idx=1&amp;sn=5ab4efcef700fa626d93819afb214790&amp;chksm=800f30beb778b9a8ae70dcc800d8bb28f5a8b34fd562d20984d83b8d0e690e42ba33c243ad27&amp;scene=0#wechat_redirect">&#26541;&#38596;&#26159;&#24590;&#26679;&#28860;&#25104;&#30340;&#65311;</a></p></li>
<li><p><a href="https://www.douban.com/note/587901231/">&#19968;&#37096;&#20255;&#22823;&#25103;&#21095;&#30340;&#20255;&#22823;&#24320;&#22330;&#65306;&#12298;&#25945;&#29238;&#12299;&#30340;&#21069; 27 &#20998;&#38047;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzA3MzI4MjgzMw==&amp;mid=2650719623&amp;idx=2&amp;sn=b3052c5ed55cd8df6528e6c7c5e53654&amp;chksm=871b01f9b06c88ef8865b29e4363902ad576a6dd1c46127c724735836755a14cc656f1d86f4e&amp;mpshare=1&amp;scene=2&amp;srcid=10061j4tTvR8xTNNsytl9BmR&amp;from=timeline&amp;isappinstalled=0#wechat_redirect">&#37325;&#30917; | &#35895;&#27468;&#24320;&#28304; SLAM &#24211; Cartographer&#65292;&#20320;&#30340;&#26426;&#22120;&#20154;&#32943;&#23450;&#38656;&#35201;</a></p></li>
<li><p><a href="http://bbs.tianya.cn/post-funinfo-5435344-9.shtml#ty_vip_look%5B78751952%5D">&#29468;&#20013;&#24320;&#22836;&#29468;&#19981;&#21040;&#32467;&#23616;&#65292;&#32842;&#32842;&#25105;&#30340;&#21516;&#23398;&#20204;&#36873;&#25321;&#22806;&#20225;&#12289;&#22830;&#20225;&#25110;&#20225;&#30340;&#21313;&#24180;&#20043;&#21518;(&#31532;9&#39029;)_&#23089;&#20048;&#20843;&#21350;_&#22825;&#28079;&#35770;&#22363;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/36235794/answer/72398078">&#22914;&#20309;&#30475;&#24453; US NEWS &#26368;&#26032;&#19990;&#30028;&#22823;&#23398;&#25490;&#21517;&#28165;&#21326;&#22823;&#23398;&#36229;&#36234; MIT &#25104;&#20026;&#24037;&#31243;&#31867;&#31532;&#19968;&#65311; - &#39068;&#26195;&#24029;&#30340;&#22238;&#31572; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://www.diycode.cc/topics/23">GitHub &#20013;&#22269;&#21306;&#21069; 100 &#21517;&#21040;&#24213;&#26159;&#20160;&#20040;&#26679;&#30340;&#20154;&#65311; - DiyCode</a></p></li>
<li><p><a href="https://www.douban.com/note/589025086/">&#8220;&#29579;&#20399;&#23558;&#30456;&#65292;&#23425;&#26377;&#31181;&#20046;&#8221;vs&#8220;&#38391;&#22768;&#21457;&#22823;&#36130;&#8221;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzAxNTM2NTAyMw==&amp;mid=2650973585&amp;idx=1&amp;sn=0e5696ff0968f89478e491040b7861e4&amp;chksm=80732361b704aa77dfcb3b70120cb2c1e5db8b6f3f48598590c0b0cb71cf291bc55d11c49014&amp;mpshare=1&amp;scene=1&amp;srcid=1019coYp4oK7rNkMgxDExpns&amp;from=groupmessage&amp;isappinstalled=0#wechat_redirect">&#26085;&#26412;&#20877;&#21457;&#36798;&#65292;&#20013;&#22269;&#37117;&#33021;&#22312;5&#24180;&#20869;&#20877;&#36896;&#19968;&#20010;&#26085;&#26412;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzI5OTExMjMyOQ==&amp;mid=2650618234&amp;idx=1&amp;sn=fc32bcd3ae5af1c65fcbc3be82d09701&amp;chksm=f4921b9cc3e5928a5143478c05581a6cb070e2b72837e932bbecb91de7d19fcc990c18b21617&amp;scene=0#wechat_redirect">&#23601;&#31639;&#24076;&#25289;&#37324;&#19978;&#21488;&#65292;&#29305;&#26391;&#26222;&#20063;&#20250;&#38452;&#39746;&#19981;&#25955;&#65372;Sisy Big Bang</a></p></li>
<li><p><a href="http://stackoverflow.com/questions/1075207/what-are-the-1-in-class-file">java - what are the $1 in class file? - Stack Overflow</a></p></li>
<li><p><a href="http://bbs.tianya.cn/post-funinfo-3498582-1.shtml">&#36716;&#20010;&#24086;&#23376;&#8212;&#8212;&#36203;&#25935;&#20026;&#20160;&#20040;&#19981;&#33021;&#23233;&#32473;&#21704;&#21033;(&#36716;&#36733;)_&#23089;&#20048;&#20843;&#21350;_&#22825;&#28079;&#35770;&#22363;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzA4NDg3MDEyNw==&amp;mid=2654895076&amp;idx=5&amp;sn=56a47c6ea50644c9f562212099ba9cfa&amp;chksm=842a4d64b35dc47253e48adb2653bf649a0fa86beb766dfa0c2998ee727f8e0f0de78de45ff9&amp;mpshare=1&amp;scene=2&amp;srcid=1025DMk4sJzwCDPURZjbsoR5&amp;from=timeline&amp;isappinstalled=0#wechat_redirect">&#21313;&#19975;&#37319;&#26825;&#22823;&#20891;&#30340;&#36827;&#21270;&#65306;&#26426;&#26800;&#21270;&#37319;&#25688;&#65292;&#39640;&#28165;&#22823;&#22270;&#36879;&#35270;&#20853;&#22242;&#26825;&#33457;&#20840;&#31243;&#20135;&#19994;&#38142;&#65281;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzI4MzExMDU1Nw==&amp;mid=2649858226&amp;idx=1&amp;sn=d920cb07a7f39ac008102395f5fe43bc&amp;chksm=f38abd40c4fd345628ff716fecef9b0d6af4370ffeb3db34a28de902126701504bbfc8c7cfc4&amp;scene=0#wechat_redirect">&#33521;&#35821;&#21548;&#21147;&#21644;&#21457;&#38899;&#30340;&#27515;&#35282;&#65306;&#24369;&#35835;</a></p></li>
<li><p><a href="http://maven.aliyun.com/nexus/#welcome">Sonatype Nexus</a></p></li>
<li><p><a href="http://career.worksap.com/sp/contents/jobs.html">WORKS APPLICATIONS GLOBAL RECRUITMENT</a></p></li>
<li><p><a href="https://www.douban.com/group/topic/91741212/">&#21644;&#22899;&#29983;&#32842;&#22825;&#30340;&#35805;&#39064;&#22823;&#20840;</a></p></li>
<li><p><a href="http://www.vice.cn/read/kristin-dombek-selfishness-of-others-narcissism">&#35828;&#30495;&#30340;&#65292;&#21040;&#24213;&#35841;&#25165;&#26159;&#33258;&#24651;&#29378;&#65311; | VICE&#20013;&#22269;&#65372;&#20840;&#29699;&#38738;&#24180;&#25991;&#21270;&#20043;&#22768;&#65306;&#19990;&#30028;&#22312;&#19979;&#27785;&#65292;&#25105;&#20204;&#22312;&#29378;&#27426;</a></p></li>
<li><p><a href="https://movie.douban.com/review/1389291/">&#24456;&#27491;&#32463;&#31995;&#21015;&#65288;&#32654;&#22269;&#24448;&#20107;&#65289;&#24433;&#35780;</a></p></li>
<li><p><a href="http://blog.csdn.net/liuyan731/article/details/50403949">Works Application&#38754;&#35797;&#24635;&#32467; - Yan - &#21338;&#23458;&#39057;&#36947; - CSDN.NET</a></p></li>
<li><p><a href="https://www.zhihu.com/question/21074656">&#22823;&#23398;&#29983;&#24212;&#35813;&#24590;&#20040;&#36873;&#25321;&#20154;&#29983;&#30340;&#31532;&#19968;&#22871;&#35199;&#35013;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://zh.wikihow.com/%E6%8A%8A%E8%A5%BF%E8%A3%85%E6%89%93%E5%8C%85%E8%BF%9B%E8%A1%8C%E6%9D%8E%E7%AE%B1">3 &#31181;&#26041;&#27861;&#26469;&#25226;&#35199;&#35013;&#25171;&#21253;&#36827;&#34892;&#26446;&#31665;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/21001701">&#20986;&#24046;&#26053;&#36884;&#20013;&#22914;&#20309;&#20445;&#20859;&#35199;&#35013;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/21511976">&#20026;&#20160;&#20040;&#20013;&#22269;&#30340;&#24038;&#27966;&#21491;&#27966;&#19982;&#22806;&#22269;&#24038;&#27966;&#21491;&#27966;&#26159;&#30456;&#21453;&#30340;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://www.youmeek.com/">YouMeek</a></p></li>
<li><p><a href="https://www.zhihu.com/question/37538355">&#22914;&#20309;&#30475;&#24453;&#20013;&#22269;&#20026;&#24052;&#40654;&#28857;&#28783;&#31048;&#31119;&#65292;&#28982;&#32780;&#36335;&#36879;&#31038;&#25159;&#26469;&#20102;&#19968;&#35760;&#21709;&#20142;&#30340;&#32819;&#20809;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://www.1point3acres.com/bbs/forum.php?mod=viewthread&amp;tid=77453&amp;page=1&amp;authorid=103773">8 &#20010;&#26376;&#20174; CS &#33756;&#40479;&#21040;&#25343;&#21040; Google Offer &#30340;&#32463;&#21382; + &#20869;&#25512;&#12304;&#19968;&#20137;&#19977;&#20998;&#22320;&#35770;&#22363;&#20869;&#25512;&#29256;&#12305; - Powered by Discuz!</a></p></li>
<li><p><a href="https://www.zhihu.com/question/42494874">&#22914;&#20309;&#22312;&#32593;&#19978;&#19982;&#19977;&#35266;&#19981;&#21512;&#30340;&#20154;&#25749;&#36924;&#20294;&#21448;&#19981;&#34987;&#23545;&#26041;&#27668;&#27515;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/38485891">&#26377;&#20160;&#20040;&#22909;&#30475;&#21040;&#35753;&#20154;&#27985;&#36523;&#39076;&#25238;&#12289;&#26080;&#27861;&#33258;&#25300;&#12289;&#20037;&#20037;&#19981;&#24536;&#30340;&#30005;&#24433;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/25699277">&#26377;&#21738;&#20123;&#30005;&#24433;&#19968;&#23450;&#35201;&#36225;&#24180;&#36731;&#30475;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://www.tomshardware.com/reviews/mechanical-switch-keyboard,2955-2.html">Keys: Cherry MX Black And MX Red - Five Mechanical-Switch Keyboards: Only The Best For Your Hands</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MjM5MDE0Mjc4MA==&amp;mid=2650994428&amp;idx=1&amp;sn=1056e6aa2957de42205e89fb54f35c33&amp;chksm=bdbf0eaf8ac887b9e75eb12affad6b95a582fdc414d520200e9b1790f331ec4e849c0a9f891a&amp;scene=0#wechat_redirect">Q &#26032;&#38395;&#20008;&#38597;&#34382;&#24320;&#28304;&#33394;&#24773;&#22270;&#29255;&#26816;&#27979;&#31070;&#32463;&#32593;&#32476;&#65307;Vue.js 2.0 &#21457;&#24067;&#65307;&#35895;&#27468;&#24320;&#28304;&#21516;&#27493;&#23450;&#20301;&#19982;&#21046;&#22270;&#24211; Cartographer</a></p></li>
<li><p><a href="https://www.zhihu.com/question/31176010">&#20160;&#20040;&#26159;&#29420;&#35282;&#20861;&#20844;&#21496;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://zhuanlan.zhihu.com/p/21992336">&#37027;&#20010;&#33853;&#27882;&#30340;&#22899;&#22025;&#23486;&#65292;&#26159;&#25105;&#30340;&#33521;&#38596; - &#32654;&#21095;&#28457;&#28065; - &#30693;&#20046;&#19987;&#26639;</a></p></li>
<li><p><a href="https://getpocket.com/redirect?url=https%3A%2F%2Fstomach-ache.gitbooks.io%2Flintcode-solutions%2Fcontent%2Findex.html%3Fq%3D&amp;formCheck=06e9f7d15a9cf6ea0763e876d2c94381">https://getpocket.com/redirect?url=https%3A%2F%2Fstomach-ache.gitbooks.io%2Flintcode-solutions%2Fcontent%2Findex.html%3Fq%3D&amp;formCheck=06e9f7d15a9cf6ea0763e876d2c94381</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzAwNDM0OTU3Ng==&amp;mid=2654705884&amp;idx=1&amp;sn=5906f3dc8a66128d57bc27718ef994e1&amp;chksm=80e2733bb795fa2d0a981d123f0280edff214797c763767c0c3824bd6f62a43fe6c5d65acf92&amp;mpshare=1&amp;scene=2&amp;srcid=1012mcpnjvQeqNyFu7gt8smg&amp;from=timeline&amp;isappinstalled=0#wechat_redirect">&#19968;&#21517;&#38750;&#20856;&#22411; 985 &#27605;&#19994;&#29983;&#30340;&#22823;&#23398;&#31616;&#21490;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/19552501">&#30005;&#24433;&#12298;&#31038;&#20132;&#32593;&#32476;&#12299;&#32473;&#20320;&#26368;&#28145;&#30340;&#24863;&#21463;&#26159;&#20160;&#20040;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://zhuanlan.zhihu.com/p/21992336">&#37027;&#20010;&#33853;&#27882;&#30340;&#22899;&#22025;&#23486;&#65292;&#26159;&#25105;&#30340;&#33521;&#38596; - &#32654;&#21095;&#28457;&#28065; - &#30693;&#20046;&#19987;&#26639;</a></p></li>
<li><p><a href="https://stomach-ache.gitbooks.io/lintcode-solutions/content/index.html?q=">Introduction &#183; LintCode solutions</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzAwNDM0OTU3Ng==&amp;mid=2654705884&amp;idx=1&amp;sn=5906f3dc8a66128d57bc27718ef994e1&amp;chksm=80e2733bb795fa2d0a981d123f0280edff214797c763767c0c3824bd6f62a43fe6c5d65acf92&amp;mpshare=1&amp;scene=2&amp;srcid=1012mcpnjvQeqNyFu7gt8smg&amp;from=timeline&amp;isappinstalled=0#wechat_redirect">&#19968;&#21517;&#38750;&#20856;&#22411; 985 &#27605;&#19994;&#29983;&#30340;&#22823;&#23398;&#31616;&#21490;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/19552501">&#30005;&#24433;&#12298;&#31038;&#20132;&#32593;&#32476;&#12299;&#32473;&#20320;&#26368;&#28145;&#30340;&#24863;&#21463;&#26159;&#20160;&#20040;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://zhuanlan.zhihu.com/p/20289661">&#19968;&#20221;&#20174;&#22825;&#32780;&#38477;&#30340; offer&#8212;&#8212;Thoughtworks 2016 &#27494;&#27721;&#26657;&#25307;&#38754;&#32463; - &#20851;&#20110;&#30382;&#34507;&#30340;&#19968;&#20999; - &#30693;&#20046;&#19987;&#26639;</a></p></li>
<li><p><a href="http://www.vice.cn/read/the-vice-report-tapped-all-the-ways-your-phone-can-be-hacked">VICE &#25253;&#36947; &#65372; &#40657;&#23458;&#20837;&#20405;&#20320;&#25163;&#26426;&#30340;&#19968;&#19975;&#31181;&#29609;&#27861; | VICE &#20013;&#22269;&#65372;&#20840;&#29699;&#38738;&#24180;&#25991;&#21270;&#20043;&#22768;&#65306;&#19990;&#30028;&#22312;&#19979;&#27785;&#65292;&#25105;&#20204;&#22312;&#29378;&#27426;</a></p></li>
<li><p><a href="http://www.vice.cn/read/platonically-sleeping-in-the-same-bed-with-someone-probably-cheating">&#25152;&#20197;&#30495;&#30340;&#23384;&#22312; &#8220;&#26469;&#21543;&#23601;&#25265;&#30528;&#30561;&#32780;&#24050;&#20160;&#20040;&#20063;&#19981;&#24178;&#8221; &#36825;&#31181;&#20107;&#20799;&#21527;&#65311; | VICE &#20013;&#22269;&#65372;&#20840;&#29699;&#38738;&#24180;&#25991;&#21270;&#20043;&#22768;&#65306;&#19990;&#30028;&#22312;&#19979;&#27785;&#65292;&#25105;&#20204;&#22312;&#29378;&#27426;</a></p></li>
<li><p><a href="http://www.vice.cn/read/voters-dont-know-anything-and-your-vote-wont-matter">&#19987;&#23478;&#21578;&#35785;&#20320;&#20026;&#20160;&#20040;&#36873;&#27665;&#22823;&#22810;&#37117;&#24858;&#26151;&#26080;&#30693;&#65292;&#32780;&#19988;&#20854;&#23454;&#20320;&#37027;&#19968;&#31080;&#26681;&#26412;&#23601;&#26080;&#36275;&#36731;&#37325; | VICE &#20013;&#22269;&#65372;&#20840;&#29699;&#38738;&#24180;&#25991;&#21270;&#20043;&#22768;&#65306;&#19990;&#30028;&#22312;&#19979;&#27785;&#65292;&#25105;&#20204;&#22312;&#29378;&#27426;</a></p></li>
<li><dl>
<dt><a href="https://zhuanlan.zhihu.com/p/22887026">&#26366;&#20026;&#29366;&#20803;&#37070;&#65292;&#22914;&#20170;&#19968;&#20154;&#25597;&#19979;&#20004;&#27425;CVPR&#26368;&#20339;&#35770;&#25991;&#22870;&#65292;&#20182;&#26159;&#35745;&#31639;&#26426;&#35270;&#35273;&#39046;&#22495;&#24180;&#36731;&#30340;&#32728;&#26970;&#8212;&#8212;&#20309;&#24698;&#26126; - Dizzy In Science - &#30693;&#20046;&#19987;&#26639;</a> <code class="fold">@</code></dt>
<dd><p>&#20182;&#26159;&#20309;&#24698;&#26126;&#65292;&#20063;&#26159; 2003 &#24180;&#24191;&#19996;&#30465;&#29702;&#31185;&#39640;&#32771;&#29366;&#20803;</p>
<p>&#20309;&#24698;&#26126;&#25918;&#24323;&#20102;&#21407;&#26412;&#20445;&#36865;&#30340;&#26426;&#26800;&#24037;&#31243;&#21450;&#20854;&#33258;&#21160;&#21270;&#19987;&#19994;&#65292;&#36873;&#25321;&#20102;&#26356;&#26377;&#25361;&#25112;&#24615;&#30340;&#22522;&#30784;&#31185;&#23398;&#29677;</p>
<p>&#22522;&#30784;&#31185;&#23398;&#29677;&#26159;&#28165;&#21326;&#22823;&#23398;&#20110; 1998 &#24180;&#24320;&#22987;&#35774;&#31435;&#30340;&#20026;&#22521;&#20859;&#25968;&#23398;&#12289;&#29289;&#29702;&#31561;&#22522;&#30784;&#31185;&#23398;&#22521;&#20859;&#20154;&#25165;&#30340;&#23574;&#23376;&#29677;&#65292;&#35838;&#31243;&#21387;&#21147;&#22823;&#65292;&#21516;&#26102;&#35201;&#23398;&#20064;&#25968;&#23398;&#31995;&#12289;&#29289;&#29702;&#31995;&#30340;&#22823;&#37096;&#20998;&#22522;&#30784;&#35838;&#31243;&#12290;</p>
<p>&#20309;&#24698;&#26126;&#22312;&#28165;&#21326;&#22823;&#23398;&#30340;&#23398;&#20064;&#20381;&#26087;&#26159;&#31283;&#20581;&#32780;&#21051;&#33510;&#30340;</p>
<p>&#34429;&#28982;&#24471;&#20986;&#20102;&#31616;&#21333;&#39640;&#25928;&#30340;&#26041;&#27861;&#65292;&#23454;&#39564;&#32467;&#26524;&#20063;&#38750;&#24120;&#28418;&#20142;</p>
<p>&#20294;&#23548;&#24072;&#23385;&#21073;&#21364;&#24182;&#27809;&#26377;&#24613;&#20110;&#35753;&#24698;&#26126;&#23558;&#26041;&#27861;&#20889;&#25104;&#25991;&#31456;&#21457;&#34920;</p>
<p>&#32780;&#26159;&#21453;&#22797;&#22320;&#36861;&#38382;&#26041;&#27861;&#25104;&#21151;&#32972;&#21518;&#30340;&#26412;&#36136;&#21407;&#22240;</p>
<p>&#26080;&#38654;&#22270;&#20687;&#30340;&#26263;&#36890;&#36947;</p>
<p>&#20110;&#26159;&#20309;&#24698;&#26126;&#21448;&#24102;&#30528;&#38382;&#39064;&#37325;&#26032;&#24320;&#22987;&#30740;&#31350;</p>
<p>&#26082;&#28982;&#23616;&#37096;&#26263;&#23545;&#35937;&#26816;&#27979;&#21435;&#38654;&#26159;&#25104;&#21151;&#30340;</p>
<p>&#37027;&#20040;&#23601;&#35828;&#26126;&#21435;&#38654;&#21518;&#22270;&#20687;&#30340;&#27599;&#20010;&#23616;&#37096;&#30830;&#23454;&#26377;&#26263;&#23545;&#35937;&#23384;&#22312;</p>
<p>&#36825;&#20063;&#23601;&#24847;&#21619;&#30528;&#22312;&#27809;&#26377;&#38654;&#30340;&#22270;&#20687;&#20013;&#26377;&#30456;&#24212;&#30340;&#32479;&#35745;&#35268;&#24459;</p>
<p>&#26080;&#38654;&#22270;&#20687;&#30340;&#26263;&#36890;&#36947;&#24378;&#24230;&#32479;&#35745;&#35268;&#24459;</p>
<p>&#20026;&#27492;&#65292;&#20309;&#24698;&#26126;&#32479;&#35745;&#20102;&#36229;&#36807;5000&#24133;&#22270;&#20687;&#65292;&#39564;&#35777;&#20102;&#29468;&#24819;&#30340;&#35268;&#24459;</p>
<p>&#20174;&#20808;&#30693;&#36947;&#24590;&#20040;&#21150;&#20877;&#29702;&#35299;&#20026;&#20160;&#20040;&#65292;&#20309;&#24698;&#26126;&#24635;&#31639;&#26159;&#23436;&#25104;&#20102;&#23436;&#25972;&#30340;&#30740;&#31350;</p>
<p>&#25552;&#20986;&#20102;Dark Channel Prior&#30340;&#39640;&#25928;&#30340;&#21435;&#38654;&#31639;&#27861;&#29702;&#35770;</p>
</dd>
</dl></li>
<li><p><a href="https://www.zhihu.com/people/raul-williams/answers?order_by=vote_num">Raul Williams &#31572;&#36807;&#30340;&#38382;&#39064; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/23425056/answer/25263415">&#25105;&#20204;&#33021;&#20174;&#12298;&#26435;&#21147;&#30340;&#28216;&#25103;&#12299;&#20013;&#23398;&#21040;&#21738;&#20123;&#12300;&#29983;&#27963;&#35838;&#12301;&#65311; - Raul Williams &#30340;&#22238;&#31572; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://open.163.com/movie/2015/3/V/3/MAKF6TAHB_MAKF7I1V3.html">&#33713;&#28201;&#26031;&#22522;&#65306;&#32670;&#36785;&#30340;&#20195;&#20215;_&#33713;&#28201;&#26031;&#22522;&#65306;&#32670;&#36785;&#30340;&#20195;&#20215;_&#32593;&#26131;&#20844;&#24320;&#35838;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/31190499">&#22914;&#20309;&#35780;&#20215;&#12300;&#20013;&#22269;&#30041;&#23398;&#29983;&#32465;&#26550;&#26696;&#65292;&#23478;&#38271;&#26469;&#32654;&#36159;&#36162;&#35777;&#20154;&#34987;&#25429;&#12301;&#65311; - &#30693;&#20046;</a></p></li>
<li><dl>
<dt><a href="https://tuxproject.de/projects/vim/_compile.bat.php">Automatic compilation of my Vim packages</a> <code class="fold">@</code></dt>
<dd><div class="sourceCode"><pre class="sourceCode php"><code class="sourceCode php"><span class="er">@</span><span class="fu">echo</span> off

cd vim

<span class="kw">REM</span> ----------------------------------------------------------------------
<span class="kw">REM</span> <span class="kw">PREREQUISITES</span>:
<span class="kw">REM</span> * Mercurial <span class="ot">(</span>here: TortoiseHg<span class="ot">)</span>
<span class="kw">REM</span> * <span class="dv">7</span>-zip
<span class="kw">REM</span> * <span class="fu">gettext</span> <span class="ot">(</span><span class="kw">for</span> the src/po folder<span class="ot">)</span>
<span class="kw">REM</span> * a local <span class="kw">clone</span> of the Vim repository <span class="ot">(</span>here: /vim<span class="ot">)</span>
<span class="kw">REM</span>   --&gt; https:<span class="co">//bitbucket.org/vim-mirror/vim</span>
<span class="kw">REM</span> * Visual Studio <span class="dv">2010</span> <span class="ot">(</span>Express would work<span class="ot">)</span>
<span class="kw">REM</span> * Strawberry Perl <span class="ot">(</span>x86 <span class="kw">and</span> x64<span class="ot">),</span> ActiveTcl x86 <span class="ot">(</span>x86 <span class="kw">and</span> x64<span class="ot">),</span> Lua <span class="kw">for</span>
<span class="kw">REM</span>   Windows<span class="ot">,</span> Python2 <span class="kw">and</span> Python3
<span class="kw">REM</span> * Racket<span class="fl">-6.5</span> <span class="ot">(</span>x86 <span class="kw">and</span> x64<span class="ot">),</span> compiled with the same <span class="kw">MSVC</span> version.
<span class="kw">REM</span> * Depending on your Perl distribution<span class="ot">,</span> you might have to fix Perl<span class="st">&#39;s</span>
<span class="st">REM   config file (CORE/config.h) by commenting out symbols you don&#39;</span>t have
<span class="kw">REM</span>   <span class="ot">(</span>like <span class="kw">STDBOOL</span><span class="ot">)</span>.
<span class="kw">REM</span> * Also you<span class="st">&#39;ll need to grab Ruby 2.x (the MSVC version, not the MinGW</span>
<span class="st">REM   version). You&#39;</span>ll probably have to compile it from scratch. This is a
<span class="kw">REM</span>   bit tricky. See here:
<span class="kw">REM</span>   https:<span class="co">//groups.google.com/d/msg/vim_dev/P8l30hk9hyE/cG8wYjh3paMJ</span>
<span class="kw">REM</span> ----------------------------------------------------------------------

<span class="kw">REM</span> update the sources <span class="st">...</span>
<span class="kw">REM</span> ------------------------------------

<span class="st">&quot;C:\Program Files\TortoiseHg\hg&quot;</span> pull
<span class="st">&quot;C:\Program Files\TortoiseHg\hg&quot;</span> update


<span class="kw">REM</span> <span class="fu">set</span> libraries <span class="st">...</span>
<span class="kw">REM</span> ------------------------------------

<span class="kw">REM</span> <span class="kw">LIBPYTHON2</span> = short <span class="ot">(</span><span class="dv">2</span>-digit<span class="ot">)</span> version of Python <span class="fl">2.</span>x
<span class="kw">REM</span> <span class="kw">LIBPYTHON3</span> = short <span class="ot">(</span><span class="dv">2</span>-digit<span class="ot">)</span> version of Python <span class="fl">3.</span>x
<span class="kw">REM</span> <span class="kw">LIBTCLSHRT</span> = short <span class="ot">(</span><span class="dv">2</span>-digit<span class="ot">)</span> version of Tcl
<span class="kw">REM</span> <span class="kw">LIBTCLLONG</span> = long <span class="ot">(</span>x.y<span class="ot">)</span> version of Tcl
<span class="kw">REM</span> <span class="kw">LIBRBYSHRT</span> = short <span class="ot">(</span><span class="dv">2</span>-digit<span class="ot">)</span> version of Ruby
<span class="kw">REM</span> <span class="kw">LIBRBYLONG</span> = long <span class="ot">(</span>x.y.z<span class="ot">)</span> version of Ruby
<span class="kw">REM</span> <span class="kw">LIBRBYLIB</span>  = Ruby version <span class="ot">(</span>x.y.z<span class="ot">)</span> in the library folder name
<span class="kw">REM</span> <span class="kw">LIBLUASHRT</span> = short <span class="ot">(</span><span class="dv">2</span>-digit<span class="ot">)</span> version of Lua
<span class="kw">REM</span> <span class="kw">LIBLUALONG</span> = long <span class="ot">(</span>x.y<span class="ot">)</span> version of Lua
<span class="kw">REM</span> <span class="kw">LIBPERLVER</span> = <span class="dv">3</span>-digit version of Perl
<span class="kw">REM</span> <span class="kw">LIBRACKET</span>  = <span class="fu">current</span> version of your libracket.lib <span class="ot">(</span>part of its <span class="fu">file</span> name<span class="ot">)</span>

<span class="fu">set</span> <span class="kw">LIBPYTHON2</span>=<span class="dv">27</span>
<span class="fu">set</span> <span class="kw">LIBPYTHON3</span>=<span class="dv">35</span>
<span class="fu">set</span> <span class="kw">LIBTCLSHRT</span>=<span class="dv">86</span>
<span class="fu">set</span> <span class="kw">LIBTCLLONG</span>=<span class="fl">8.6</span>
<span class="fu">set</span> <span class="kw">LIBRBYSHRT</span>=<span class="dv">22</span>
<span class="fu">set</span> <span class="kw">LIBRBYLONG</span>=<span class="fl">2.2.3</span>
<span class="fu">set</span> <span class="kw">LIBRBYLIB</span>=<span class="fl">2.2.0</span>
<span class="fu">set</span> <span class="kw">LIBLUASHRT</span>=<span class="dv">53</span>
<span class="fu">set</span> <span class="kw">LIBLUALONG</span>=<span class="fl">5.3</span>
<span class="fu">set</span> <span class="kw">LIBPERLVER</span>=<span class="dv">522</span>
<span class="fu">set</span> <span class="kw">LIBRACKET</span>=xxxxxxx


<span class="kw">REM</span> create output <span class="kw">directory</span> <span class="st">...</span>
<span class="kw">REM</span> ------------------------------------

<span class="kw">if</span> not exist src\tempoutput <span class="fu">mkdir</span> src\tempoutput
<span class="kw">if</span> not exist src\tempoutput <span class="fu">mkdir</span> src\tempoutput\x86
<span class="kw">if</span> not exist src\tempoutput <span class="fu">mkdir</span> src\tempoutput\x64


<span class="kw">REM</span> make clean <span class="ot">(</span>manually<span class="ot">)</span>
<span class="kw">REM</span> -------------------------------------

cd src
del /<span class="kw">Q</span> ObjCULYHTRZAMD64\*.*
del /<span class="kw">Q</span> ObjCULYHTRZi386\*.*
del /<span class="kw">Q</span> ObjGXOULYHTRZAMD64\*.*
del /<span class="kw">Q</span> ObjGXOULYHTRZi386\*.*
del /<span class="kw">Q</span> ObjGXULYHTRZAMD64\*.*
del /<span class="kw">Q</span> ObjGXULYHTRZi386\*.*


<span class="kw">REM</span> delete archive files
<span class="kw">REM</span> -------------------------------------

<span class="kw">if</span> exist tempoutput\complete*.7z del tempoutput\complete*.7z
<span class="kw">if</span> exist tempoutput\complete*.exe del tempoutput\complete*.exe


<span class="kw">REM</span> prepare the environment <span class="st">...</span>
<span class="kw">REM</span> ------------------------------------

del gvim_noOLE.exe
call <span class="st">&quot;C:\Program Files (x86)\Microsoft Visual Studio 10.0\VC</span><span class="kw">\v</span><span class="st">cvarsall.bat&quot;</span> x86


<span class="kw">REM</span> compile! <span class="ot">(</span>x86<span class="ot">)</span>
<span class="kw">REM</span> -------------------------------------

nmake /<span class="kw">C</span> /<span class="kw">S</span> /f Make_mvc.mak <span class="kw">CPU</span>=i386  <span class="kw">DEBUG</span>=no <span class="kw">FEATURES</span>=<span class="kw">HUGE</span> <span class="kw">CHANNEL</span>=yes <span class="kw">MBYTE</span>=yes <span class="kw">CSCOPE</span>=yes <span class="kw">IME</span>=yes <span class="kw">GIME</span>=yes <span class="kw">GUI</span>=yes <span class="kw">OLE</span>=no  <span class="kw">XPM</span>=.\xpm\x86 <span class="kw">DIRECTX</span>=yes <span class="kw">PERL</span>=<span class="kw">C</span>:\Perl_x86\perl <span class="kw">DYNAMIC_PERL</span>=yes <span class="kw">PERL_VER</span>=%<span class="kw">LIBPERLVER</span>% <span class="kw">LUA</span>=<span class="st">&quot;%PROGRAMFILES(X86)%\Lua\%LIBLUALONG%&quot;</span> <span class="kw">DYNAMIC_LUA</span>=yes <span class="kw">LUA_VER</span>=%<span class="kw">LIBLUASHRT</span>% <span class="kw">TCL</span>=<span class="kw">C</span>:\TCL_x86 <span class="kw">TCL_VER</span>=%<span class="kw">LIBTCLSHRT</span>% <span class="kw">TCL_VER_LONG</span>=%<span class="kw">LIBTCLLONG</span>% <span class="kw">DYNAMIC_TCL</span>=yes <span class="kw">RUBY</span>=<span class="kw">C</span>:\Ruby_%<span class="kw">LIBRBYLONG</span>%_x86 <span class="kw">DYNAMIC_RUBY</span>=yes <span class="kw">RUBY_VER</span>=%<span class="kw">LIBRBYSHRT</span>% <span class="kw">RUBY_VER_LONG</span>=%<span class="kw">LIBRBYLIB</span>% <span class="kw">RUBY_PLATFORM</span>=i386-mswin32_100 <span class="kw">RUBY_INSTALL_NAME</span>=msvcr100-ruby%<span class="kw">LIBRBYSHRT</span>%<span class="dv">0</span> <span class="kw">PYTHON</span>=<span class="kw">C</span>:\Python%<span class="kw">LIBPYTHON2</span>% <span class="kw">DYNAMIC_PYTHON</span>=yes <span class="kw">PYTHON_VER</span>=%<span class="kw">LIBPYTHON2</span>% <span class="kw">PYTHON3</span>=<span class="kw">C</span>:\Python%<span class="kw">LIBPYTHON3</span>% <span class="kw">DYNAMIC_PYTHON3</span>=yes <span class="kw">PYTHON3_VER</span>=%<span class="kw">LIBPYTHON3</span>% <span class="kw">MZSCHEME</span>=<span class="st">&quot;%USERPROFILE%\Desktop</span><span class="kw">\r</span><span class="st">acket-x86</span><span class="kw">\r</span><span class="st">acket&quot;</span> <span class="kw">DYNAMIC_MZSCHEME</span>=yes <span class="kw">MZSCHEME_MAIN_LIB</span>=racket <span class="kw">MZSCHEME_VER</span>=%<span class="kw">LIBRACKET</span>%
nmake /<span class="kw">C</span> /<span class="kw">S</span> /f Make_mvc.mak clean
ren gvim.exe gvim_noOLE.exe

nmake /<span class="kw">C</span> /<span class="kw">S</span> /f Make_mvc.mak <span class="kw">CPU</span>=i386  <span class="kw">DEBUG</span>=no <span class="kw">FEATURES</span>=<span class="kw">HUGE</span> <span class="kw">CHANNEL</span>=yes <span class="kw">MBYTE</span>=yes <span class="kw">CSCOPE</span>=yes <span class="kw">IME</span>=yes <span class="kw">GIME</span>=yes <span class="kw">GUI</span>=yes <span class="kw">OLE</span>=yes <span class="kw">XPM</span>=.\xpm\x86 <span class="kw">DIRECTX</span>=yes <span class="kw">PERL</span>=<span class="kw">C</span>:\Perl_x86\perl <span class="kw">DYNAMIC_PERL</span>=yes <span class="kw">PERL_VER</span>=%<span class="kw">LIBPERLVER</span>% <span class="kw">LUA</span>=<span class="st">&quot;%PROGRAMFILES(X86)%\Lua\%LIBLUALONG%&quot;</span> <span class="kw">DYNAMIC_LUA</span>=yes <span class="kw">LUA_VER</span>=%<span class="kw">LIBLUASHRT</span>% <span class="kw">TCL</span>=<span class="kw">C</span>:\TCL_x86 <span class="kw">TCL_VER</span>=%<span class="kw">LIBTCLSHRT</span>% <span class="kw">TCL_VER_LONG</span>=%<span class="kw">LIBTCLLONG</span>% <span class="kw">DYNAMIC_TCL</span>=yes <span class="kw">RUBY</span>=<span class="kw">C</span>:\Ruby_%<span class="kw">LIBRBYLONG</span>%_x86 <span class="kw">DYNAMIC_RUBY</span>=yes <span class="kw">RUBY_VER</span>=%<span class="kw">LIBRBYSHRT</span>% <span class="kw">RUBY_VER_LONG</span>=%<span class="kw">LIBRBYLIB</span>% <span class="kw">RUBY_PLATFORM</span>=i386-mswin32_100 <span class="kw">RUBY_INSTALL_NAME</span>=msvcr100-ruby%<span class="kw">LIBRBYSHRT</span>%<span class="dv">0</span> <span class="kw">PYTHON</span>=<span class="kw">C</span>:\Python%<span class="kw">LIBPYTHON2</span>% <span class="kw">DYNAMIC_PYTHON</span>=yes <span class="kw">PYTHON_VER</span>=%<span class="kw">LIBPYTHON2</span>% <span class="kw">PYTHON3</span>=<span class="kw">C</span>:\Python%<span class="kw">LIBPYTHON3</span>% <span class="kw">DYNAMIC_PYTHON3</span>=yes <span class="kw">PYTHON3_VER</span>=%<span class="kw">LIBPYTHON3</span>% <span class="kw">MZSCHEME</span>=<span class="st">&quot;%USERPROFILE%\Desktop</span><span class="kw">\r</span><span class="st">acket-x86</span><span class="kw">\r</span><span class="st">acket&quot;</span> <span class="kw">DYNAMIC_MZSCHEME</span>=yes <span class="kw">MZSCHEME_MAIN_LIB</span>=racket <span class="kw">MZSCHEME_VER</span>=%<span class="kw">LIBRACKET</span>%
nmake /<span class="kw">C</span> /<span class="kw">S</span> /f Make_mvc.mak clean
nmake /<span class="kw">C</span> /<span class="kw">S</span> /f Make_mvc.mak <span class="kw">CPU</span>=i386  <span class="kw">DEBUG</span>=no <span class="kw">FEATURES</span>=<span class="kw">HUGE</span> <span class="kw">CHANNEL</span>=yes <span class="kw">MBYTE</span>=yes <span class="kw">CSCOPE</span>=yes <span class="kw">IME</span>=no  <span class="kw">GIME</span>=no  <span class="kw">GUI</span>=no  <span class="kw">OLE</span>=no  <span class="kw">XPM</span>=.\xpm\x86 <span class="kw">DIRECTX</span>=no  <span class="kw">PERL</span>=<span class="kw">C</span>:\Perl_x86\perl <span class="kw">DYNAMIC_PERL</span>=yes <span class="kw">PERL_VER</span>=%<span class="kw">LIBPERLVER</span>% <span class="kw">LUA</span>=<span class="st">&quot;%PROGRAMFILES(X86)%\Lua\%LIBLUALONG%&quot;</span> <span class="kw">DYNAMIC_LUA</span>=yes <span class="kw">LUA_VER</span>=%<span class="kw">LIBLUASHRT</span>% <span class="kw">TCL</span>=<span class="kw">C</span>:\TCL_x86 <span class="kw">TCL_VER</span>=%<span class="kw">LIBTCLSHRT</span>% <span class="kw">TCL_VER_LONG</span>=%<span class="kw">LIBTCLLONG</span>% <span class="kw">DYNAMIC_TCL</span>=yes <span class="kw">RUBY</span>=<span class="kw">C</span>:\Ruby_%<span class="kw">LIBRBYLONG</span>%_x86 <span class="kw">DYNAMIC_RUBY</span>=yes <span class="kw">RUBY_VER</span>=%<span class="kw">LIBRBYSHRT</span>% <span class="kw">RUBY_VER_LONG</span>=%<span class="kw">LIBRBYLIB</span>% <span class="kw">RUBY_PLATFORM</span>=i386-mswin32_100 <span class="kw">RUBY_INSTALL_NAME</span>=msvcr100-ruby%<span class="kw">LIBRBYSHRT</span>%<span class="dv">0</span> <span class="kw">PYTHON</span>=<span class="kw">C</span>:\Python%<span class="kw">LIBPYTHON2</span>% <span class="kw">DYNAMIC_PYTHON</span>=yes <span class="kw">PYTHON_VER</span>=%<span class="kw">LIBPYTHON2</span>% <span class="kw">PYTHON3</span>=<span class="kw">C</span>:\Python%<span class="kw">LIBPYTHON3</span>% <span class="kw">DYNAMIC_PYTHON3</span>=yes <span class="kw">PYTHON3_VER</span>=%<span class="kw">LIBPYTHON3</span>% <span class="kw">MZSCHEME</span>=<span class="st">&quot;%USERPROFILE%\Desktop</span><span class="kw">\r</span><span class="st">acket-x86</span><span class="kw">\r</span><span class="st">acket&quot;</span> <span class="kw">DYNAMIC_MZSCHEME</span>=yes <span class="kw">MZSCHEME_MAIN_LIB</span>=racket <span class="kw">MZSCHEME_VER</span>=%<span class="kw">LIBRACKET</span>%


<span class="kw">REM</span> keep up the right <span class="kw">directory</span> structure
<span class="kw">REM</span> -------------------------------------

cd po
nmake -f Make_mvc.mak install-all
cd ..

robocopy ..\runtime\ tempoutput\x86\ /<span class="kw">MIR</span> /<span class="kw">NP</span> /<span class="kw">NJH</span> /<span class="kw">NJS</span> /<span class="kw">NFL</span> /<span class="kw">NDL</span>
<span class="fu">copy</span> ..\vimtutor.* tempoutput\x86\
<span class="fu">copy</span> xxd\xxd.exe tempoutput\x86\
<span class="fu">copy</span> tee\tee.exe tempoutput\x86\
<span class="fu">copy</span> *.exe tempoutput\x86\
<span class="fu">copy</span> vimtbar.dll tempoutput\x86\
<span class="fu">copy</span> <span class="kw">README</span>.txt tempoutput\x86\

<span class="kw">if</span> not exist tempoutput\x86\GVimExt <span class="fu">mkdir</span> tempoutput\x86\GVimExt
<span class="kw">if</span> not exist tempoutput\x86\VisVim <span class="fu">mkdir</span> tempoutput\x86\VisVim

<span class="fu">copy</span> gvimext\*.dll tempoutput\x86\gvimext\
<span class="fu">copy</span> gvimext\*.<span class="kw">inf</span> tempoutput\x86\gvimext\
<span class="fu">copy</span> gvimext\*.reg tempoutput\x86\gvimext\
<span class="fu">copy</span> gvimext\<span class="kw">README</span>.txt tempoutput\x86\gvimext\

<span class="fu">copy</span> VisVim\*.txt tempoutput\x86\VisVim\
<span class="fu">copy</span> VisVim\*.dll tempoutput\x86\VisVim\
<span class="fu">copy</span> VisVim\*.bat tempoutput\x86\VisVim\


<span class="kw">REM</span> cleanup
<span class="kw">REM</span> ------------------------------------

del tempoutput\x86\vimlogo.*
del tempoutput\x86\*.png
del tempoutput\x86\vim<span class="ot">??</span>x<span class="ot">??</span>.*


<span class="kw">REM</span> <span class="fu">pack</span> it!
<span class="kw">REM</span> ------------------------------------

cd tempoutput\x86
<span class="st">&quot;%PROGRAMFILES%</span><span class="kw">\7</span><span class="st">-zip</span><span class="kw">\7</span><span class="st">z&quot;</span> a -mx=<span class="dv">9</span> -r -bd ..\complete-x86.7z *
<span class="st">&quot;%PROGRAMFILES%</span><span class="kw">\7</span><span class="st">-zip</span><span class="kw">\7</span><span class="st">z&quot;</span> a -mx=<span class="dv">9</span> -r -bd -sfx7z.sfx ..\complete-x86.exe *
cd ..\..


<span class="kw">REM</span> prepare the environment <span class="st">...</span>
<span class="kw">REM</span> ------------------------------------

del gvim_noOLE.exe
call <span class="st">&quot;C:\Program Files (x86)\Microsoft Visual Studio 10.0\VC</span><span class="kw">\v</span><span class="st">cvarsall.bat&quot;</span> amd64


<span class="kw">REM</span> compile! <span class="ot">(</span>x64<span class="ot">)</span>
<span class="kw">REM</span> -------------------------------------

nmake /<span class="kw">C</span> /<span class="kw">S</span> /f Make_mvc.mak clean
nmake /<span class="kw">C</span> /<span class="kw">S</span> /f Make_mvc.mak <span class="kw">CPU</span>=<span class="kw">AMD64</span> <span class="kw">DEBUG</span>=no <span class="kw">FEATURES</span>=<span class="kw">HUGE</span> <span class="kw">CHANNEL</span>=yes <span class="kw">MBYTE</span>=yes <span class="kw">CSCOPE</span>=yes <span class="kw">IME</span>=yes <span class="kw">GIME</span>=yes <span class="kw">GUI</span>=yes <span class="kw">OLE</span>=no  <span class="kw">XPM</span>=.\xpm\x64 <span class="kw">DIRECTX</span>=yes <span class="kw">PERL</span>=<span class="kw">C</span><span class="ot">:</span>\Perl64\perl <span class="kw">DYNAMIC_PERL</span>=yes <span class="kw">PERL_VER</span>=%<span class="kw">LIBPERLVER</span>% <span class="kw">LUA</span>=<span class="st">&quot;%PROGRAMFILES%\Lua\%LIBLUALONG%&quot;</span> <span class="kw">DYNAMIC_LUA</span>=yes <span class="kw">LUA_VER</span>=%<span class="kw">LIBLUASHRT</span>% <span class="kw">TCL</span>=<span class="kw">C</span><span class="ot">:</span>\<span class="kw">TCL</span> <span class="kw">TCL_VER</span>=%<span class="kw">LIBTCLSHRT</span>% <span class="kw">TCL_VER_LONG</span>=%<span class="kw">LIBTCLLONG</span>% <span class="kw">DYNAMIC_TCL</span>=yes <span class="kw">RUBY</span>=<span class="kw">C</span><span class="ot">:</span>\Ruby_%<span class="kw">LIBRBYLONG</span>%_x64 <span class="kw">DYNAMIC_RUBY</span>=yes <span class="kw">RUBY_VER</span>=%<span class="kw">LIBRBYSHRT</span>% <span class="kw">RUBY_VER_LONG</span>=%<span class="kw">LIBRBYLIB</span>% <span class="kw">RUBY_PLATFORM</span>=x64-mswin64_100 <span class="kw">RUBY_INSTALL_NAME</span>=x64-msvcr100-ruby%<span class="kw">LIBRBYSHRT</span>%<span class="dv">0</span> <span class="kw">PYTHON</span>=<span class="kw">C</span><span class="ot">:</span>\Python%<span class="kw">LIBPYTHON2</span>%_x64 <span class="kw">DYNAMIC_PYTHON</span>=yes <span class="kw">PYTHON_VER</span>=%<span class="kw">LIBPYTHON2</span>% <span class="kw">PYTHON3</span>=<span class="kw">C</span>:\Python%<span class="kw">LIBPYTHON3</span>%_x64 <span class="kw">DYNAMIC_PYTHON3</span>=yes <span class="kw">PYTHON3_VER</span>=%<span class="kw">LIBPYTHON3</span>% <span class="kw">MZSCHEME</span>=<span class="st">&quot;%USERPROFILE%\Desktop</span><span class="kw">\r</span><span class="st">acket-x64</span><span class="kw">\r</span><span class="st">acket&quot;</span> <span class="kw">DYNAMIC_MZSCHEME</span>=yes <span class="kw">MZSCHEME_MAIN_LIB</span>=racket <span class="kw">MZSCHEME_VER</span>=%<span class="kw">LIBRACKET</span>%
nmake /<span class="kw">C</span> /<span class="kw">S</span> /f Make_mvc.mak clean
ren gvim.exe gvim_noOLE.exe

nmake /<span class="kw">C</span> /<span class="kw">S</span> /f Make_mvc.mak <span class="kw">CPU</span>=<span class="kw">AMD64</span> <span class="kw">DEBUG</span>=no <span class="kw">FEATURES</span>=<span class="kw">HUGE</span> <span class="kw">CHANNEL</span>=yes <span class="kw">MBYTE</span>=yes <span class="kw">CSCOPE</span>=yes <span class="kw">IME</span>=yes <span class="kw">GIME</span>=yes <span class="kw">GUI</span>=yes <span class="kw">OLE</span>=yes <span class="kw">XPM</span>=.\xpm\x64 <span class="kw">DIRECTX</span>=yes <span class="kw">PERL</span>=<span class="kw">C</span>:\Perl64\perl <span class="kw">DYNAMIC_PERL</span>=yes <span class="kw">PERL_VER</span>=%<span class="kw">LIBPERLVER</span>% <span class="kw">LUA</span>=<span class="st">&quot;%PROGRAMFILES%\Lua\%LIBLUALONG%&quot;</span> <span class="kw">DYNAMIC_LUA</span>=yes <span class="kw">LUA_VER</span>=%<span class="kw">LIBLUASHRT</span>% <span class="kw">TCL</span>=<span class="kw">C</span>:\<span class="kw">TCL</span> <span class="kw">TCL_VER</span>=%<span class="kw">LIBTCLSHRT</span>% <span class="kw">TCL_VER_LONG</span>=%<span class="kw">LIBTCLLONG</span>% <span class="kw">DYNAMIC_TCL</span>=yes <span class="kw">RUBY</span>=<span class="kw">C</span>:\Ruby_%<span class="kw">LIBRBYLONG</span>%_x64 <span class="kw">DYNAMIC_RUBY</span>=yes <span class="kw">RUBY_VER</span>=%<span class="kw">LIBRBYSHRT</span>% <span class="kw">RUBY_VER_LONG</span>=%<span class="kw">LIBRBYLIB</span>% <span class="kw">RUBY_PLATFORM</span>=x64-mswin64_100 <span class="kw">RUBY_INSTALL_NAME</span>=x64-msvcr100-ruby%<span class="kw">LIBRBYSHRT</span>%<span class="dv">0</span> <span class="kw">PYTHON</span>=<span class="kw">C</span>:\Python%<span class="kw">LIBPYTHON2</span>%_x64 <span class="kw">DYNAMIC_PYTHON</span>=yes <span class="kw">PYTHON_VER</span>=%<span class="kw">LIBPYTHON2</span>% <span class="kw">PYTHON3</span>=<span class="kw">C</span>:\Python%<span class="kw">LIBPYTHON3</span>%_x64 <span class="kw">DYNAMIC_PYTHON3</span>=yes <span class="kw">PYTHON3_VER</span>=%<span class="kw">LIBPYTHON3</span>% <span class="kw">MZSCHEME</span>=<span class="st">&quot;%USERPROFILE%\Desktop</span><span class="kw">\r</span><span class="st">acket-x64</span><span class="kw">\r</span><span class="st">acket&quot;</span> <span class="kw">DYNAMIC_MZSCHEME</span>=yes <span class="kw">MZSCHEME_MAIN_LIB</span>=racket <span class="kw">MZSCHEME_VER</span>=%<span class="kw">LIBRACKET</span>%
nmake /<span class="kw">C</span> /<span class="kw">S</span> /f Make_mvc.mak clean
nmake /<span class="kw">C</span> /<span class="kw">S</span> /f Make_mvc.mak <span class="kw">CPU</span>=<span class="kw">AMD64</span> <span class="kw">DEBUG</span>=no <span class="kw">FEATURES</span>=<span class="kw">HUGE</span> <span class="kw">CHANNEL</span>=yes <span class="kw">MBYTE</span>=yes <span class="kw">CSCOPE</span>=yes <span class="kw">IME</span>=no <span class="kw">GIME</span>=no <span class="kw">GUI</span>=no <span class="kw">OLE</span>=no <span class="kw">XPM</span>=.\xpm\x64 <span class="kw">DIRECTX</span>=no <span class="kw">PERL</span>=<span class="kw">C</span>:\Perl64\perl <span class="kw">DYNAMIC_PERL</span>=yes <span class="kw">PERL_VER</span>=%<span class="kw">LIBPERLVER</span>% <span class="kw">LUA</span>=<span class="st">&quot;%PROGRAMFILES%\Lua\%LIBLUALONG%&quot;</span> <span class="kw">DYNAMIC_LUA</span>=yes <span class="kw">LUA_VER</span>=%<span class="kw">LIBLUASHRT</span>% <span class="kw">TCL</span>=<span class="kw">C</span>:\<span class="kw">TCL</span> <span class="kw">TCL_VER</span>=%<span class="kw">LIBTCLSHRT</span>% <span class="kw">TCL_VER_LONG</span>=%<span class="kw">LIBTCLLONG</span>% <span class="kw">DYNAMIC_TCL</span>=yes <span class="kw">RUBY</span>=<span class="kw">C</span>:\Ruby_%<span class="kw">LIBRBYLONG</span>%_x64 <span class="kw">DYNAMIC_RUBY</span>=yes <span class="kw">RUBY_VER</span>=%<span class="kw">LIBRBYSHRT</span>% <span class="kw">RUBY_VER_LONG</span>=%<span class="kw">LIBRBYLIB</span>% <span class="kw">RUBY_PLATFORM</span>=x64-mswin64_100 <span class="kw">RUBY_INSTALL_NAME</span>=x64-msvcr100-ruby%<span class="kw">LIBRBYSHRT</span>%<span class="dv">0</span> <span class="kw">PYTHON</span>=<span class="kw">C</span>:\Python%<span class="kw">LIBPYTHON2</span>%_x64 <span class="kw">DYNAMIC_PYTHON</span>=yes <span class="kw">PYTHON_VER</span>=%<span class="kw">LIBPYTHON2</span>% <span class="kw">PYTHON3</span>=<span class="kw">C</span>:\Python%<span class="kw">LIBPYTHON3</span>%_x64 <span class="kw">DYNAMIC_PYTHON3</span>=yes <span class="kw">PYTHON3_VER</span>=%<span class="kw">LIBPYTHON3</span>% <span class="kw">MZSCHEME</span>=<span class="st">&quot;%USERPROFILE%\Desktop</span><span class="kw">\r</span><span class="st">acket-x64</span><span class="kw">\r</span><span class="st">acket&quot;</span> <span class="kw">DYNAMIC_MZSCHEME</span>=yes <span class="kw">MZSCHEME_MAIN_LIB</span>=racket <span class="kw">MZSCHEME_VER</span>=%<span class="kw">LIBRACKET</span>%


<span class="kw">REM</span> keep up the right <span class="kw">directory</span> structure
<span class="kw">REM</span> -------------------------------------

cd po
nmake -f Make_mvc.mak install-all
cd ..

robocopy ..\runtime\ tempoutput\x64\ /<span class="kw">MIR</span> /<span class="kw">NP</span> /<span class="kw">NJH</span> /<span class="kw">NJS</span> /<span class="kw">NFL</span> /<span class="kw">NDL</span>
<span class="fu">copy</span> ..\vimtutor.* tempoutput\x64\
<span class="fu">copy</span> xxd\xxd.exe tempoutput\x64\
<span class="fu">copy</span> tee\tee.exe tempoutput\x64\
<span class="fu">copy</span> *.exe tempoutput\x64\
<span class="fu">copy</span> vimtbar.dll tempoutput\x64\
<span class="fu">copy</span> <span class="kw">README</span>.txt tempoutput\x64\

<span class="kw">if</span> not exist tempoutput\x64\GVimExt <span class="fu">mkdir</span> tempoutput\x64\GVimExt
<span class="kw">if</span> not exist tempoutput\x64\VisVim <span class="fu">mkdir</span> tempoutput\x64\VisVim

<span class="fu">copy</span> gvimext\*.dll tempoutput\x64\gvimext\
<span class="fu">copy</span> gvimext\*.<span class="kw">inf</span> tempoutput\x64\gvimext\
<span class="fu">copy</span> gvimext\*.reg tempoutput\x64\gvimext\
<span class="fu">copy</span> gvimext\<span class="kw">README</span>.txt tempoutput\x64\gvimext\

<span class="fu">copy</span> VisVim\*.txt tempoutput\x64\VisVim\
<span class="fu">copy</span> VisVim\*.dll tempoutput\x64\VisVim\
<span class="fu">copy</span> VisVim\*.bat tempoutput\x64\VisVim\


<span class="kw">REM</span> cleanup
<span class="kw">REM</span> ------------------------------------

del tempoutput\x64\vimlogo.*
del tempoutput\x64\*.png
del tempoutput\x64\vim<span class="ot">??</span>x<span class="ot">??</span>.*


<span class="kw">REM</span> <span class="fu">pack</span> it!
<span class="kw">REM</span> ------------------------------------

cd tempoutput\x64
<span class="st">&quot;%PROGRAMFILES%</span><span class="kw">\7</span><span class="st">-zip</span><span class="kw">\7</span><span class="st">z&quot;</span> a -mx=<span class="dv">9</span> -r -bd ..\complete-x64.7z *
<span class="st">&quot;%PROGRAMFILES%</span><span class="kw">\7</span><span class="st">-zip</span><span class="kw">\7</span><span class="st">z&quot;</span> a -mx=<span class="dv">9</span> -r -bd -sfx7z.sfx ..\complete-x64.exe *


cd ..
cd ..
cd ..
cd ..


<span class="kw">REM</span> prepare upload folder of today<span class="st">&#39;s files</span>
<span class="st">REM ------------------------------------</span>

<span class="st">if not exist upload mkdir upload</span>
<span class="st">del /Q upload\*.*</span>
<span class="st">robocopy vim\src\tempoutput\ upload\ /MAXAGE:1 /NP /NJH /NJS /NFL /NDL /SL /S</span>


<span class="st">REM ------------------------------------------------ DONE!</span></code></pre></div>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://www.zhihu.com/question/52444153/answer/130581909">&#22914;&#20309;&#35780;&#20215;&#21776;&#32435;&#24503;&#183;&#29305;&#26391;&#26222;&#65288;Donald J. Trump&#65289;&#24403;&#36873;&#31532; 45 &#20219;&#32654;&#22269;&#24635;&#32479;&#65311; - &#20877;&#29983;&#32536;.&#26032;&#24076;&#26395;&#30340;&#22238;&#31572; - &#30693;&#20046;</a> <code class="fold">@</code></dt>
<dd><div class="figure">
<img src="http://img.hb.aicdn.com/854ad4c37fca4d3628f937b3c5362fe8994f8c2417b64-KhZ839_fw658" />

</div>
<p>&#29305;&#26391;&#26222;&#23436;&#25104;&#19977;&#21313;&#24180;&#21069;&#30340;&#25215;&#35834;&#65292;1988&#24180;&#22885;&#26222;&#25289;&#38382;&#29305;&#26391;&#26222;&#24895;&#19981;&#24895;&#24847;&#36873;&#24635;&#32479;&#65292;&#29305;&#26391;&#26222;&#22238;&#24212;&#65306;</p>
<p>&#8220;&#21482;&#26377;&#24403;&#22269;&#23478;&#26377;&#21361;&#38505;&#30340;&#26102;&#20505;&#65292;&#25105;&#25165;&#20250;&#20986;&#26469;&#36873;&#24635;&#32479;&#8221;&#8220;&#25105;&#19968;&#36744;&#23376;&#27809;&#36755;&#36807;&#8221;</p>
<p>&#24685;&#21916; Trump &#20808;&#29983;&#65292;&#19977;&#21313;&#24180;&#19968;&#30452;&#29282;&#35760;&#25215;&#35834;&#22312;&#24515;&#38388;&#65292;&#26368;&#32456;&#20063;&#26377;&#24184;&#23653;&#34892;&#35834;&#35328;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzI3NzA0Mjg4NA==&amp;mid=2655878806&amp;idx=1&amp;sn=0ff4154489fb952f36d81e8b010d8b4c&amp;chksm=f0d59d3dc7a2142bf355c85df2f1db581cce9117d38d6c6fe8bc3cd52e07b6c8094add6601ca&amp;mpshare=1&amp;scene=2&amp;srcid=1109eXc2lUYragbPF0auI2hR#wechat_redirect">&#23545;&#24029;&#26222;&#30340;&#21388;&#24694;&#65292;&#35753;&#20154;&#20204;&#30475;&#19981;&#21040;&#19990;&#30028;&#30340;&#22797;&#26434;&#24615;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8964264">&#33529;&#26524;&#20844;&#21496;&#26159;&#24590;&#26679;&#22521;&#20859;&#28040;&#36153;&#32773;&#24544;&#35802;&#24230;&#30340;&#65311;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8936232">&#22825;&#22825;&#21047;&#23631;&#30340;&#32593;&#32476;&#32418;&#20154;&#20204;&#37117;&#26159;&#38752;&#20160;&#20040;&#36186;&#38065;&#30340;&#65311;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8942106">&#20320;&#20197;&#20026;&#28436;&#21592;&#27809;&#21270;&#22918;&#30340;&#26102;&#20505;&#65292;&#20854;&#23454;&#37117;&#21270;&#20102;&#22918;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzIwNjM2NTczNg==&amp;mid=2247483712&amp;idx=1&amp;sn=ac1b6ee0824fa118dcf7d38af208427a&amp;scene=4#wechat_redirect">&#36825;&#21487;&#33021;&#26159;&#36804;&#20170;&#20026;&#27490;&#20851;&#20110;&#20154;&#24037;&#26234;&#33021;&#26368;&#38590;&#35835;&#20063;&#26368;&#20840;&#38754;&#30340;&#25991;&#31456;&#65292;&#20294;&#26159;&#38750;&#24120;&#20540;&#24471;&#20320;&#35835;&#19968;&#35835;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzI4MzExMDU1Nw==&amp;mid=2649858226&amp;idx=1&amp;sn=d920cb07a7f39ac008102395f5fe43bc&amp;chksm=f38abd40c4fd345628ff716fecef9b0d6af4370ffeb3db34a28de902126701504bbfc8c7cfc4#rd">&#33521;&#35821;&#21548;&#21147;&#21644;&#21457;&#38899;&#30340;&#27515;&#35282;&#65306;&#24369;&#35835;</a></p></li>
<li><p><a href="http://www.latimes.com/politics/la-pol-essential-politics-20160923-snap-story.html">The campaign heads to a crucial showdown - LA Times</a></p></li>
<li><p><a href="https://www.zhihu.com/people/chen-lan-xiang-76/answers">&#38472;&#20848;&#39321; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://www.jianshu.com/p/ce8026846719">&#20854;&#23526;&#38476;&#38476;&#20063;&#26159;&#26377;&#30495;&#29233;&#30340;&#65281; - &#31616;&#20070;</a></p></li>
<li><p><a href="http://news.pedaily.cn/201602/20160205393247.shtml">&#36825;&#23478;&#36229;&#24066;&#20973;&#20160;&#20040;&#39072;&#35206;&#20256;&#32479;&#65292;&#25171;&#36133;&#27779;&#23572;&#29595;&#65292;&#25104;&#20026;&#26368;&#21463;&#27426;&#36814;&#30340;&#36229;&#24066;&#65311;_&#34892;&#19994;&#21160;&#24577;_&#25237;&#36164;&#30028;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzAwOTQyMjE1Nw==&amp;mid=2652614241&amp;idx=1&amp;sn=19d5a46b4094a73329583f21436f036c&amp;chksm=80b0da43b7c753557a04587b54e1dac89d1772d2cf2a7ed278e2082cddaed58a947d68447af4&amp;mpshare=1&amp;scene=1&amp;srcid=1105VtZmN10fHL2rjTYyLA29&amp;from=groupmessage&amp;isappinstalled=0#wechat_redirect">&#36825;&#37096; 9.1 &#30340;&#39640;&#20998;&#29255;&#65292;&#30475;&#24471;&#26080;&#25968;&#23429;&#30007;&#28909;&#34880;&#21943;&#24352;</a></p></li>
<li><p><a href="https://www.v2ex.com/t/317105#reply0">[&#21271;&#20140;/&#28145;&#22323;/&#20262;&#25958;] Flint Innovations | &#29159;&#28859;&#21019;&#26032; &#25307;&#32856;&#29609; Linux &#30340;&#21516;&#23398; - V2EX</a></p></li>
<li><p><a href="https://maimai.cn/article/detail?fid=69800938&amp;share_user=http://i9.taou.com/maimai/p/170/7960_121_426rfITM9sFFdZ-a160&amp;from=single_feed">&#36825;&#20010;&#24050;&#32463;&#30331;&#39030; Github &#30340;&#31532;&#19968;&#24320;&#28304;&#39033;&#30446;&#65292;&#20320;&#32473;&#20960;&#20998;&#65311;</a></p></li>
<li><p><a href="http://www.advocate.com/commentary/2016/10/14/peter-thiel-shows-us-theres-difference-between-gay-sex-and-gay">Peter Thiel Shows Us There&#8217;s a Difference Between Gay Sex and Gay | Advocate.com</a></p></li>
<li><p><a href="http://baike.baidu.com/link?url=X-mu81j2Y-ZLrivp8gNMtDFPgqLbmtz6YS_apOvNMRquma-ujWpKtDrMZKGD9ggeMoZeup6Ci50gti1BXEzaxRbPDZScGBCGXsMetfQtEv7Z5FvgfxL0Q9SoavfZ0Qme">&#34181;&#32650;&#27611;&#65288;&#32593;&#32476;&#28909;&#35789;&#65289;_&#30334;&#24230;&#30334;&#31185;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzI2MzQ4ODcwMg==&amp;mid=2247483724&amp;idx=1&amp;sn=96cbf17bee4ce75e07971f0430b7c8bb&amp;chksm=eaba549dddcddd8b84370e5436b9d0ff57bbe32256f460bbbb6061641bfdf9386d45c103f8a9&amp;scene=4#wechat_redirect">&#20026;&#20160;&#20040;&#26377;&#20123;&#20154;&#24456;&#32874;&#26126;&#65311;&#20182;&#20204;&#36935;&#21040;&#38382;&#39064;&#26102;&#30340;&#24605;&#32500;&#26041;&#24335;&#19982;&#25105;&#20204;&#24046;&#21035;&#22312;&#21738;&#21602;&#65311;</a></p></li>
<li><p><a href="https://www.douban.com/group/topic/27824124/">&#29702;&#24037;&#31185;&#21516;&#23398;&#36716;&#34892;&#32463;&#31649;&#21672;&#35810;&#37329;&#34701;&#65292;&#19968;&#23450;&#35201;&#24910;&#37325;&#12304;&#36716;&#24086;&#12305;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzI4MzExMDU1Nw==&amp;mid=2649857918&amp;idx=1&amp;sn=1f80df72749cf0b91b319fe74024ceb3&amp;scene=21#wechat_redirect">&#35686;&#21578;&#65306;&#19981;&#35201;&#21442;&#21152;&#20219;&#20309;&#24418;&#24335;&#30340;&#25104;&#20154;&#21475;&#35821;&#22521;&#35757;&#29677;&#65281;</a></p></li>
<li><p><a href="http://www.guancha.cn/politics/2016_10_22_378025.shtml#0-douban-1-17073-8281435cf7fd5566f1df466eda875057">&#19982;&#32654;&#22269;&#20998;&#36947;&#25196;&#38259;&#65311;&#33778;&#24459;&#23486;&#24635;&#32479;&#26460;&#29305;&#23572;&#29305;&#35775;&#21326;&#28436;&#35762;&#20840;&#25991;&#20844;&#24067;</a></p></li>
<li><p><a href="http://www.guancha.cn/chenhaoran/2016_10_21_377956_s.shtml">&#38472;&#28009;&#28982;&#65306;&#32654;&#22269;&#22823;&#36873;&#32456;&#36777;&#8212;&#8212;&#24050;&#38750;&#20108;&#20154;&#20043;&#20105;&#65292;&#20035;&#27665;&#31929;&#20027;&#20041;&#19982;&#20840;&#29699;&#21270;&#30340;&#23545;&#25239;</a></p></li>
<li><p><a href="http://dz.xdkb.net/html/2012-11/14/content_223636.htm">&#29616;&#20195;&#24555;&#25253;&#22810;&#23186;&#20307;&#25968;&#23383;&#25253;&#21002;&#24179;&#21488;</a></p></li>
<li><p><a href="https://en.wikipedia.org/wiki/Thomas_Sowell">Thomas Sowell - Wikipedia</a></p></li>
<li><p><a href="https://www.zhihu.com/question/27259308">&#22914;&#20309;&#22791;&#32771;&#19978;&#28023;&#33521;&#35821;&#20013;&#32423;&#21475;&#35793;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/24322387">netty &#33021;&#20570;&#20160;&#20040;&#65311;&#35831;&#36890;&#20439;&#19968;&#28857;&#35762;&#19968;&#19979; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://movie.douban.com/review/1589690/">&#35848;&#35848;&#12298;&#32769;&#30007;&#23401;&#12299;&#65288;&#32769;&#30007;&#23401;&#65289;&#24433;&#35780;</a></p></li>
<li><p><a href="https://www.douban.com/note/581242499/">&#12302;&#38463;&#30007;&#38386;&#32842;&#12303;&#21345;&#35199;&#27431;&#30005;&#23376;&#35789;&#20856;&#31616;&#35780;</a></p></li>
<li><dl>
<dt><a href="https://www.douban.com/note/583870739/">&#12302;&#38463;&#30007;&#30340; Linux &#26085;&#24120;&#20351;&#29992;&#31508;&#35760;&#12303;&#20351;&#29992; ImageMagick &#23558; PDF &#23548;&#20986;&#25104;&#38271;&#22270;&#29255;</a> <code class="fold">@</code></dt>
<dd><div class="sourceCode"><pre class="sourceCode bash"><code class="sourceCode bash"><span class="kw">convert</span> -density 100 in.pdf -background white -alpha remove out.png
<span class="kw">convert</span> -append <span class="kw">`ls</span> -1 *.png <span class="kw">|</span> <span class="kw">sort</span> -n <span class="kw">|</span> <span class="kw">tr</span> <span class="st">&#39;\n&#39;</span> <span class="st">&#39; &#39;</span><span class="kw">`</span> all.png</code></pre></div>
</dd>
</dl></li>
<li><p><a href="http://xsjy.whu.edu.cn/news/146009244144588028.html">&#23398;&#29983;&#32593;&#31614;&#27969;&#31243; - &#27494;&#27721;&#22823;&#23398;&#23601;&#19994;&#26381;&#21153;&#32593; - &#23601;&#19994;&#27969;&#31243;</a></p></li>
<li><p><a href="https://github.com/angular/angular-phonecat">angular/angular-phonecat: Tutorial on building an angular application.</a></p></li>
<li><p><a href="http://www.runoob.com/redis/redis-java.html">Java &#20351;&#29992; Redis | &#33756;&#40479;&#25945;&#31243;</a></p></li>
<li><p><a href="http://www.cnblogs.com/redmoon/p/4574359.html">&#20351;&#29992; Visual Studio Code &#24320;&#21457; AngularJS &#24212;&#29992; - &#26417;&#27704;&#20809; - &#21338;&#23458;&#22253;</a></p></li>
<li><p><a href="http://www.heapoverflow.me/question-microsoft-vs-code-and-angular-2-tags-in-html-linter-39945780">Microsoft VS Code and Angular 2 tags in HTML linter - heapoverflow.me</a></p></li>
<li><p><a href="https://blogs.msdn.microsoft.com/vscode/2015/05/21/getting-started-with-angular-and-visual-studio-code/">Getting Started with Angular and Visual Studio Code | Visual Studio Code</a></p></li>
<li><p><a href="https://www.zhihu.com/question/29056889">&#22914;&#20309;&#30475;&#24453;&#32769;&#26495;&#32769;&#25343;&#26399;&#26435;&#28608;&#21169;&#21592;&#24037;&#65292;&#32473;&#30340;&#24037;&#36164;&#21364;&#24456;&#23569;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://xsjy.whu.edu.cn/type_iframe/000010116.html">&#27494;&#27721;&#22823;&#23398;&#23601;&#19994;&#32593; - &#20010;&#20154;&#20013;&#24515;</a></p></li>
<li><dl>
<dt><a href="http://xsjy.whu.edu.cn/news/146112135882410583.html">2017 &#24180;&#27605;&#19994;&#29983;&#31614;&#32422;&#27880;&#24847;&#20107;&#39033;&#21450;&#32593;&#19978;&#27605;&#19994;&#21435;&#21521;&#22635;&#20889;&#35828;&#26126; - &#27494;&#27721;&#22823;&#23398;&#23601;&#19994;&#26381;&#21153;&#32593; - &#37325;&#35201;&#36890;&#30693;</a> <code class="fold">@</code></dt>
<dd><p>2017 &#24180; 2 &#26376; 20 &#26085;&#36215;&#65292;&#23398;&#26657;&#24320;&#22987;&#21463;&#29702;&#27605;&#19994;&#29983;&#30340;&#36829;&#32422;&#30003;&#35831;&#12290;&#27605;&#19994;&#29983;&#20808;&#22312;&#23601;&#19994;&#31649;&#29702;&#20449;&#24687;&#31995;&#32479;&#20013;&#30340;&#8220;&#21435;&#21521;&#21464;&#26356;&#30003;&#35831;&#8221;&#27169;&#22359;&#20013;&#25552;&#20132;&#36829;&#32422;&#20449;&#24687;&#65292;&#25171;&#21360;&#12298;&#27605;&#19994;&#21435;&#21521;&#21464;&#26356;&#30003;&#35831;&#34920;&#12299;&#65292;&#36830;&#21516;&#21407;&#21333;&#20301;&#35299;&#32422;&#20989;&#12289;&#21407;&#23601;&#19994;&#21327;&#35758;&#20070;&#65288;&#19968;&#24335;&#22235;&#32852;&#65289;&#12289;&#26032;&#21333;&#20301;&#25509;&#25910;&#20989;&#19968;&#24182;&#20132;&#21040;&#25152;&#22312;&#38498;&#31995;&#23457;&#26680;&#65292;&#30001;&#20998;&#31649;&#23398;&#29983;&#24037;&#20316;&#21103;&#20070;&#35760;&#31614;&#32626;&#24847;&#35265;&#24182;&#21152;&#30422;&#23398;&#38498;&#65288;&#31995;&#65289;&#26377;&#25928;&#20844;&#31456;&#21518;&#20132;&#21040;&#23398;&#26657;&#23601;&#19994;&#20013;&#24515;&#21150;&#29702;&#25163;&#32493;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="http://tool.oschina.net/" class="hearts">&#22312;&#32447;&#24037;&#20855; &#8212;&#8212; &#24320;&#28304;&#20013;&#22269;&#31038;&#21306;</a></p></li>
<li><p><a href="https://movie.douban.com/subject/1292262/questions/3142/?from=subject">&#12298;&#32654;&#22269;&#24448;&#20107;&#12299; &#25506;&#35752;&#19968;&#19979;&#8230; &#22823;&#23478;&#24590;&#20040;&#30475; noodles &#24378;&#22904; Deborah &#30340;&#24773;&#33410;&#65311; - &#35910;&#29923;&#30005;&#24433;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzA4MjAxODMzMA==&amp;mid=2653190468&amp;idx=1&amp;sn=bb04af6f6d6aeadcfc267f6725df8861&amp;chksm=845cf031b32b79278534b8bba2fcbbad772872641a0ddad813b1b50e6af62781ee842db235bb&amp;mpshare=1&amp;scene=2&amp;srcid=1009dESISsJe3xNpOqh27oFl&amp;from=timeline&amp;isappinstalled=0#wechat_redirect">&#29190;&#31505;&#27431;&#27954;&#31616;&#21490;&#65292;&#31616;&#21040;&#23849;&#28291;&#65292;&#31505;&#21040;&#22833;&#31105;</a></p></li>
<li><p><a href="http://www.jianshu.com/p/ff6889acafc7">STL &#20013;&#23481;&#22120;&#20803;&#32032;&#30340;&#21024;&#38500; - &#31616;&#20070;</a></p></li>
<li><p><a href="http://www.jianshu.com/p/f5baf7f27a7e">&#21508;&#31181;&#25490;&#24207;&#31639;&#27861;&#24635;&#32467; - &#31616;&#20070;</a></p></li>
<li><p><a href="http://www.jianshu.com/p/cf2f995a7899?utm_campaign=maleskine&amp;utm_content=note&amp;utm_medium=mobile_all_hots&amp;utm_source=recommendation">&#23433;&#22958;&#20026;&#20160;&#20040;&#35201;&#20255;&#22823;&#65311; - &#31616;&#20070;</a></p></li>
<li><p><a href="https://www.v2ex.com/t/311828#reply1">&#20122;&#39532;&#36874;&#28023;&#22806;&#32844;&#20301;&#38754;&#35797;&#32463;&#21382; - V2EX</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzA5MzE4MjgyMw==&amp;mid=2649455663&amp;idx=1&amp;sn=44a295890df1009de78cfcba7ff0e8a3&amp;chksm=887e1227bf099b3125e2cbce4f8c03d43f0d1c9103f37eac5104cd42f7282bdf60be42ef3450&amp;scene=0#rd">&#12298;&#31995;&#32479;&#35774;&#35745;&#29677;&#12299;&#26412;&#21608;&#26411;&#24320;&#35838;, &#20813;&#36153;&#35797;&#21548;&#22914;&#20309;&#35774;&#35745; twitter!</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8868640">&#20570;&#22909;&#24515;&#29702;&#20934;&#22791;&#65292;&#26410;&#26469;&#30340;&#38134;&#34892;&#37324;&#21487;&#33021;&#27809;&#20960;&#20154;&#19978;&#29677;&#20102;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/37375085">&#30382;&#32932;&#30001;&#24046;&#21464;&#22909;&#26159;&#20160;&#20040;&#20307;&#39564;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzA5NTIyODgzOQ==&amp;mid=2650185139&amp;idx=1&amp;sn=4c94fc7b56c84c9bebbbbd0c981d96fe&amp;chksm=8840bb7bbf37326d7caa6fb568b350d428f63a1e1c97992191d01dda1010a77075cc317591a2&amp;scene=4#wechat_redirect">&#27993;&#22823;&#21103;&#26657;&#38271;&#29190;&#36138;&#27745; 6000 &#19975;&#65292;&#31455;&#26377; 800 &#21517;&#24072;&#29983;&#19978;&#20070;&#27714;&#24773;&#65292;&#20182;&#26159;&#33521;&#38596;&#36824;&#26159;&#36138;&#23448;&#65311;&#20013;&#22269;&#31185;&#25216;&#31532;&#19968;&#26696;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MjM5OTY2ODYyMQ==&amp;mid=2652749201&amp;idx=1&amp;sn=f5faec71707b48fdba28435df2c23f64&amp;mpshare=1&amp;scene=2&amp;srcid=0929F9cRZBE27pSDZQq2q1JK&amp;from=timeline&amp;isappinstalled=0#wechat_redirect">&#33150;&#35759;&#20135;&#21697;&#24635;&#30417;&#65306;&#20026;&#20309;&#25105;&#24037;&#20316; 10 &#24180;&#65292;&#20869;&#24515;&#20173;&#26080;&#27604;&#24656;&#24908;&#65311;&#65288;&#24378;&#28872;&#25512;&#33616;&#65289;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/38836382?sort=created">GitHub &#19978;&#26377;&#21738;&#20123;&#20540;&#24471;&#25512;&#33616;&#30340;&#24320;&#28304;&#30005;&#23376;&#20070;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://hihocoder.com/discuss/question/3970">&#25105;&#26469;&#36148;&#19968;&#20010;&#31532;&#22235;&#39064;&#30340;&#24605;&#36335; - hihoCoder</a></p></li>
<li><p><a href="https://www.zhihu.com/question/51331837/answer/125936143">&#20026;&#20160;&#20040;&#35199;&#26041;&#21463;&#36807;&#39640;&#31561;&#25945;&#32946;&#30340;&#31934;&#33521;&#20998;&#23376;&#20250;&#25104;&#20026;&#37096;&#20998;&#20013;&#22269;&#20154;&#30524;&#20013;&#24188;&#31258;&#30340;&#12300;&#30333;&#24038;&#12301;&#65311; - Orz &#36745;&#30340;&#22238;&#31572; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://d.hatena.ne.jp/JAPLJ/">TopCoder &#12392; J &#35328;&#35486;&#12392;&#26178;&#12293;F#</a></p></li>
<li><p><a href="https://atcoder.jp/user/japlj/history">Competition History</a></p></li>
<li><p><a href="https://zhuanlan.zhihu.com/p/20425299">&#26085;&#26412;&#20154;&#21334;&#39640;&#38081;&#20026;&#20160;&#20040;&#21334;&#19981;&#36807;&#20013;&#22269;&#65311; - &#19990;&#30028;&#35828; - &#30693;&#20046;&#19987;&#26639;</a></p></li>
<li><p><a href="http://weibo.com/ttarticle/p/show?id=2309404026575434713892#_0">&#22521;&#20859;&#19968;&#20301;&#38750;&#27954;&#24635;&#32479;&#30340;&#20195;&#20215;&#26377;&#22810;&#22823;&#65311;&#32593;&#21451;&#65306;&#38750;&#23616;&#22467;&#22622;&#27573;&#26469;&#20102;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzA5OTA4MjE3Nw==&amp;mid=2650277528&amp;idx=1&amp;sn=4a788f397e139000ac6a85f19ec40969&amp;chksm=888b6c36bffce52031e6ce78d5011e282718d2cf1e7458c1579b71fabcba2644d8a24e30a7a4&amp;mpshare=1&amp;scene=2&amp;srcid=1009AtkEg5MHFDGJWflWio2T&amp;from=timeline&amp;isappinstalled=0#wechat_redirect">&#23628;&#28856;&#22825;&#65281;3 &#20010;&#26376;&#21518;&#21271;&#20140;&#23558;&#21457;&#29983;&#32763;&#22825;&#35206;&#22320;&#30340;&#21464;&#21270;&#65281;</a></p></li>
<li><p><a href="https://www.douban.com/note/582883111/?start=100&amp;post=ok#last">84% &#30340;&#32032;&#39135;&#20027;&#20041;&#32773;&#37117;&#20250;&#22238;&#22836;&#21507;&#32905;&#65292;&#20182;&#20204;&#26159;&#19981;&#26159;&#23545;&#32032;&#39135;&#26377;&#20160;&#20040;&#35823;&#35299;&#65311;</a></p></li>
<li><p><a href="https://www.douban.com/group/topic/91495342/">&#21448;&#26377;&#20010;&#20799;&#31185;&#21307;&#29983;&#34987;&#30733;&#27515;&#20102;&#65292;&#21516;&#23398;&#30340;&#25351;&#23548;&#32769;&#24072;</a></p></li>
<li><p><a href="https://www.douban.com/people/1819357/status/1899831206/">hikari &#30340;&#24191;&#25773;</a></p></li>
<li><p><a href="http://www.acsu.buffalo.edu/~devansha/blog_why_deep_learning_works.html">Blog- Why Deep Learning Works?- Devansh Arpit</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MTI0MDU3NDYwMQ==&amp;mid=2656545622&amp;idx=1&amp;sn=81e1190905abddb1917e7dfee164fb9d&amp;chksm=7a6d56b04d1adfa671a513c51319004567b09e03cf89d4212227942634d3608d9e50ee2932a0&amp;mpshare=1&amp;scene=2&amp;srcid=1008VSJLnMrHAGoj3hxUn3sT&amp;from=timeline&amp;isappinstalled=0#wechat_redirect">&#25105;&#22269;&#20877;&#27425;&#25915;&#20811;&#19990;&#30028;&#32423;&#38590;&#39064;&#65281;&#36825;&#26159;&#19968;&#20010;&#34987;&#35465;&#20026;&#8220;&#29664;&#31302;&#26391;&#29595;&#23792;&#8221;&#30340;&#20132;&#36890;&#24037;&#31243;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzAxNjg3MjU5NA==&amp;mid=2650194848&amp;idx=4&amp;sn=d57b4df43de6571d9fa2b7f2d6fde66d&amp;mpshare=1&amp;scene=1&amp;srcid=1005nBR7stx8HIDG6hWDAsKh#rd">&#24378;&#30828;&#28207;&#22823;&#28145;&#22323;&#21307;&#38498;&#65306;&#25105;&#20204;&#35201;&#35753;&#30149;&#20154;&#30693;&#36947;&#65292;&#8220;&#38393;&#8221;&#19981;&#35299;&#20915;&#38382;&#39064;</a></p></li>
<li><p><a href="https://zhuanlan.zhihu.com/p/22760458">&#28779;&#36710;&#36710;&#27425;&#21069;&#38754;&#37027;&#20123;&#23383;&#27597;&#37117;&#26159;&#20160;&#20040;&#24847;&#24605; - SS9-0129 &#30340;&#25991;&#31456; - &#30693;&#20046;&#19987;&#26639;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzIyOTE1NTMyNg==&amp;mid=2653858945&amp;idx=1&amp;sn=e67ebae98062061a57872c96f13b3f3b&amp;chksm=f39d0410c4ea8d065d3303757d61133b93f6cde30a5f9683d7c11de576c81dc8501a1e6031f7&amp;scene=4#wechat_redirect">&#23398;&#26415;&#30028;&#29616;&#29366;&#21450;&#28023;&#24402;&#39640;&#26657;&#21069;&#26223;&#20998;&#26512;</a></p></li>
<li><p><a href="https://code.visualstudio.com/?utm_expid=101350005-35.Eg8306GUR6SersZwpBjURQ.0&amp;utm_referrer=https%3A%2F%2Fgetpocket.com%2F">Visual Studio Code - Code Editing. Redefined</a></p></li>
<li><p><a href="https://www.zhihu.com/question/29896412">&#39030;&#23574;&#30340;&#25968;&#23398;&#23478;&#28818;&#32929;&#26159;&#19981;&#26159;&#29305;&#21035;&#21385;&#23475;? - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.douban.com/group/topic/77801827/">&#21040;&#24213;&#26368;&#36817;&#30340;&#28909;&#35789; IP &#26159;&#20160;&#20040;&#24847;&#24605;?</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8858038">&#21457;&#29616;&#20013;&#22269; &#183; &#21435;&#26032;&#30086;&#65292;&#20026;&#20102;&#29275;&#32650;&#22766;&#32654;&#12289;&#29916;&#26524;&#39128;&#39321;&#65292;&#21644;&#26080;&#25968;&#32654;&#39135;</a></p></li>
<li><p><a href="https://zhuanlan.zhihu.com/p/22772665">&#27754;&#28372;&#12289;&#22823;&#30086;&#19982;&#27491;&#22312;&#23835;&#36215;&#30340;&#20013;&#22269;&#30789;&#35895; - &#28145;&#34013; DeeperBlue - &#30693;&#20046;&#19987;&#26639;</a></p></li>
<li><p><a href="https://www.zhihu.com/topic/19564504/top-answers">&#20154;&#29983;&#35268;&#21010; - &#35805;&#39064;&#31934;&#21326; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MjM5OTYwMzYyOA==&amp;mid=2648597549&amp;idx=1&amp;sn=8ed654738ff40a613b60c608491c9c2f&amp;chksm=bf1238ee8865b1f8550a0bbc1766">A Protocal For Dying &#8212; ZeroMQ &#20316;&#32773;&#20110;&#26152;&#22825;&#19979;&#21320;&#23459;&#24067;&#23433;&#20048;&#27515;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/19750692">ERP &#19982; SCM&#12289;CRM &#31561;&#20854;&#20182;&#20225;&#19994;&#24212;&#29992;&#31995;&#32479;&#30340;&#20851;&#31995;&#21644;&#21306;&#21035;&#26159;&#20160;&#20040;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/20222091">&#20225;&#19994;&#32423;&#36719;&#20214;&#22312;&#20013;&#22269;&#30340;&#36831;&#32531;&#21457;&#23637;&#23616;&#38754;&#65292;&#20160;&#20040;&#26102;&#20505;&#20250;&#26377;&#25913;&#21464;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://baike.baidu.com/item/%e6%b8%af%e7%8f%a0%e6%be%b3%e5%a4%a7%e6%a1%a5/2836012?fromtitle=%E7%8F%A0%E6%B8%AF%E6%BE%B3%E5%A4%A7%E6%A1%A5&amp;fromid=4414589">&#28207;&#29664;&#28595;&#22823;&#26725;_&#30334;&#24230;&#30334;&#31185;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/50803443/answer/123402284">&#25968;&#23398;&#19987;&#19994;&#20986;&#36523;&#30340;&#21475;&#31639;&#33021;&#21147;&#20250;&#27604;&#20854;&#20182;&#20154;&#24378;&#24456;&#22810;&#21527;&#65311; - &#21281;&#19990;&#29641;&#30340;&#22238;&#31572; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/50996567">&#25703;&#27585;&#19968;&#20010;&#29066;&#23401;&#23376;&#26377;&#22810;&#22256;&#38590;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/23073812">&#33258;&#23398;&#25104;&#25165;&#30340;&#40657;&#23458;&#65288;&#23433;&#20840;&#30740;&#31350;&#21592;&#65289;&#26159;&#20174;&#21738;&#23398;&#21040;&#37027;&#20123;&#30693;&#35782;&#30340;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/20978509">&#31995;&#32479;&#22320;&#23398;&#20064;&#34920;&#28436;&#65292;&#25552;&#39640;&#28436;&#25216;&#65292;&#20250;&#23545;&#26085;&#24120;&#29983;&#27963;&#26377;&#20160;&#20040;&#24110;&#21161;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/48749292#answer-42012345">&#24180;&#36731;&#20154;&#22914;&#20309;&#22312;&#29420;&#23621;&#26102;&#26377;&#25928;&#22320;&#20445;&#25345;&#33258;&#24459;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/28839269">&#21738;&#20123;&#34892;&#20026;&#20250;&#20351;&#22899;&#24615;&#26174;&#24471;&#20439;&#19981;&#21487;&#32784;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/23386750">&#23545;&#21018;&#20837;&#32844;&#22330;&#20960;&#24180;&#30340;&#26032;&#20154;&#26377;&#21738;&#20123;&#24314;&#35758;&#21644;&#24544;&#21578;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/24204579">&#20307;&#21046;&#20869;&#20154;&#21592;&#30340;&#20248;&#36234;&#24863;&#20174;&#20309;&#32780;&#26469;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/30603447/answer/124127040">&#36139;&#31351;&#20250;&#23545;&#20154;&#30340;&#36523;&#24515;&#36896;&#25104;&#22810;&#22823;&#30340;&#24433;&#21709;&#65311; - &#40644;&#30333;&#23567;&#29483;&#30340;&#22238;&#31572; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/23317802">&#20026;&#20160;&#20040;&#19981;&#35201;&#21435;&#32771;&#39564;&#20154;&#24615;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/26834036">&#22914;&#20309;&#35780;&#20215; This War of Mine &#65288;&#36825;&#26159;&#25105;&#30340;&#25112;&#20105;&#65289;&#36825;&#27454;&#28216;&#25103;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/21456510">&#20851;&#20110;&#20351;&#29992; Emacs&#65292;&#21508;&#20301;&#26377;&#21738;&#20123;&#25552;&#39640;&#25928;&#29575;&#30340;&#25913;&#38190;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://zhuanlan.zhihu.com/p/19709858">&#12300;&#39640;&#22823;&#19978;&#12301;&#30340;&#31070;&#22120; &#8211;Vim - &#34394;&#32773;&#23454;&#20043; - &#30693;&#20046;&#19987;&#26639;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/21752167#answer-24898407">&#24590;&#20040;&#35299;&#37322;&#12298;&#36947;&#24503;&#32463;&#12299;&#20013;&#12300;&#20026;&#23398;&#26085;&#30410;&#65292;&#20026;&#36947;&#26085;&#25439;&#65292;&#25439;&#20043;&#21448;&#25439;&#65292;&#20197;&#33267;&#20110;&#26080;&#20026;&#12301;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8834102?utm_campaign=in_app_share&amp;utm_medium=iOS&amp;utm_source=pocket">&#32534;&#31243;&#21040;&#24213;&#26159;&#19981;&#26159;&#26377;&#25216;&#26415;&#21547;&#37327;&#30340;&#19996;&#35199;&#21602;&#65311;&#20063;&#26159;&#20063;&#19981;&#26159;</a></p></li>
<li><p><a href="http://daily.zhihu.com/story/8839953">&#27542;&#27665;&#28779;&#26143;&#65311;&#20234;&#38534; &#183; &#39532;&#26031;&#20811;&#32473;&#20986;&#20102;&#20840;&#22871;&#26041;&#26696;</a></p></li>
<li><dl>
<dt><a href="http://mp.weixin.qq.com/s?__biz=MjM5ODMzMDMyMw==&amp;mid=2653161903&amp;idx=1&amp;sn=ec7470691feed7d9189b30bc9798de51">&#20013;&#22269;&#26368;&#32654;&#22823;&#23398;&#25490;&#34892;&#27036;2016</a> <code class="fold">@</code></dt>
<dd><p>9 &#26376; 10 &#26085;&#20940;&#26216; 1 &#28857;&#65292;&#27494;&#22823;&#24037;&#23398;&#37096;&#20027;&#25945;&#23398;&#27004;&#8220;&#21464;&#24418;&#37329;&#21018;&#8221;&#22312;&#25237;&#20837;&#20351;&#29992; 16 &#24180;&#21518;&#29190;&#30772;&#25286;&#38500;&#65292;&#21407;&#22240;&#21482;&#26159;&#25945;&#23398;&#27004;&#36807;&#20110;&#8220;&#39640;&#22823;&#19978;&#8221;&#65292;&#31435;&#22312;&#19996;&#28246;&#36793;&#19978;&#26377;&#30861;&#35266;&#30651;&#12290;&#32791;&#36164; 1300 &#19975;&#20803;&#30340;&#29190;&#30772;&#25286;&#38500;&#24037;&#31243;&#65292;&#21482;&#26159;&#20026;&#20102;&#22797;&#21407;&#19996;&#28246;&#21335;&#23736;&#29662;&#29640;&#23665;&#20248;&#32654;&#30340;&#33258;&#28982;&#22825;&#38469;&#32447;&#65281;&#27494;&#22823;&#23545;&#32654;&#30340;&#25191;&#30528;&#65292;&#36817;&#20046;&#20219;&#24615;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="https://education.github.com/pack">Learn How to Code Using the Student Developer Pack - GitHub Education</a></p></li>
<li><p><a href="http://www.jianshu.com/p/d5c6b9198907">&#30693;&#20046;&#31461;&#29814;&#35784;&#39575;&#65292;&#20165;&#26159;&#28418;&#20142;&#37027;&#20040;&#31616;&#21333;&#65311; - &#31616;&#20070;</a></p></li>
<li><p><a href="https://justyy.com/">&#23567;&#36182;&#23376;&#30340;&#33521;&#22269;&#29983;&#27963;&#21644;&#36164;&#35759;, &#23454;&#29992;&#21487;&#38752;&#30340;&#33521;&#22269;&#29983;&#27963;&#32463;&#39564;</a></p></li>
<li><dl>
<dt><a href="http://www.jianshu.com/p/43ef41933634">&#38889;&#22269;&#20154;&#35828;&#33521;&#35821; - &#31616;&#20070;</a> <code class="fold">@</code></dt>
<dd><p>&#35201;&#25214;&#20572;&#36710;&#22330;&#30340;&#26102;&#20505;&#65292;&#32769;&#23454;&#24052;&#20132;&#30340;&#20182;&#35828;&#20102;&#19968;&#21477;&#65306;</p>
<blockquote>
<p>&#35753;&#25105;&#20204;&#21435; fucking area &#21543;&#12290;</p>
</blockquote>
<p>&#36710;&#37324;&#31361;&#28982;&#23433;&#38745;&#19979;&#26469;&#12290;</p>
<p>&#26049;&#36793;&#19968;&#20010;&#22899;&#29983;&#23567;&#24515;&#32764;&#32764;&#22320;&#38382;&#65306;</p>
<blockquote>
<p>&#20320;&#35828;&#30340;&#26159; parking area &#21543;&#8230;&#8230;</p>
</blockquote>
<p>&#19968;&#20010;&#24503;&#22269;&#21516;&#23398;&#24525;&#19981;&#20303;&#21704;&#21704;&#22823;&#31505;&#65306;&#20320;&#20204;&#38889;&#22269;&#20154;&#20026;&#20160;&#20040;&#35201;&#25343; p &#26469;&#20195;&#26367; f &#21602;&#65311;&#36825;&#20004;&#20010;&#38899;&#38590;&#36947;&#26377;&#20160;&#20040;&#30456;&#20284;&#20043;&#22788;&#21527;&#65311;</p>
<p>&#20854;&#23454;&#24503;&#35821;&#20063;&#32463;&#24120;&#25226; p &#21644; f &#25918;&#19968;&#36215;&#36830;&#30528;&#21457;&#38899;&#65292;&#20160;&#20040; Apfel&#65288;&#33529;&#26524;&#65289;&#65292;Pferd&#65288;&#39532;&#65289;&#65292; Pfand&#65288;&#25276;&#37329;&#65289;&#8230;&#8230;&#32780;&#19988;&#65292;&#19968;&#20123;&#33521;&#35821;&#21333;&#35789;&#37324;&#30340; v f &#25442;&#25104; p b &#23601;&#21464;&#25104;&#20102;&#24503;&#35821;&#21333;&#35789;&#65292;&#27604;&#22914; silver &#25913;&#25104; silber&#8230;&#8230;</p>
<p>&#20316;&#20026;&#20960;&#21315;&#24180;&#26469;&#30340;&#32769;&#22823;&#21733;&#65292;&#30475;&#21040;&#23567;&#24351;&#34987;&#24503;&#22269;&#20154;&#22066;&#24324;&#65292;&#25105;&#24525;&#19981;&#20303;&#21453;&#21767;&#30456;&#35749;&#65292;&#25226;&#19978;&#38754;&#36825;&#20123;&#19968;&#19968;&#32599;&#21015;&#12290;&#24503;&#22269;&#21516;&#23398;&#24819;&#20102;&#24819;&#65292;&#19981;&#21553;&#22768;&#20102;&#12290;&#25105;&#33258;&#35273;&#26377;&#20123;&#20914;&#21160;&#65292;&#36825;&#25165;&#21457;&#29616;&#65292;&#25105;&#19979;&#24847;&#35782;&#37324;&#26159;&#30495;&#25226;&#38889;&#22269;&#24403;&#20316;&#20013;&#22269;&#30340;&#19968;&#20010;&#30465;&#20102;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="https://www.zhihu.com/question/28214095">&#32534;&#31243;&#26159;&#21542;&#35813;&#20316;&#20026;&#22522;&#30784;&#25945;&#32946;&#30340;&#19968;&#37096;&#20998;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.v2ex.com/t/310433#reply0">&#22269;&#24198;&#25784;&#20102;&#19968;&#31687;&#25991;&#31456;&#65292; Git &#30340;&#26680;&#24515;&#27010;&#24565;&#65292;&#26395; V &#21451;&#22823;&#31070;&#20204;&#25351;&#27491; - V2EX</a></p></li>
<li><p><a href="https://www.douban.com/note/584709170/">&#29579;&#36335;&#65306;&#27785;&#20303;&#27668;&#65292;&#21507;&#30828;&#39277;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzA5MTEzNzE2Mw==&amp;mid=2648789586&amp;idx=1&amp;sn=1c4dccda1dd3a1d62c3f3fcceccc05e2&amp;chksm=881507b6bf628ea0fca766a9ea98a9b2f0d40c2927e303b46fa1ce3b7813d60bc9357fe80987&amp;scene=0#wechat_redirect">&#21490;&#19978;&#26368;&#38590;&#38754;&#35797;&#39064;&#65306;&#8220;&#20320;&#26377;&#20160;&#20040;&#35201;&#38382;&#25105;&#30340;&#21527;&#8220;</a></p></li>
<li><p><a href="http://mt.sohu.com/20161002/n469536003.shtml">Java &#20043;&#29238;&#27714;&#32844;&#34987;&#23244;&#24180;&#32426;&#22823;: &#31243;&#24207;&#21592;&#21507;&#38738;&#26149;&#39277; - &#25628;&#29392;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/20258870">&#20026;&#20160;&#20040;&#27494;&#27721;&#30041;&#19981;&#20303;&#20154;&#25165;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MjM5NzE2NTY0Ng==&amp;mid=2650672702&amp;idx=1&amp;sn=3923cbc370e818777a4c69c3dd0a3220&amp;scene=4#wechat_redirect">&#34987;&#21106;&#35010;&#30340;&#21271;&#19978;&#24191;&#28145;&#65288;&#19979;&#65289;&#8212;&#8212;&#20174;&#35201;&#21629;&#30340;&#25151;&#31199;&#35828;&#36215;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MjM5NzE2NTY0Ng==&amp;mid=402345108&amp;idx=1&amp;sn=b41b60214c36cfb20e9a05e9d2a35704&amp;scene=4#wechat_redirect">&#39640;&#32771;&#65292;&#31038;&#20250;&#20844;&#24179;&#30340;&#26368;&#21518;&#19968;&#22359;&#36974;&#32670;&#24067;&#21644;&#33268;&#24187;&#21058;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/26601722/answer/73254896">&#22914;&#20309;&#20174;&#20154;&#31867;&#23398;&#30340;&#35282;&#24230;&#30475;&#24453;&#31038;&#20250;&#30340;&#36139;&#23500;&#24046;&#36317;&#65311; - &#36213;&#30355;&#38451;&#30340;&#22238;&#31572; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://zhuanlan.zhihu.com/p/20725914">&#20010;&#20154;&#30340;&#21162;&#21147;&#22312;&#26102;&#20195;&#30340;&#36827;&#27493;&#38754;&#21069;&#19981;&#20540;&#19968;&#25552; - bhuztez&#30340;&#25991;&#31456; - &#30693;&#20046;&#19987;&#26639;</a></p></li>
<li><p><a href="https://www.douban.com/note/584580607/">&#26426;&#22120;&#32763;&#35793;&#23558;&#20248;&#21270;&#24182;&#25193;&#22823;&#32763;&#35793;&#24066;&#22330;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/22426910">&#20026;&#20160;&#20040;&#26377;&#20123;&#20154;&#38656;&#35201;&#20202;&#24335;&#24863;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MzI3MTA0MTk1MA==&amp;mid=2651987558&amp;idx=1&amp;sn=0a7b78e1b54747c869b9e5ef190b0a13&amp;chksm=f1216a97c656e38128942e7f822b36be5d4ea763ea0cab4a7f3c1ece9c148a568b4812f52087&amp;scene=0#wechat_redirect">&#12304;&#37325;&#30917;&#12305;&#35895;&#27468;&#21457;&#24067;Open Images&#22270;&#29255;&#25968;&#25454;&#38598;&#65292;&#21253;&#21547;9&#30334;&#19975;&#26631;&#27880;&#22270;&#29255;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/48747088">&#24590;&#26679;&#35780;&#20215;&#38889;&#22269;&#30005;&#24433;&#12298;&#37340;&#23665;&#34892;&#12299;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.douban.com/people/xiaohanyu/status/1896675394/">xiaohanyu&#30340;&#24191;&#25773;</a></p></li>
<li><p><a href="http://cn.bing.com/search?q=VMware+Fusion+&amp;qs=n&amp;form=QBLH&amp;pq=vmware+fusion+&amp;sc=8-14&amp;sp=-1&amp;sk=&amp;cvid=5536EC7F92FD43519C55424E83D994EC">VMware Fusion - &#24517;&#24212;</a></p></li>
<li><p><a href="http://www.vmware.com/products/fusion.html">Mac Virtualization for Everyone: VMware Fusion</a></p></li>
<li><p><a href="http://buyersguide.macrumors.com/">iPhone, iPad, Mac Buyer&#8217;s Guide: Know When to Buy</a></p></li>
<li><p><a href="https://www.zhihu.com/question/29693016">&#20114;&#32852;&#32593;&#27714;&#32844;&#36335;&#19978;&#65292;&#20320;&#35265;&#36807;&#21738;&#20123;&#20889;&#24471;&#24456;&#22909;&#12289;&#24456;&#29992;&#24515;&#30340;&#38754;&#32463;&#65311;&#26368;&#22909;&#33021;&#20998;&#20139;&#33258;&#24049;&#30340;&#38754;&#32463;&#12289;&#24515;&#36335;&#21382;&#31243;&#12290; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://www.vice.cn/read/munchies-xinjiang-baozi-bbq">&#22823;&#21416;&#23567;&#21507;&#65372;&#26032;&#30086;&#28900;&#21253;&#23376; | VICE&#20013;&#22269;&#65372;&#20840;&#29699;&#38738;&#24180;&#25991;&#21270;&#20043;&#22768;&#65306;&#19990;&#30028;&#22312;&#19979;&#27785;&#65292;&#25105;&#20204;&#22312;&#29378;&#27426;</a></p></li>
<li><p><a href="https://www.douban.com/note/577077451/">&#25105;&#36319;&#19968;&#20010;10&#23681;&#30340;&#23567;&#22993;&#23064;&#32842;&#20102;&#32842;&#22825;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MjM5MDA1ODAzMg==&amp;mid=2651061961&amp;idx=1&amp;sn=3ef0260f09cb09e51c347db948d23a05&amp;chksm=bdbdcd968aca44806fc0fb5af401cddf8cb624abf690ee52ed0fc84ec1dce8e55634193daf48&amp;scene=2&amp;srcid=0926512G4zp5bkM2pkTv96T9&amp;from=timeline&amp;isappinstalled=0#wechat_redirect">GQ&#25253;&#36947; | &#32822;&#40065;&#26449;&#23448;&#31206;&#29605;&#39134;&#65306;&#26435;&#21147;&#30340;&#23616;&#22806;&#20154;</a></p></li>
<li><p><a href="http://ouonline.net/object-oriented-programming-in-c">O &#30340;&#31508;&#35760; &#187; c &#35821;&#35328;&#23454;&#29616;&#23553;&#35013;&#65292;&#32487;&#25215;&#21644;&#22810;&#24577;</a></p></li>
<li><p><a href="http://mp.weixin.qq.com/s?__biz=MjM5OTQ2MzM5Mg==&amp;mid=2663110061&amp;idx=2&amp;sn=009daf2a304e41e8a7b863a25ea68ec5&amp;scene=7#wechat_redirect">&#33521;&#35821;&#23383;&#27597;&#20160;&#20040;&#26102;&#20505;&#19981;&#21457;&#38899;</a></p></li>
<li><p><a href="http://terrytai.me/how-to-begin-soho-1/">&#22914;&#20309;&#24320;&#22987;&#20320;&#30340; SOHO &#20043;&#26053;&#160;(1) - Terr Tai&#8217;s Blog</a></p></li>
<li><p><a href="https://zhuanlan.zhihu.com/p/22625628">&#12300;&#20195;&#30721;&#23478;&#12301;&#30340;&#23398;&#20064;&#36807;&#31243;&#21644;&#23398;&#20064;&#32463;&#39564;&#20998;&#20139; - &#35203;&#36229;&#24093;&#22269;&#20852;&#20129;&#21490; - &#36328;&#36234;&#32654;&#21033;&#22362;&amp;&#25216;&#26415;&#31934;&#36827;&#20043;&#36335; - &#30693;&#20046;&#19987;&#26639;</a></p></li>
<li><dl>
<dt><a href="https://www.zhihu.com/question/50324821">&#22899;&#26379;&#21451;&#34987;&#40657;&#20154;&#30041;&#23398;&#29983;&#24863;&#26579;&#33406;&#28363;&#30149;&#65292;&#25105;&#35813;&#24590;&#20040;&#21150;&#65311; - &#30693;&#20046;</a> <code class="fold">@</code></dt>
<dd><p>&#21478;&#22806;&#35828;&#19968;&#21477;&#65292;&#27494;&#22823;&#22899;&#29983;&#34987;&#40657;&#20154;&#20256;&#26579;&#33406;&#28363;&#30340;&#20107;&#20214;&#26089;&#22312;&#21313;&#24180;&#21069;&#65288;&#20855;&#20307;&#35760;&#19981;&#28165;&#20102;&#65289;&#23601;&#21457;&#29983;&#36807;&#65292;&#24403;&#26102;&#37027;&#40657;&#20154;&#22312;&#32769;&#23478;&#36824;&#26377;&#32769;&#23110;&#65292;&#32463;&#23186;&#20307;&#25253;&#36947;&#20043;&#21518;&#24403;&#20107;&#22899;&#29983;&#34920;&#31034;&#33258;&#24049;&#24456;&#20667;&#24456;&#22825;&#30495;&#35892;&#36131;&#28195;&#30007;&#20113;&#20113;<strong>&#33719;&#24471;&#20102;&#24191;&#27867;&#30340;&#21516;&#24773;</strong>&#12290;</p>
<p>&#27809;&#24517;&#35201; &#22914;&#26524;&#35828;&#20320;&#24515;&#30140;&#25105;&#20204;&#25630;&#19981;&#21040;&#36825;&#31181; &#40657;&#20154;&#19968;&#26469;&#23601;&#33021;&#25630;&#19971;&#20843;&#20010;&#30340;&#22899;&#20154; &#37027;&#22823;&#21487;&#19981;&#24517; <strong>&#25105;&#23425;&#24895;&#20080;&#22359;&#29482;&#32905;&#25366;&#20010;&#30524;</strong> &#20063;&#19981;&#20250;&#30475;&#19968;&#30524;&#37027;&#19971;&#20843;&#20010;&#22899;&#20154;</p>
<p>Orz&#8230;</p>
</dd>
</dl></li>
<li><dl>
<dt><a href="https://zhuanlan.zhihu.com/p/22218563">2017 &#20114;&#32852;&#32593;&#26657;&#25307;&#65292;&#20004;&#20010;&#24494;&#22937;&#30340;&#21464;&#21270;&#22312;&#21457;&#29983; - &#31616;&#23547; - &#30693;&#20046;&#19987;&#26639;</a> <code class="fold">@</code></dt>
<dd><p>&#32780;&#20170;&#24180;&#65292;&#33150;&#35759;&#29978;&#33267;&#26089;&#22312;5&#26376;&#65292;&#23601;&#23637;&#24320;&#36807;&#38024;&#23545; 2017 &#23626;&#27605;&#19994;&#29983;&#30340;&#25552;&#21069;&#25209;&#26657;&#25307;&#27963;&#21160;&#65292;&#29983;&#21160;&#28436;&#31034;&#20102;&#34181;&#32650;&#27611;&#35201;&#20174;&#22823;&#19977;&#24320;&#22987;&#30340;&#27491;&#30830;&#20570;&#27861;&#12290;</p>
<p>&#20174;&#20960;&#23478;&#22823;&#30340;&#20114;&#32852;&#32593;&#20844;&#21496;&#21487;&#20197;&#26126;&#26174;&#30475;&#20986;&#65292;&#22823;&#23478;&#23545;&#20154;&#21592;&#35843;&#25972;&#30340;&#33410;&#22863;&#26159;&#19968;&#33268;&#30340;&#65306;&#21363;&#65292;&#32553;&#20943;&#26222;&#36890;&#23703;&#20301;&#65292;&#21560;&#24341;&#39030;&#23574;&#20154;&#25165;&#12290;</p>
</dd>
</dl></li>
<li><p><a href="https://www.zhihu.com/question/48635051?from=profile_question_card">2017 &#26657;&#25307;&#65292;&#26368;&#20540;&#24471;&#21152;&#20837;&#30340;&#20844;&#21496;&#26377;&#21738;&#20123;&#65311; - &#30693;&#20046;</a></p></li>
<li><p><a href="http://www.macrumors.com/2016/09/12/microsoft-surface-pro-4-ad-again/">Microsoft&#8217;s Latest Anti-MacBook Ad Focuses on Surface Pro 4&#8217;s Touchscreen - Mac Rumors</a></p></li>
<li><p><a href="https://www.zhihu.com/topic/19643541/top-answers">ThoughtWorks - &#35805;&#39064;&#31934;&#21326; - &#30693;&#20046;</a></p></li>
<li><p><a href="https://www.zhihu.com/question/51878690">&#21508;&#20301;&#21069;&#36744;&#36807;&#26469;&#20154;&#65292;&#20320;&#24590;&#20040;&#36873;&#25321;&#20154;&#29983;&#31532;&#19968;&#20010;&#24037;&#20316;&#65311;Thoughtworks vs &#21435;&#21738;&#20799;&#32593;&#65311; - &#30693;&#20046;</a></p></li>
</ul>
<script src="../lazyload.min.js"></script>
<script src="../jquery-3.0.0.min.js"></script>
<script src="../jquery.idTabs.min.js"></script>
<script src="../egg.min.js"></script>
<script src="../clipboard.min.js"></script>
<script src="../notes.js"></script>
</body>
</html>
