<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title>&#22270;&#28789;&#30340;&#20809;&#29615;</title>
  <style type="text/css">code{white-space: pre;}</style>
</head>
<body>
<div id="header">
<h1 class="title">&#22270;&#28789;&#30340;&#20809;&#29615;</h1>
</div>
<h1 id="&#22270;&#28789;&#30340;&#20809;&#29615;">&#22270;&#28789;&#30340;&#20809;&#29615;</h1>
<p>&#20223;&#20315;&#20840;&#19990;&#30028;&#30340;&#20154;&#37117;&#30693;&#36947;&#65292;&#22270;&#28789;&#65288;Alan Turing&#65289;&#26159;&#20010;&#22825;&#25165;&#65292;&#26159;&#20182;&#21019;&#36896;&#20102;&#35745;&#31639;&#26426;&#31185;&#23398;&#65292;&#26159;&#20182;&#30772;&#35299;&#20102;&#24503;&#22269;&#32435;&#31929;&#30340;Enigma&#23494;&#30721;&#12290;&#30001;&#20110;&#20182;&#30340;&#26480;&#20986;&#36129;&#29486;&#65292;&#35745;&#31639;&#26426;&#31185;&#23398;&#30340;&#26368;&#39640;&#33635;&#35465;&#65292;&#34987;&#21483;&#20570;&#8220;&#22270;&#28789;&#22870;&#8221;&#12290;&#28982;&#32780;&#26681;&#25454;&#33258;&#24049;&#19968;&#30452;&#20197;&#26469;&#23545;&#22270;&#28789;&#26426;&#31561;&#35745;&#31639;&#27169;&#22411;&#30340;&#30475;&#27861;&#65292;&#21152;&#19978;&#19968;&#20123;&#21382;&#21490;&#36164;&#26009;&#65292;&#25105;&#21457;&#29616;&#22270;&#28789;&#26412;&#20154;&#30340;&#23454;&#38469;&#25104;&#23601;&#65292;&#30456;&#23545;&#20110;&#20182;&#25152;&#21463;&#21040;&#30340;&#23815;&#25308;&#65292;&#20854;&#23454;&#30456;&#24046;&#29978;&#36828;&#12290;</p>
<p>&#30001;&#20110;&#20108;&#25112;&#20197;&#26469;&#21508;&#22269;&#25919;&#24220;&#23545;&#20110;&#24403;&#26102;&#35853;&#25253;&#24037;&#20316;&#30340;&#20445;&#23494;&#25514;&#26045;&#36896;&#25104;&#30340;&#20107;&#23454;&#28151;&#28102;&#65292;&#20877;&#21152;&#19978;&#22270;&#28789;&#30340;&#19981;&#24184;&#29983;&#19990;&#25152;&#24341;&#26469;&#30340;&#21516;&#24773;&#65292;&#22270;&#28789;&#36825;&#20010;&#21517;&#23383;&#20284;&#20046;&#25317;&#26377;&#20102;&#19968;&#31181;&#25169;&#26388;&#36855;&#31163;&#30340;&#20809;&#29615;&#12290;&#20154;&#20204;&#25226;&#24456;&#22810;&#26412;&#26469;&#19981;&#26159;&#22270;&#28789;&#20316;&#20986;&#30340;&#36129;&#29486;&#24402;&#32467;&#22312;&#20182;&#36523;&#19978;&#65292;&#25226;&#26412;&#26469;&#24456;&#24179;&#24120;&#30340;&#36129;&#29486;&#36807;&#20998;&#22320;&#22840;&#22823;&#12290;&#22270;&#28789;&#30340;&#20809;&#29615;&#65292;&#25513;&#30422;&#20102;&#35768;&#22810;&#23545;&#36825;&#20123;&#39046;&#22495;&#20570;&#20986;&#36807;&#26356;&#21152;&#37325;&#35201;&#36129;&#29486;&#30340;&#20154;&#12290;&#22270;&#28789;&#20256;</p>
<p>2012&#24180;&#65292;&#22312;&#22270;&#28789;&#35806;&#36784;&#19968;&#30334;&#21608;&#24180;&#30340;&#26102;&#20505;&#65292;&#20154;&#20204;&#39118;&#39118;&#28779;&#28779;&#30340;&#21484;&#24320;&#21508;&#31181;&#22823;&#20250;&#65292;&#32426;&#24565;&#36825;&#20301;&#8220;&#35745;&#31639;&#26426;&#20043;&#29238;&#8221;&#65292;&#24456;&#22810;&#23186;&#20307;&#20063;&#28155;&#27833;&#21152;&#37259;&#22320;&#23459;&#20256;&#20182;&#30340;&#20016;&#21151;&#20255;&#32489;&#12290;&#36824;&#26377;&#20010;&#21483;Andrew Hodges&#30340;&#20154;&#65292;&#25235;&#20303;&#36825;&#20010;&#26102;&#26426;&#25512;&#38144;&#33258;&#24049;&#20889;&#30340;&#19968;&#26412;&#20256;&#35760;&#65292;&#21483;&#20570;&#12298;Alan Turing: The Enigma&#12299;&#12290;&#36825;&#26412;&#20070;&#32418;&#26497;&#19968;&#26102;&#65292;&#21518;&#26469;&#36824;&#34987;&#25913;&#32534;&#25104;&#20102;&#30005;&#24433;&#12290;</p>
<p>&#36825;&#26412;&#20256;&#35760;&#30475;&#20284;&#23458;&#35266;&#65292;&#24341;&#32463;&#25454;&#20856;&#65292;&#23383;&#37324;&#34892;&#38388;&#21364;&#21487;&#20197;&#24863;&#21463;&#21040;&#20316;&#32773;&#23545;&#22270;&#28789;&#20010;&#20154;&#30340;&#33180;&#25308;&#21644;&#20559;&#34962;&#65292;&#20182;&#22312;&#20542;&#24515;&#25171;&#36896;&#19968;&#20010;&#8220;&#22825;&#25165;&#8221;&#12290;&#20316;&#32773;&#29255;&#38754;&#22320;&#20351;&#29992;&#23545;&#22270;&#28789;&#26377;&#21033;&#30340;&#35777;&#25454;&#65292;&#23545;&#19981;&#21033;&#30340;&#26041;&#38754;&#21482;&#23383;&#19981;&#25552;&#12290;&#20223;&#20315;&#22270;&#28789;&#20570;&#30340;&#19968;&#20999;&#37117;&#26159;&#26377;&#29702;&#30340;&#65292;&#20182;&#20570;&#30340;&#19981;&#22909;&#30340;&#22320;&#26041;&#37117;&#26159;&#22240;&#20026;&#21035;&#20154;&#30340;&#38382;&#39064;&#65292;&#25110;&#32773;&#39118;&#27700;&#19981;&#22909;&#12290;&#25552;&#21040;&#21035;&#20154;&#20570;&#30340;&#19996;&#35199;&#65292;&#23613;&#26159;&#21508;&#31181;&#32570;&#38519;&#21644;&#23616;&#38480;&#24615;&#65292;&#19981;&#26159;&#32570;&#38519;&#20063;&#35201;&#35828;&#25104;&#26159;&#32570;&#38519;&#65307;&#25552;&#21040;&#22270;&#28789;&#30340;&#24037;&#20316;&#65292;&#24635;&#26159;&#21490;&#26080;&#21069;&#20363;&#65292;&#24320;&#22825;&#36767;&#22320;&#30340;&#21457;&#26126;&#12290;&#21035;&#20154;&#20808;&#20570;&#20986;&#26469;&#30340;&#19996;&#35199;&#65292;&#29983;&#25289;&#30828;&#25341;&#65292;&#30828;&#35201;&#35828;&#25104;&#26159;&#21463;&#20102;&#22270;&#28789;&#30340;&#8220;&#21551;&#21457;&#8221;&#65292;&#36824;&#24618;&#21035;&#20154;&#27809;&#26377;&#24341;&#29992;&#22270;&#28789;&#30340;&#35770;&#25991;&#12290;&#36825;&#35753;&#20320;&#24863;&#35273;&#20223;&#20315;&#21035;&#20154;&#37117;&#22312;&#25220;&#34989;&#22270;&#28789;&#20255;&#22823;&#30340;&#30740;&#31350;&#25104;&#26524;&#65292;&#37117;&#22312;&#21033;&#29992;&#20182;&#65292;&#27450;&#36127;&#20182;&#20284;&#30340;&#12290;&#22914;&#26524;&#20320;&#19981;&#24819;&#33457;&#38065;&#20080;&#20070;&#65292;&#21487;&#20197;&#30475;&#30475;&#21516;&#19968;&#20316;&#32773;&#20889;&#30340;&#19968;&#20010;&#22270;&#28789;&#31616;&#35201;&#29983;&#24179;&#65292;&#36275;&#20197;&#20174;&#20013;&#24863;&#21463;&#21040;&#36825;&#31181;&#20542;&#21521;&#12290;</p>
<p>&#25105;&#20889;&#36825;&#31687;&#25991;&#31456;&#30340;&#24456;&#22823;&#19968;&#37096;&#20998;&#21407;&#22240;&#65292;&#23601;&#26159;&#22240;&#20026;&#36825;&#26412;&#20256;&#35760;&#12290;&#20316;&#32773;&#23545;&#22270;&#28789;&#36129;&#29486;&#30340;&#29255;&#38754;&#22840;&#22823;&#65292;&#23545;&#20854;&#20182;&#19968;&#20123;&#23398;&#32773;&#30340;&#21464;&#30456;&#36140;&#20302;&#65292;&#35753;&#25105;&#24863;&#21040;&#19981;&#24179;&#12290;&#22270;&#28789;&#22312;&#35745;&#31639;&#26426;&#30028;&#30340;&#21517;&#22768;&#65292;&#26412;&#26469;&#23601;&#24050;&#32463;&#34987;&#20005;&#37325;&#30340;&#22840;&#22823;&#21644;&#32654;&#21270;&#65292;&#34987;&#24456;&#22810;&#20154;&#30450;&#30446;&#30340;&#23815;&#25308;&#12290;&#29616;&#22312;&#20986;&#20102;&#36825;&#26412;&#20256;&#35760;&#21644;&#30005;&#24433;&#65292;&#21448;&#22312;&#20154;&#20204;&#24515;&#20013;&#21152;&#37325;&#20102;&#36825;&#23618;&#35823;&#35299;&#12290;&#25152;&#20197;&#25105;&#35273;&#24471;&#26377;&#24517;&#35201;&#28548;&#28165;&#19968;&#20123;&#20107;&#23454;&#65292;&#35753;&#20154;&#20204;&#19981;&#20877;&#34987;&#36855;&#24785;&#12290;&#23494;&#30721;&#23398;</p>
<p>&#24456;&#22810;&#20154;&#25552;&#21040;&#20108;&#25112;Enigma&#23494;&#30721;&#30340;&#25925;&#20107;&#65292;&#23601;&#20250;&#25226;&#21151;&#21171;&#19968;&#32929;&#33041;&#22320;&#24402;&#21040;&#22270;&#28789;&#22836;&#19978;&#65292;&#21482;&#23383;&#19981;&#25552;&#20854;&#20182;&#20154;&#12290;&#20854;&#23454;&#21602;&#65292;&#30772;&#35299;Enigma&#23494;&#30721;&#26159;&#24456;&#22810;&#20154;&#20849;&#21516;&#21162;&#21147;&#30340;&#32467;&#26524;&#65292;&#22270;&#28789;&#21482;&#26159;&#20854;&#20013;&#30340;&#19968;&#21592;&#12290;&#36825;&#20854;&#20013;&#22909;&#20123;&#20154;&#30340;&#24819;&#27861;&#26089;&#20110;&#22270;&#28789;&#65292;&#21551;&#21457;&#36807;&#22270;&#28789;&#65292;&#36129;&#29486;&#27604;&#22270;&#28789;&#30340;&#22823;&#65292;&#35774;&#35745;&#30340;&#19996;&#35199;&#27604;&#22270;&#28789;&#30340;&#20808;&#36827;&#65292;&#21364;&#24456;&#23569;&#26377;&#20154;&#21548;&#35828;&#36807;&#20182;&#20204;&#30340;&#21517;&#23383;&#12290;&#35770;&#26234;&#21147;&#21644;&#36129;&#29486;&#65292;&#22270;&#28789;&#22312;&#20854;&#20013;&#21482;&#26159;&#20013;&#31561;&#27700;&#24179;&#65292;&#26368;&#21518;&#35828;&#36215;&#26469;&#20498;&#22909;&#20687;&#26159;&#20182;&#21333;&#26538;&#21305;&#39532;&#25327;&#25937;&#20102;&#22823;&#23478;&#65292;&#36825;&#26159;&#19981;&#20844;&#24179;&#30340;&#12290;</p>
<p>&#26368;&#21021;&#30772;&#25481;Enigma&#23494;&#30721;&#30340;&#65292;&#20854;&#23454;&#19981;&#26159;&#33521;&#22269;&#20154;&#65292;&#32780;&#26159;&#27874;&#20848;&#20154;&#12290;&#27874;&#20848;&#20154;&#19981;&#20294;&#25130;&#33719;&#24182;&#19988;&#20223;&#36896;&#20102;&#24503;&#22269;&#20154;&#30340;Enigma&#26426;&#22120;&#65292;&#32780;&#19988;&#21457;&#29616;&#20102;&#20854;&#20013;&#24494;&#22937;&#30340;&#28431;&#27934;&#65292;&#21457;&#26126;&#20102;&#19968;&#31181;&#29992;&#20110;&#35299;&#23494;&#30340;&#26426;&#22120;&#21483;&#20570;BOMBA&#65292;&#20197;&#21450;&#19968;&#31181;&#25163;&#24037;&#30772;&#35299;&#30340;&#26041;&#27861;&#21483;&#20570;Zygalski sheets&#12290;BOMBA&#21487;&#20197;&#22312;&#20004;&#20010;&#23567;&#26102;&#20043;&#20869;&#30772;&#35299;&#25481;Enigma &#23494;&#30721;&#12290;&#27874;&#20848;&#20154;&#19968;&#22768;&#19981;&#21549;&#22320;&#31363;&#21548;&#20102;&#24503;&#22269;&#20154;&#30340;&#36890;&#20449;&#38271;&#36798;&#20845;&#24180;&#21322;&#65292;&#26368;&#21518;&#22312;&#20108;&#25112;&#29190;&#21457;&#21069;&#22805;&#25226;&#36825;&#25216;&#26415;&#36865;&#32473;&#20102;&#33521;&#27861;&#30431;&#21451;&#12290;</p>
<p>BOMBA&#30340;&#24037;&#20316;&#21407;&#29702;&#65292;&#20854;&#23454;&#23601;&#26159;&#27169;&#25311;&#22909;&#20960;&#20010;Enigma&#26426;&#22120;&#65292;&#8220;&#24182;&#21457;&#8221;&#36816;&#36716;&#65292;&#36825;&#26679;&#21487;&#20197;&#21152;&#36895;&#29468;&#20986;&#31192;&#38053;&#12290;&#26368;&#24320;&#22836;&#36825;&#26679;&#36824;&#34892;&#65292;&#20294;&#21518;&#26469;&#24503;&#22269;&#20154;&#25913;&#36827;&#20102;Enigma&#26426;&#22120;&#65292;&#25226;&#21487;&#36873;&#30340;&#40831;&#36718;&#20174;3&#20010;&#22686;&#21152;&#21040;&#20102;5&#20010;&#12290; 5&#36873;3&#65292;&#26377;60&#31181;&#24773;&#20917;&#65292;&#36825;&#26679;&#31192;&#38053;&#30340;&#31354;&#38388;&#22686;&#22823;&#20102;60&#20493;&#12290;&#29702;&#35770;&#19978;BOMBA&#21482;&#35201;&#36816;&#36716;60&#20493;&#22810;&#30340;Enigma&#26426;&#22120;&#65292;&#23601;&#21487;&#20197;&#30772;&#35299;&#36825;&#22686;&#22823;&#30340;&#35299;&#31354;&#38388;&#65292;&#28982;&#32780;&#37027;&#24050;&#32463;&#36229;&#20986;&#20102;&#27874;&#20848;&#30340;&#29289;&#36164;&#21644;&#20154;&#21147;&#12290;&#20877;&#21152;&#19978;&#24503;&#22269;&#20154;&#23601;&#35201;&#25171;&#36807;&#21435;&#65292;&#25152;&#20197;&#27874;&#20848;&#21482;&#22909;&#35831;&#33521;&#27861;&#30431;&#21451;&#24110;&#24537;&#12290;</p>
<p>&#22270;&#28789;&#26368;&#37325;&#35201;&#30340;&#36129;&#29486;&#65292;&#23601;&#26159;&#25913;&#36827;&#27874;&#20848;&#20154;&#30340;BOMBA&#65292;&#35774;&#35745;&#20102;&#19968;&#20010;&#26356;&#22909;&#30340;&#26426;&#22120;&#21483;BOMBE&#12290;BOMBE&#27604;&#36215;BOMBA&#65292;&#20854;&#23454;&#24182;&#27809;&#26377;&#36136;&#30340;&#39134;&#36291;&#65292;&#21482;&#19981;&#36807;BOMBE&#21516;&#26102;&#27169;&#25311;&#30340;Enigma&#26426;&#22120;&#26356;&#22810;&#65292;&#36716;&#30340;&#26356;&#24555;&#12290;&#21478;&#22806;&#23427;&#21152;&#20837;&#20102;&#19968;&#20123;&#8220;&#20248;&#21270;&#8221;&#25514;&#26045;&#65292;&#23613;&#26089;&#25490;&#38500;&#19981;&#21487;&#34892;&#30340;&#36335;&#24452;&#65292;&#25152;&#20197;&#36895;&#24230;&#24555;&#24456;&#22810;&#12290;&#22270;&#28789;&#26368;&#21021;&#30340;&#35774;&#35745;&#65292;&#35201;&#27714;&#24517;&#39035;&#33021;&#22815;&#20107;&#20808;&#29468;&#20986;&#24456;&#38271;&#30340;&#25991;&#26412;&#65292;&#25152;&#20197;&#22522;&#26412;&#19981;&#33021;&#29992;&#12290;&#21518;&#26469;Gordon Welchman&#21457;&#26126;&#20102;&#19968;&#31181;&#30005;&#36335;&#65292;&#21483;&#20570;diagonal board&#65292;&#25165;&#20351;Bombe&#33021;&#22815;&#25237;&#20837;&#23454;&#29992;&#12290;&#20851;&#20110;Gordon Welchman&#30340;&#25925;&#20107;&#65292;&#20320;&#21487;&#20197;&#21442;&#32771;&#36825;&#20010;BBC&#32426;&#24405;&#29255;&#12290;</p>
<p>&#22312;Bombe&#33021;&#22815;&#25237;&#20837;&#20351;&#29992;&#20043;&#21069;&#65292;&#26377;&#19968;&#20010;&#21483;John Herivel&#30340;&#20154;&#65292;&#21457;&#29616;&#20102;&#19968;&#31181;&#29305;&#27530;&#30340;&#25216;&#24039;&#65292;&#21483;&#20570; Herivel tip&#65292;&#36825;&#31181;&#25216;&#26415;&#22312;Bombe&#25237;&#20837;&#20351;&#29992;&#20043;&#21069;&#20960;&#20010;&#26376;&#23601;&#24050;&#32463;&#25237;&#20837;&#23454;&#29992;&#65292;&#30772;&#35299;&#25481;&#24456;&#22810;&#24503;&#20891;&#30340;&#28040;&#24687;&#65292;&#31435;&#19979;&#27735;&#39532;&#21151;&#21171;&#12290;&#22914;&#26524;Herivel tip&#27809;&#26377;&#34987;&#21457;&#26126;&#65292;&#30431;&#20891;&#21487;&#33021;&#22312;1940&#24180;5&#26376;&#23601;&#24050;&#32463;&#25112;&#36133;&#65292; BOMBE&#20063;&#23601;&#26681;&#26412;&#27809;&#26426;&#20250;&#27966;&#19978;&#29992;&#22330;&#12290;</p>
<p>&#21516;&#26102;&#22312;Bletchley Park&#65292;&#36824;&#35806;&#29983;&#20102;&#19968;&#21488;&#22823;&#22411;&#21487;&#32534;&#31243;&#30005;&#23376;&#35745;&#31639;&#26426;Colossus&#65292;&#23427;&#26159;&#30001;&#19968;&#20010;&#21483; Tommy Flowers&#30340;&#24037;&#31243;&#24072;&#35774;&#35745;&#30340;&#12290;Colossus&#19981;&#26159;&#29992;&#26469;&#30772;&#35299;Enigma&#23494;&#30721;&#30340;&#65292;&#32780;&#26159;&#29992;&#20110;&#30772;&#35299; Lorenz SZ-40&#12290;&#37027;&#26159;&#19968;&#31181;&#27604;Enigma&#36824;&#35201;&#20808;&#36827;&#30340;&#23494;&#30721;&#26426;&#22120;&#65292;&#29992;&#20110;&#21457;&#36865;&#24076;&#29305;&#21202;&#30340;&#26368;&#39640;&#25351;&#20196;&#12290;</p>
<p>&#24503;&#22269;&#20154;&#21518;&#26469;&#21448;&#25913;&#36827;&#20102;&#20182;&#20204;&#30340;&#36890;&#20449;&#26041;&#24335;&#65292;&#20351;&#29992;&#20102;&#19968;&#31181;&#20855;&#26377;&#22235;&#20010;&#40831;&#36718;&#30340;Enigma&#26426;&#22120;&#12290;&#36825;&#22823;&#22823;&#30340;&#22686;&#21152;&#20102;&#30772;&#35299;&#30340;&#38590;&#24230;&#65292;&#26222;&#36890;&#30340;Bombe&#26426;&#22120;&#20063;&#30772;&#19981;&#20102;&#23427;&#20102;&#12290;&#21518;&#26469;&#26159;Harold Keen&#35774;&#35745;&#20102;&#19968;&#20010;&#21483;&#20570; Mammoth&#30340;&#26426;&#22120;&#65292;&#21518;&#26469;&#21152;&#19978;&#32654;&#22269;&#28023;&#20891;&#30340;&#24110;&#21161;&#65292;&#21046;&#36896;&#20102;&#26356;&#24555;&#30340;Bombe&#65292;&#25165;&#24471;&#20197;&#30772;&#35299;&#12290;</p>
<p>&#25152;&#20197;&#20320;&#30475;&#21040;&#20102;&#65292;&#25152;&#26377;&#36825;&#20123;&#20154;&#30340;&#24037;&#20316;&#21152;&#36215;&#26469;&#65292;&#25165;&#25913;&#21892;&#20102;&#20108;&#25112;&#30340;&#23616;&#38754;&#12290;&#27874;&#20848;&#20154;&#30340;BOMBA&#65292;&#24050;&#32463;&#21253;&#21547;&#20102;&#26368;&#37325;&#35201;&#30340;&#24605;&#24819;&#12290;&#22270;&#28789;&#30340;&#24037;&#20316;&#20854;&#23454;&#26356;&#22810;&#26159;&#37327;&#30340;&#25913;&#36827;&#65292;&#32780;&#19981;&#26159;&#36136;&#30340;&#39134;&#36291;&#12290;&#29616;&#22312;&#24456;&#22810;&#20154;&#21916;&#27426;&#36319;&#39118;&#65292;&#29255;&#38754;&#30340;&#22840;&#22823;&#22270;&#28789;&#22312;&#20854;&#20013;&#30340;&#20316;&#29992;&#65292;&#36825;&#26159;&#19981;&#23545;&#30340;&#12290;&#22914;&#26524;&#20320;&#23545;Enigma&#26426;&#22120;&#30340;&#25216;&#26415;&#32454;&#33410;&#24863;&#20852;&#36259;&#65292;&#21487;&#20197;&#21442;&#32771;&#36825;&#20004;&#20010;&#35270;&#39057;&#65306;[&#35270;&#39057;1][&#35270;&#39057;2]&#12290;&#29702;&#35770;&#35745;&#31639;&#26426;&#31185;&#23398;</p>
<p>&#22270;&#28789;&#34987;&#31216;&#20026;&#8220;&#35745;&#31639;&#26426;&#20043;&#29238;&#8221;&#65292;&#35745;&#31639;&#26426;&#31185;&#23398;&#30028;&#30340;&#26368;&#39640;&#33635;&#35465;&#65292;&#34987;&#21483;&#20570;&#8220;&#22270;&#28789;&#22870;&#8221;&#65288;Turing Award&#65289;&#12290;&#28982;&#32780;&#22914;&#26524;&#20320;&#28145;&#20837;&#30340;&#29702;&#35299;&#20102;&#35745;&#31639;&#29702;&#35770;&#21644;&#31243;&#24207;&#35821;&#35328;&#29702;&#35770;&#23601;&#20250;&#21457;&#29616;&#65292;&#22270;&#28789;&#23545;&#20110;&#29702;&#35770;&#35745;&#31639;&#26426;&#31185;&#23398;&#65292;&#20854;&#23454;&#24182;&#27809;&#20135;&#29983;&#38271;&#36828;&#32780;&#26377;&#30410;&#30340;&#24433;&#21709;&#12290;&#22312;&#26576;&#31181;&#31243;&#24230;&#19978;&#35828;&#65292;&#20182;&#20854;&#23454;&#24110;&#20102;&#19968;&#20010;&#20498;&#24537;&#12290;&#22270;&#28789;&#30340;&#29702;&#35770;&#22797;&#26434;&#19981;&#22570;&#65292;&#32473;&#20154;&#20204;&#36896;&#25104;&#24456;&#22823;&#30340;&#35823;&#23548;&#65292;&#38459;&#30861;&#20102;&#35745;&#31639;&#26426;&#31185;&#23398;&#30340;&#21457;&#23637;&#12290;&#32780;&#19988;&#20182;&#23545;&#20110;&#21457;&#34920;&#35770;&#25991;&#65292;&#23545;&#24453;&#30740;&#31350;&#30340;&#24577;&#24230;&#35753;&#25105;&#24576;&#30097;&#65292;&#25105;&#35273;&#24471;&#22270;&#28789;&#26412;&#20154;&#20854;&#23454;&#23601;&#26159;&#24403;&#20170;&#35745;&#31639;&#26426;&#23398;&#26415;&#30028;&#30340;&#19968;&#20123;&#19981;&#27491;&#20043;&#39118;&#30340;&#40763;&#31062;&#12290;&#22270;&#28789;&#26426;&#21644;lambda&#28436;&#31639;</p>
<p>&#32477;&#22823;&#37096;&#20998;&#35745;&#31639;&#26426;&#19987;&#19994;&#30340;&#20154;&#25552;&#21040;&#22270;&#28789;&#65292;&#23601;&#20250;&#24819;&#36215;&#22270;&#28789;&#26426;&#65288;Turing Machine&#65289;&#12290;&#31245;&#24494;&#26377;&#28857;&#30740;&#31350;&#30340;&#20154;&#65292;&#21487;&#33021;&#30693;&#36947;&#22270;&#28789;&#26426;&#19982;lambda&#28436;&#31639;&#22312;&#35745;&#31639;&#33021;&#21147;&#19978;&#30340;&#31561;&#20215;&#24615;&#12290;&#28982;&#32780;&#22312;&#8220;&#35745;&#31639;&#33021;&#21147;&#8221;&#19978;&#31561;&#20215;&#65292;&#24182;&#19981;&#31561;&#20110;&#35828;&#23427;&#20204;&#20855;&#26377;&#21516;&#26679;&#30340;&#20215;&#20540;&#65292;&#38543;&#20415;&#29992;&#21738;&#20010;&#37117;&#26080;&#25152;&#35859;&#12290;&#31185;&#23398;&#30740;&#31350;&#26377;&#19968;&#26465;&#36890;&#29992;&#30340;&#21407;&#21017;&#65306;&#22914;&#26524;&#22810;&#20010;&#29702;&#35770;&#21487;&#20197;&#35299;&#37322;&#21516;&#26679;&#30340;&#29616;&#35937;&#65292;&#21462;&#26368;&#31616;&#21333;&#30340;&#19968;&#20010;&#12290;&#34429;&#28982;lambda&#28436;&#31639;&#21644;&#22270;&#28789;&#26426;&#33021;&#34920;&#36798;&#21516;&#26679;&#30340;&#29702;&#35770;&#65292;&#21364;&#27604;&#22270;&#28789;&#26426;&#31616;&#21333;&#65292;&#20248;&#38597;&#65292;&#23454;&#29992;&#24456;&#22810;&#12290;</p>
<p>&#35745;&#31639;&#29702;&#35770;&#65288;Theory of Computation&#65289;&#36825;&#20010;&#39046;&#22495;&#65292;&#20854;&#23454;&#26159;&#34987;&#22270;&#28789;&#26426;&#32473;&#22797;&#26434;&#21270;&#20102;&#12290;&#22270;&#28789;&#26426;&#30340;&#35774;&#35745;&#26159;&#19985;&#38475;&#65292;&#22797;&#26434;&#65292;&#32570;&#20047;&#21407;&#21017;&#30340;&#12290;&#23427;&#30340;&#35835;&#20889;&#22836;&#65292;&#32440;&#24102;&#65292;&#29366;&#24577;&#65292;&#25805;&#20316;&#65292;&#25226;&#26412;&#26469;&#24456;&#31616;&#21333;&#30340;&#35821;&#20041;&#25630;&#24471;&#24322;&#24120;&#22797;&#26434;&#12290;&#22270;&#28789;&#26426;&#30340;&#35835;&#20889;&#20004;&#31181;&#25805;&#20316;&#21516;&#26102;&#21457;&#29983;&#65292;&#36825;&#24688;&#22909;&#26159;&#32534;&#31243;&#19978;&#26368;&#24524;&#35763;&#30340;&#19968;&#31181;&#38169;&#35823;&#65292;&#31867;&#20284;&#20110;C&#35821;&#35328;&#30340;i++&#12290;&#22270;&#28789;&#26426;&#26159;&#22914;&#27492;&#30340;&#22797;&#26434;&#21644;&#28151;&#28102;&#65292;&#20197;&#33267;&#20110;&#20320;&#24456;&#38590;&#30475;&#20986;&#23427;&#21040;&#24213;&#35201;&#24178;&#20160;&#20040;&#65292;&#20063;&#24456;&#38590;&#29992;&#23427;&#28165;&#26224;&#22320;&#34920;&#36798;&#33258;&#24049;&#30340;&#24847;&#24605;&#12290;&#36825;&#23601;&#26159;&#20026;&#20160;&#20040;&#27599;&#20010;&#20154;&#19978;&#8220;&#35745;&#31639;&#29702;&#35770;&#8221;&#35838;&#31243;&#65292;&#37117;&#20250;&#22240;&#20026;&#22270;&#28789;&#26426;&#32780;&#22836;&#30171;&#12290;&#22914;&#26524;&#20320;&#25366;&#25496;&#19968;&#28857;&#21382;&#21490;&#65292;&#20063;&#35768;&#20250;&#21457;&#29616;&#22270;&#28789;&#26426;&#30340;&#21407;&#22411;&#65292;&#20854;&#23454;&#26159;&#22270;&#28789;&#27597;&#20146;&#20351;&#29992;&#30340;&#25171;&#23383;&#26426;&#12290;&#29992;&#19968;&#21488;&#25171;&#23383;&#26426;&#26469;&#24314;&#27169;&#25152;&#26377;&#30340;&#35745;&#31639;&#65292;&#36825;&#24403;&#28982;&#26159;&#21487;&#34892;&#30340;&#65292;&#28982;&#32780;&#21364;&#22797;&#26434;&#19981;&#22570;&#12290;</p>
<p>&#30456;&#27604;&#20043;&#19979;&#65292;lambda&#28436;&#31639;&#26356;&#21152;&#31616;&#21333;&#65292;&#20248;&#38597;&#65292;&#23454;&#29992;&#12290;&#23427;&#26159;&#19968;&#20010;&#38750;&#24120;&#26377;&#21407;&#21017;&#30340;&#35774;&#35745;&#12290;Lambda&#28436;&#31639;&#19981;&#20294;&#33021;&#28165;&#26224;&#22320;&#26174;&#31034;&#20986;&#20320;&#24819;&#35201;&#34920;&#36798;&#30340;&#24847;&#24605;&#65292;&#32780;&#19988;&#26377;&#30452;&#25509;&#30340;&#8220;&#29289;&#29702;&#23454;&#29616;&#8221;&#12290;&#20320;&#21487;&#20197;&#33258;&#28982;&#30340;&#25226;&#19968;&#20010; lambda&#28436;&#31639;&#34920;&#36798;&#24335;&#65292;&#30475;&#25104;&#26159;&#19968;&#20010;&#30005;&#23376;&#32447;&#36335;&#27169;&#22359;&#12290;&#23545;&#20110;&#29616;&#23454;&#30340;&#32534;&#31243;&#35821;&#35328;&#35774;&#35745;&#65292;&#31995;&#32479;&#35774;&#35745;&#65292; lambda&#28436;&#31639;&#26377;&#30528;&#24040;&#22823;&#30340;&#25351;&#23548;&#21644;&#21551;&#21457;&#24847;&#20041;&#12290;&#20197;&#33267;&#20110;&#24456;&#22810;&#29702;&#35299;lambda&#28436;&#31639;&#30340;&#20154;&#37117;&#25630;&#19981;&#26126;&#30333;&#65292;&#22270;&#28789;&#26426;&#38500;&#20102;&#35753;&#19968;&#20123;&#29702;&#35770;&#26174;&#24471;&#39640;&#28145;&#33707;&#27979;&#65292;&#36824;&#26377;&#20160;&#20040;&#23384;&#22312;&#30340;&#24847;&#20041;&#12290;&#21382;&#21490;&#30340;&#20498;&#36864;</p>
<p>&#22270;&#28789;&#26426;&#27604;&#36215;lambda&#28436;&#31639;&#26469;&#35828;&#65292;&#20854;&#23454;&#26159;&#19968;&#20010;&#21382;&#21490;&#30340;&#20498;&#36864;&#12290;1928&#24180;&#65292;Alonzo Church&#21457;&#26126;&#20102; lambda&#28436;&#31639;&#65288;&#24403;&#26102;&#20182;25&#23681;&#65289;&#12290;Lambda&#28436;&#31639;&#34987;&#35774;&#35745;&#20026;&#19968;&#20010;&#36890;&#29992;&#30340;&#35745;&#31639;&#27169;&#22411;&#65292;&#24182;&#19981;&#26159;&#20026;&#20102;&#35299;&#20915;&#26576;&#20010;&#29305;&#23450;&#30340;&#38382;&#39064;&#32780;&#35806;&#29983;&#30340;&#12290;1929&#24180;&#65292;Church&#25104;&#20026;&#26222;&#26519;&#26031;&#39039;&#22823;&#23398;&#25945;&#25480;&#12290;1932&#24180;&#65292;Church&#22312; Annals of Mathematics&#21457;&#34920;&#20102;&#19968;&#31687;&#35770;&#25991;&#65292;&#32416;&#27491;&#36923;&#36753;&#39046;&#22495;&#37324;&#20960;&#20010;&#24120;&#35265;&#30340;&#38382;&#39064;&#65292;&#20182;&#30340;&#35770;&#36848;&#20013;&#29992;&#20102;lambda&#28436;&#31639;&#12290;1935&#24180;&#65292;Church&#21457;&#34920;&#35770;&#25991;&#65292;&#20351;&#29992;lambda&#28436;&#31639;&#35777;&#26126;&#22522;&#26412;&#25968;&#35770;&#20013;&#23384;&#22312;&#19981;&#21487;&#35299;&#20915;&#30340;&#38382;&#39064;&#12290;1936&#24180;4&#26376;&#65292;Church&#21457;&#34920;&#20102;&#19968;&#31687;&#20004;&#39029;&#32440;&#30340;&#8220;note&#8221;&#65292;&#25351;&#20986;&#33258;&#24049;1935&#24180;&#37027;&#31687;&#35770;&#25991;&#21487;&#20197;&#25512;&#35770;&#24471;&#20986;&#65292;&#33879;&#21517;&#30340;Hilbert&#8220;&#21487;&#21028;&#23450;&#24615;&#38382;&#39064;&#8221;&#26159;&#19981;&#21487;&#35299;&#20915;&#30340;&#12290;</p>
<p>1936&#24180;5&#26376;&#65292;&#24403;&#26102;&#36824;&#22312;&#21073;&#26725;&#35835;&#30805;&#22763;&#30340;&#22270;&#28789;&#65292;&#20063;&#20889;&#20102;&#19968;&#31687;&#35770;&#25991;&#65292;&#20351;&#29992;&#33258;&#24049;&#35774;&#35745;&#30340;&#19968;&#31181;&#8220;&#35745;&#31639;&#26426;&#22120;&#8221;&#65288;&#21518;&#26469;&#34987;&#21483;&#20570;&#22270;&#28789;&#26426;&#65289;&#26469;&#35777;&#26126;&#21516;&#19968;&#20010;&#38382;&#39064;&#12290;&#22270;&#28789;&#30340;&#35770;&#25991;&#25237;&#31295;&#65292;&#27604;Church&#26368;&#26089;&#30340;&#32467;&#35770;&#21457;&#34920;&#65292;&#26202;&#20102;&#25972;&#25972;&#19968;&#24180;&#12290;&#32534;&#36753;&#20174;&#26469;&#27809;&#35265;&#36807;&#22270;&#28789;&#26426;&#36825;&#26679;&#30340;&#19996;&#35199;&#65292;&#32780;&#19988;&#23427;&#32439;&#32321;&#22797;&#26434;&#65292;&#36828;&#27809;&#26377;lambda &#28436;&#31639;&#26469;&#24471;&#20248;&#38597;&#12290;&#23601;&#20687;&#25152;&#26377;&#20154;&#23545;&#22270;&#28789;&#26426;&#30340;&#31532;&#19968;&#21360;&#35937;&#19968;&#26679;&#65292;&#32534;&#36753;&#24456;&#38590;&#30456;&#20449;&#36825;&#25171;&#23383;&#26426;&#19968;&#26679;&#30340;&#25805;&#20316;&#26041;&#24335;&#65292;&#33021;&#22815;&#23481;&#32435;&#8220;&#25152;&#26377;&#30340;&#35745;&#31639;&#8221;&#12290;&#20182;&#26080;&#27861;&#30830;&#23450;&#22270;&#28789;&#30340;&#35770;&#36848;&#26159;&#21542;&#27491;&#30830;&#65292;&#21482;&#22909;&#25214;&#20154;&#24110;&#24537;&#12290;Church &#24656;&#24597;&#26159;&#24403;&#26102;&#19990;&#30028;&#19978;&#21807;&#19968;&#33021;&#22815;&#39564;&#35777;&#22270;&#28789;&#30340;&#35770;&#25991;&#27491;&#30830;&#24615;&#30340;&#20154;&#12290;&#25152;&#20197;&#19968;&#30058;&#22909;&#24515;&#20043;&#19979;&#65292;&#32534;&#36753;&#20889;&#20102;&#23553;&#20449;&#32473;Church&#65292;&#35828;&#65306;&#8220;&#36825;&#20010;&#21483;&#22270;&#28789;&#30340;&#24180;&#36731;&#20154;&#24456;&#32874;&#26126;&#65292;&#20182;&#20889;&#20102;&#19968;&#31687;&#35770;&#25991;&#65292;&#20351;&#29992;&#19968;&#31181;&#26426;&#22120;&#26469;&#35777;&#26126;&#36319;&#20320;&#19968;&#26679;&#30340;&#32467;&#26524;&#12290;&#20182;&#20250;&#25226;&#35770;&#25991;&#23492;&#32473;&#20320;&#12290;&#22914;&#26524;&#20320;&#21457;&#29616;&#20182;&#30340;&#32467;&#26524;&#26159;&#27491;&#30830;&#30340;&#32780;&#19988;&#26377;&#29992;&#65292;&#24076;&#26395;&#20320;&#24110;&#21161;&#20182;&#25343;&#21040;&#22870;&#23398;&#37329;&#65292;&#36827;&#20837;Princeton&#36319;&#20320;&#23398;&#20064;&#12290;&#8221;</p>
<p>&#22270;&#28789;&#23601;&#26159;&#36825;&#26679;&#25104;&#20026;&#20102;Church&#30340;&#23398;&#29983;&#65292;&#28982;&#32780;&#22270;&#28789;&#24515;&#39640;&#27668;&#20658;&#65292;&#24656;&#24597;&#20174;&#26469;&#27809;&#25226;Church&#24403;&#25104;&#36807;&#32769;&#24072;&#65292;&#21453;&#20498;&#24635;&#35273;&#24471;Church&#25250;&#20808;&#19968;&#27493;&#65292;&#30772;&#22351;&#20102;&#33258;&#24049;&#21517;&#22402;&#38738;&#21490;&#30340;&#26426;&#20250;&#12290;&#36319;Church&#30340;&#20854;&#23427;&#23398;&#29983;&#19981;&#19968;&#26679;&#65292;&#22270;&#28789;&#27809;&#33021;&#29702;&#35299;lambda&#28436;&#31639;&#30340;&#31934;&#39635;&#65292;&#21364;&#35748;&#20026;&#33258;&#24049;&#30340;&#26426;&#22120;&#25165;&#26159;&#26368;&#20255;&#22823;&#30340;&#21457;&#26126;&#12290;&#36827;&#20837;Princeton&#20043;&#21518;&#65292;&#22270;&#28789;&#19981;&#34394;&#24515;&#35831;&#25945;&#65292;&#21482;&#26159;&#19968;&#24515;&#24819;&#21457;&#34920;&#33258;&#24049;&#30340;&#35770;&#25991;&#65292;&#24819;&#35753;&#22823;&#23478;&#23545;&#33258;&#24049;&#30340;&#8220;&#26426;&#22120;&#8221;&#20135;&#29983;&#20852;&#36259;&#65292;&#32467;&#26524;&#36973;&#21040;&#24456;&#22823;&#30340;&#25387;&#25240;&#12290;&#24403;&#28982;&#20102;&#65292;&#19968;&#20010;&#21517;&#19981;&#35265;&#32463;&#20256;&#30340;&#20154;&#65292;&#20570;&#20102;&#20010;&#24618;&#27169;&#24618;&#26679;&#30340;&#26426;&#22120;&#65292;&#35828;&#23427;&#21487;&#20197;&#22218;&#25324;&#23431;&#23449;&#37324;&#25152;&#26377;&#30340;&#35745;&#31639;&#65292;&#20320;&#19981;&#34987;&#24403;&#25104;&#27665;&#31185;&#25165;&#24618;&#21602;&#65281;</p>
<p>1937&#24180;&#65292;&#22312;Church&#30340;&#24110;&#21161;&#19979;&#65292;&#22270;&#28789;&#30340;&#37027;&#31687;&#35770;&#25991;&#65288;&#36215;&#21517;&#20026;&#12298;Computable Numbers&#12299;&#65289;&#32456;&#20110;&#21457;&#34920;&#20102;&#12290;Church&#36824;&#26159;&#24456;&#22120;&#37325;&#22270;&#28789;&#30340;&#65292;&#20182;&#25226;&#22270;&#28789;&#30340;&#26426;&#22120;&#21483;&#20570;&#8220;&#22270;&#28789;&#26426;&#8221;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#35770;&#25991;&#21457;&#34920;&#20043;&#21518;&#65292;&#23398;&#26415;&#30028;&#23545;&#27492;&#20960;&#20046;&#27809;&#26377;&#20219;&#20309;&#21453;&#21709;&#65292;&#21482;&#26377;&#20004;&#20154;&#21521;&#22270;&#28789;&#32034;&#21462;&#36825;&#31687;&#35770;&#25991;&#12290;&#22270;&#28789;&#24403;&#28982;&#19981;&#29245;&#20102;&#65292;&#20110;&#26159;&#21518;&#26469;&#23601;&#21040;&#22788;&#25512;&#38144;&#33258;&#24049;&#30340;&#22270;&#28789;&#26426;&#65292;&#24819;&#35753;&#22823;&#23478;&#25215;&#35748;&#37027;&#26159;&#20255;&#22823;&#30340;&#21457;&#26126;&#12290;&#26377;&#20102;&#19968;&#20010;&#38180;&#23376;&#65292;&#30475;&#20160;&#20040;&#37117;&#26159;&#38025;&#23376;&#12290;&#21518;&#26469;&#27599;&#21040;&#19968;&#20010;&#22320;&#26041;&#65292;&#27599;&#20570;&#19968;&#20010;&#39033;&#30446;&#65288;&#35265;&#19979;&#19968;&#33410;&#65289;&#65292;&#20182;&#37117;&#24819;&#25226;&#38382;&#39064;&#24448;&#33258;&#24049;&#37027;&#31687;&#35770;&#25991;&#21644;&#22270;&#28789;&#26426;&#19978;&#38752;&#65292;&#19996;&#25289;&#35199;&#25199;&#30340;&#24819;&#35777;&#26126;&#23427;&#30340;&#20215;&#20540;&#65292;&#29978;&#33267;&#31216;&#21035;&#20154;&#21457;&#26126;&#30340;&#19996;&#35199;&#20840;&#37117;&#26159;&#21463;&#21040;&#20102;&#22270;&#28789;&#26426;&#30340;&#21551;&#21457;&#8230;&#8230; &#32463;&#36807;&#20154;&#20204;&#24456;&#38271;&#30340;&#26102;&#38388;&#30340;&#20197;&#35769;&#20256;&#35769;&#20043;&#21518;&#65292;&#20182;&#32456;&#20110;&#25104;&#21151;&#20102;&#12290;</p>
<p>&#22270;&#28789;&#24403;&#24180;&#30340;&#20316;&#27861;&#65292;&#20854;&#23454;&#36319;&#24403;&#20170;&#35745;&#31639;&#26426;&#23398;&#26415;&#30028;&#30340;&#26222;&#36941;&#29616;&#35937;&#24046;&#19981;&#22810;&#12290;&#25105;&#24819;&#21457;&#34920;&#33258;&#24049;&#30340;&#24819;&#27861;A&#65292;&#32467;&#26524;&#21035;&#20154;&#24050;&#32463;&#21457;&#34920;&#20102;B&#65292;&#35299;&#20915;&#20102;A&#35201;&#35299;&#20915;&#30340;&#38382;&#39064;&#65292;&#32780;&#19988;&#36824;&#27604;A&#31616;&#21333;&#21644;&#28165;&#26224;&#12290;&#24590;&#20040;&#21150;&#21602;&#65311;&#39318;&#20808;&#65292;&#25105;&#22768;&#26126;&#33258;&#24049;&#20174;&#27809;&#30475;&#36807;B&#30340;&#35770;&#25991;&#65292;&#36825;&#26679;&#23601;&#21487;&#20197;&#34987;&#31216;&#20026;&#8220;&#29420;&#31435;&#30340;&#21457;&#29616;&#8221;&#12290;&#28982;&#21518;&#65292;&#25105;&#35777;&#26126;A&#21644;B&#22312;&#8220;&#26412;&#36136;&#8221;&#19978;&#26159;&#31561;&#20215;&#30340;&#12290;&#26368;&#21518;&#65292;&#25105;&#19996;&#25289;&#35199;&#25199;&#65292;&#25366;&#25496;&#19968;&#19979;B&#30340;&#23616;&#38480;&#24615;&#65292;A&#30456;&#23545;&#20110;B&#22312;&#26576;&#20123;&#36793;&#27839;&#39046;&#22495;&#30340;&#20248;&#21183;&#8230;&#8230; &#36825;&#26679;&#21453;&#22797;&#25240;&#33150;&#65292;&#23547;&#25214;A&#30340;&#20248;&#21183;&#65292;&#24635;&#26377;&#19968;&#22825;&#20250;&#25104;&#21151;&#21457;&#34920;&#30340;&#12290;&#19968;&#26086;&#21457;&#34920;&#25104;&#21151;&#65292;&#23601;&#20250;&#26377;&#20154;&#32473;&#25105;&#21809;&#39640;&#35843;&#65292;&#27809;&#29992;&#30340;&#19996;&#35199;&#20063;&#35201;&#35828;&#25104;&#26159;&#26377;&#29992;&#30340;&#12290;&#20182;&#20204;&#20250;&#22312;A&#30340;&#22522;&#30784;&#19978;&#21457;&#23637;&#20182;&#20204;&#33258;&#24049;&#30340;&#19996;&#35199;&#65292;&#26368;&#21518;&#25226;&#25105;&#25512;&#23815;&#20026;&#22823;&#24072;&#12290;&#37027;&#21457;&#34920;&#26356;&#26089;&#65292;&#26356;&#31616;&#21333;&#20248;&#32654;&#30340;B&#65292;&#20063;&#23601;&#26080;&#20154;&#38382;&#27941;&#20102;&#12290;&#32988;&#21033;&#65281;</p>
<p>&#29616;&#22312;&#19981;&#24471;&#19981;&#35828;&#19968;&#19979;&#12298;&#22270;&#28789;&#20256;&#12299;&#23545;&#27492;&#30340;&#27498;&#26354;&#12290;Church&#30340;&#35770;&#25991;&#21457;&#34920;&#65292;&#27604;&#22270;&#28789;&#30340;&#35770;&#25991;&#25237;&#31295;&#36824;&#26089;&#19968;&#24180;&#65292;&#32780;&#19988;Church&#20351;&#29992;&#20102;&#27604;&#22270;&#28789;&#26426;&#26356;&#31616;&#21333;&#20248;&#38597;&#30340;&#35745;&#31639;&#27169;&#22411;&#12290;Church&#30340;&#25104;&#26524;&#26412;&#26469;&#22825;&#32463;&#22320;&#20041;&#24212;&#35813;&#21463;&#21040;&#26356;&#22810;&#30340;&#23562;&#37325;&#65292;&#21040;&#22836;&#26469;&#20316;&#32773;&#21364;&#35828;&#65306;&#8220;&#8230;and Turing was robbed of the full reward for his originality&#8221;&#65288;&#35265;&#31532;3&#33410;&#8220;The Turing machine&#8221;&#65289;&#12290;&#35753;&#20154;&#24863;&#35273;&#35980;&#20284;&#26159;Church&#29992;&#19981;&#27491;&#24403;&#30340;&#25163;&#27573;&#8220;&#25250;&#36208;&#8221;&#20102;&#22270;&#28789;&#30340;&#8220;&#21407;&#21019;&#24615;&#8221;&#19968;&#26679;&#12290;&#20320;&#26412;&#26469;&#27809;&#26377;&#20160;&#20040;&#21407;&#21019;&#24615;&#65292;&#36824;&#19985;&#38475;&#22797;&#26434;&#65292;&#25152;&#20197;&#20309;&#35848;&#25250;&#36208;&#21602;&#65311;&#25105;&#24590;&#20040;&#35273;&#24471;&#24688;&#24688;&#30456;&#21453;&#65292;&#20854;&#23454;&#26159;&#22270;&#28789;&#25250;&#36208;&#20102;Church&#30340;&#21407;&#21019;&#24615;&#65311;&#29616;&#22312;&#25552;&#36215;Hilbert&#21487;&#21028;&#23450;&#24615;&#38382;&#39064;&#65292;&#21487;&#35745;&#31639;&#24615;&#29702;&#35770;&#65292;&#20154;&#20204;&#37117;&#24819;&#36215;&#22270;&#28789;&#65292;&#26377;&#35841;&#36824;&#24819;&#24471;&#36215;Church&#65292;&#26377;&#35841;&#30693;&#36947;&#20182;&#26159;&#31532;&#19968;&#20010;&#35299;&#20915;&#20102;&#36825;&#38382;&#39064;&#30340;&#20154;&#65292;&#26377;&#35841;&#30693;&#36947;&#20182;&#29992;&#20102;&#26356;&#20248;&#32654;&#30340;&#21150;&#27861;&#65311;Lambda&#28436;&#31639;&#19982;&#35745;&#31639;&#29702;&#35770;</p>
<p>&#30001;&#20110;&#22270;&#28789;&#21040;&#22788;&#25512;&#38144;&#33258;&#24049;&#30340;&#29702;&#35770;&#65292;&#25226;&#19981;&#22909;&#30340;&#19996;&#35199;&#35828;&#25104;&#26159;&#22909;&#30340;&#65292;&#25226;&#21035;&#20154;&#21457;&#26126;&#30340;&#26426;&#22120;&#30828;&#24448;&#33258;&#24049;&#30340;&#29702;&#35770;&#19978;&#38754;&#38752;&#65292;&#35828;&#20182;&#20204;&#21463;&#21040;&#20102;&#22270;&#28789;&#26426;&#30340;&#8220;&#21551;&#21457;&#8221;&#65292;&#20197;&#33267;&#20110;&#24456;&#22810;&#20154;&#34987;&#34506;&#24785;&#65292;&#20197;&#20026;&#23427;&#27604;&#36215;lambda&#28436;&#31639;&#30830;&#23454;&#26377;&#20248;&#21183;&#12290;&#20877;&#21152;&#19978;&#24456;&#22810;&#20154;&#20026;&#20102;&#33258;&#24049;&#30340;&#21033;&#30410;&#32780;&#20197;&#35769;&#20256;&#35769;&#65292;&#20805;&#24403;&#20256;&#25945;&#22763;&#65292;&#36825;&#23601;&#26159;&#20026;&#20160;&#20040;&#22270;&#28789;&#26426;&#29616;&#22312;&#34987;&#20154;&#20204;&#26222;&#36941;&#25509;&#21463;&#20316;&#20026;&#35745;&#31639;&#27169;&#22411;&#12290;&#28982;&#32780;&#36825;&#24182;&#19981;&#33021;&#25913;&#21464;&#23427;&#19985;&#38475;&#21644;&#28151;&#28102;&#30340;&#26412;&#36136;&#12290;&#22270;&#28789;&#26426;&#30340;&#35774;&#35745;&#65292;&#20854;&#23454;&#26159;&#19987;&#38376;&#20026;&#20102;&#35777;&#26126;Hilbert&#30340;&#21487;&#21028;&#23450;&#24615;&#38382;&#39064;&#19981;&#21487;&#35299;&#20915;&#65292;&#23427;&#24182;&#19981;&#26159;&#19968;&#20010;&#29992;&#36884;&#24191;&#27867;&#30340;&#35745;&#31639;&#27169;&#22411;&#12290;&#22270;&#28789;&#26426;&#20043;&#25152;&#20197;&#34987;&#20154;&#25509;&#21463;&#65292;&#24456;&#22823;&#37096;&#20998;&#21407;&#22240;&#22312;&#20110;&#20154;&#30340;&#26080;&#30693;&#21644;&#24858;&#34850;&#12290;&#24456;&#22810;&#20154;&#65288;&#21253;&#25324;&#24456;&#22810;&#25152;&#35859;&#8220;&#29702;&#35770;&#35745;&#31639;&#26426;&#31185;&#23398;&#23478;&#8221;&#65289;&#26681;&#26412;&#27809;&#22909;&#22909;&#29702;&#35299;&#36807;lambda&#28436;&#31639;&#65292;&#20182;&#20204;&#26395;&#25991;&#29983;&#20041;&#65292;&#20197;&#20026;&#22270;&#28789;&#26426;&#26159;&#8220;&#29289;&#29702;&#30340;&#8221;&#65292;&#23454;&#38469;&#21487;&#29992;&#30340;&#8220;&#26426;&#22120;&#8221;&#65292;&#32780;lambda&#28436;&#31639;&#21482;&#26159;&#19968;&#20010;&#29702;&#35770;&#27169;&#22411;&#12290;</p>
<p>&#20107;&#23454;&#24688;&#24688;&#30456;&#21453;&#65306;lambda&#28436;&#31639;&#20854;&#23454;&#38750;&#24120;&#30340;&#23454;&#29992;&#65292;&#23427;&#30340;&#26412;&#36136;&#36319;&#30005;&#23376;&#32447;&#36335;&#27809;&#20160;&#20040;&#20004;&#26679;&#12290;&#20960;&#20046;&#25152;&#26377;&#29616;&#23454;&#21487;&#29992;&#30340;&#31243;&#24207;&#35821;&#35328;&#65292;&#20854;&#20013;&#30340;&#35821;&#20041;&#20840;&#37117;&#21487;&#20197;&#29992;lambda&#28436;&#31639;&#26469;&#35299;&#37322;&#12290;&#32780;&#22270;&#28789;&#26426;&#21364;&#27809;&#26377;&#24456;&#22810;&#29616;&#23454;&#30340;&#24847;&#20041;&#65292;&#29992;&#36215;&#26469;&#38750;&#24120;&#36457;&#33050;&#65292;&#25152;&#20197;&#21482;&#33021;&#22312;&#35745;&#31639;&#29702;&#35770;&#20013;&#20316;&#20026;&#27169;&#22411;&#12290;&#21478;&#22806;&#19968;&#20010;&#26356;&#21152;&#40092;&#20026;&#20154;&#30693;&#30340;&#20107;&#23454;&#26159;&#65306;lambda&#28436;&#31639;&#20854;&#23454;&#22312;&#35745;&#31639;&#29702;&#35770;&#26041;&#38754;&#20063;&#21487;&#20197;&#23436;&#20840;&#21462;&#20195;&#22270;&#28789;&#26426;&#65292;&#23427;&#19981;&#20294;&#21487;&#20197;&#34920;&#36798;&#25152;&#26377;&#22270;&#28789;&#26426;&#33021;&#34920;&#36798;&#30340;&#29702;&#35770;&#65292;&#32780;&#19988;&#33021;&#22815;&#26356;&#21152;&#31616;&#27905;&#21644;&#31934;&#30830;&#22320;&#34920;&#36798;&#23427;&#20204;&#12290;</p>
<p>&#24456;&#22810;&#29702;&#35770;&#35745;&#31639;&#26426;&#31185;&#23398;&#23478;&#21916;&#27426;&#29992;&#22270;&#28789;&#26426;&#65292;&#20223;&#20315;&#26159;&#22240;&#20026;&#29992;&#23427;&#20316;&#20026;&#27169;&#22411;&#65292;&#33021;&#35753;&#33258;&#24049;&#30340;&#29702;&#35770;&#26174;&#24471;&#39640;&#28145;&#33707;&#27979;&#65292;&#26214;&#28073;&#38590;&#25026;&#12290;&#26222;&#36890;&#30340;&#35745;&#31639;&#29702;&#35770;&#35838;&#26412;&#65292;&#24448;&#24448;&#29992;&#22270;&#28789;&#26426;&#20316;&#20026;&#23427;&#30340;&#35745;&#31639;&#27169;&#22411;&#65292;&#20351;&#29992;&#33510;&#36924;&#30340;&#21150;&#27861;&#25512;&#23548;&#21508;&#31181;&#21487;&#35745;&#31639;&#24615;&#65288;computability&#65289;&#21644;&#22797;&#26434;&#24615;&#65288;complexity&#65289;&#29702;&#35770;&#12290;&#29305;&#21035;&#26159;&#20687; Michael Sipser&#37027;&#26412;&#32463;&#20856;&#30340;&#35745;&#31639;&#29702;&#35770;&#25945;&#26448;&#65292;&#26214;&#28073;&#38590;&#25026;&#65292;&#28151;&#28102;&#19981;&#22570;&#65292;&#26377;&#26102;&#20505;&#35753;&#25105;&#37117;&#24576;&#30097;&#20316;&#32773;&#33258;&#24049;&#26377;&#27809;&#26377;&#25630;&#25026;&#37027;&#20123;&#19996;&#35199;&#12290;</p>
<p>&#21518;&#26469;&#25105;&#21457;&#29616;&#65292;&#20854;&#23454;&#22270;&#28789;&#26426;&#25152;&#33021;&#34920;&#36798;&#30340;&#29702;&#35770;&#65292;&#20840;&#37117;&#21487;&#20197;&#29992;&#26356;&#21152;&#31616;&#21333;&#30340;lambda&#28436;&#31639;&#65288;&#25110;&#32773;&#20219;&#20309;&#19968;&#31181;&#29616;&#22312;&#27969;&#34892;&#30340;&#31243;&#24207;&#35821;&#35328;&#65289;&#26469;&#34920;&#31034;&#12290;&#22270;&#28789;&#26426;&#30340;&#27599;&#19968;&#20010;&#29366;&#24577;&#65292;&#19981;&#36807;&#23545;&#24212;&#20102;lambda&#28436;&#31639;&#65288;&#25110;&#32773;&#26576;&#31181;&#31243;&#24207;&#35821;&#35328;&#65289;&#37324;&#38754;&#30340;&#19968;&#20010;&#8220;AST&#33410;&#28857;&#8221;&#65292;&#28982;&#32780;&#29992;lambda&#28436;&#31639;&#26469;&#34920;&#31034;&#37027;&#20123;&#35745;&#31639;&#29702;&#35770;&#65292;&#21364;&#21487;&#20197;&#27604;&#22270;&#28789;&#26426;&#28165;&#26224;&#21644;&#23481;&#26131;&#24456;&#22810;&#12290;&#22312;Indiana&#22823;&#23398;&#20570;&#35745;&#31639;&#29702;&#35770;&#35838;&#31243;&#21161;&#25945;&#30340;&#26102;&#20505;&#65292;&#25105;&#25226;&#36825;&#31181;&#24605;&#32500;&#26041;&#24335;&#24708;&#24708;&#22320;&#35762;&#36848;&#32473;&#20102;&#19978;&#35838;&#30340;&#23398;&#29983;&#20204;&#65292;&#20182;&#20204;&#26222;&#36941;&#34920;&#31034;&#25105;&#30340;&#36825;&#31181;&#24605;&#32500;&#26041;&#24335;&#26356;&#26131;&#29702;&#35299;&#65292;&#32780;&#19988;&#26356;&#21152;&#36148;&#36817;&#23454;&#38469;&#30340;&#32534;&#31243;&#12290;</p>
<p>&#20030;&#19968;&#20010;&#24456;&#31616;&#21333;&#30340;&#20363;&#23376;&#12290;&#25105;&#21487;&#20197;&#29992;&#19968;&#34892;lambda&#28436;&#31639;&#34920;&#36798;&#24335;&#65292;&#26469;&#26174;&#31034;Hilbert&#30340;&#8220;&#21487;&#21028;&#23450;&#24615;&#38382;&#39064;&#8221;&#26159;&#26080;&#35299;&#30340;&#65306;</p>
<p>Halting(&#955;m.not(Halting(m,m)), &#955;m.not(Halting(m,m)))</p>
<p>&#23436;&#25972;&#30340;&#35777;&#26126;&#19981;&#21040;&#19968;&#39029;&#32440;&#65292;&#35831;&#30475;&#25105;&#30340;&#21478;&#22806;&#19968;&#31687;&#25991;&#31456;&#65288;&#33521;&#25991;&#65289;&#12290;&#36825;&#20063;&#23601;&#26159;&#22270;&#28789;&#22312;&#20182;&#30340;&#35770;&#25991;&#37324;&#65292;&#25240;&#33150;&#20102;&#21313;&#22810;&#39029;&#32440;&#35777;&#26126;&#30340;&#19996;&#35199;&#12290;</p>
<p>&#25105;&#26366;&#32463;&#20197;&#20026;&#33258;&#24049;&#26159;&#21807;&#19968;&#30693;&#36947;&#36825;&#20010;&#31192;&#23494;&#30340;&#20154;&#65292;&#30452;&#21040;&#26377;&#19968;&#22825;&#25105;&#25226;&#36825;&#20010;&#31192;&#23494;&#21578;&#35785;&#20102;&#25105;&#30340;&#21338;&#22763;&#23548;&#24072;&#65292; Amr Sabry&#12290;&#20182;&#23545;&#25105;&#35828;&#65306;&#8220;&#21704;&#21704;&#65281;&#20854;&#23454;&#25105;&#26089;&#23601;&#30693;&#36947;&#36825;&#20010;&#65292;&#20320;&#21487;&#20197;&#21442;&#32771;&#19968;&#19979;Neil Jones&#20889;&#30340;&#19968;&#26412;&#20070;&#65292;&#21483;&#20570;&#12298;Computability and Complexity: From a Programming Perspective&#12299;&#12290;&#36825;&#26412;&#20070;&#29616;&#22312;&#24050;&#32463;&#21487;&#20197;&#20813;&#36153;&#19979;&#36733;&#12290;</p>
<p>&#27492;&#20070;&#20316;&#32773;&#29992;&#19968;&#31181;&#24456;&#31616;&#21333;&#30340;&#31243;&#24207;&#35821;&#35328;&#65292;&#38416;&#36848;&#20102;&#19968;&#33324;&#20154;&#29992;&#22270;&#28789;&#26426;&#26469;&#25551;&#36848;&#30340;&#37027;&#20123;&#29702;&#35770;&#65288;&#21487;&#35745;&#31639;&#24615;&#29702;&#35770;&#65292;&#22797;&#26434;&#24615;&#29702;&#35770;&#65289;&#12290;&#20182;&#21457;&#29616;&#29992;&#31243;&#24207;&#35821;&#35328;&#26469;&#25551;&#36848;&#35745;&#31639;&#29702;&#35770;&#65292;&#19981;&#20294;&#31616;&#21333;&#30452;&#25509;&#65292;&#28165;&#26224;&#26126;&#20102;&#65292;&#32780;&#19988;&#22312;&#26576;&#20123;&#26041;&#38754;&#21487;&#20197;&#26356;&#21152;&#31934;&#30830;&#22320;&#25551;&#36848;&#22270;&#28789;&#26426;&#26080;&#27861;&#25551;&#36848;&#30340;&#23450;&#29702;&#12290;&#24471;&#21040;&#36825;&#26412;&#20070;&#65292;&#35753;&#25105;&#35273;&#24471;&#22914;&#33719;&#33267;&#23453;&#65292;&#21407;&#26469;&#19990;&#30028;&#19978;&#26377;&#36319;&#25105;&#30475;&#27861;&#22914;&#27492;&#30456;&#20284;&#65292;&#23545;&#20107;&#29289;&#27934;&#23519;&#21147;&#22914;&#27492;&#20043;&#39640;&#30340;&#20154;&#65281;</p>
<p>&#22312;&#19968;&#27425;&#20250;&#35758;&#19978;&#65292;&#25105;&#26377;&#24184;&#22320;&#36935;&#21040;&#20102;Neil Jones&#65292;&#36319;&#20182;&#20999;&#30923;&#24605;&#24819;&#12290;&#24403;&#25552;&#21040;&#36825;&#26412;&#20070;&#30340;&#27169;&#22411;&#19982;&#22270;&#28789;&#29702;&#35770;&#30340;&#20851;&#31995;&#65292;&#32769;&#25945;&#25480;&#35878;&#34394;&#22320;&#35828;&#65306;&#8220;&#22270;&#28789;&#30340;&#27169;&#22411;&#36824;&#26159;&#26377;&#23427;&#30340;&#20215;&#20540;&#30340;&#8230;&#8230;&#8221; &#28982;&#32780;&#21040;&#26368;&#21518;&#65292;&#20182;&#20854;&#23454;&#20063;&#27809;&#33021;&#35828;&#28165;&#26970;&#36825;&#20215;&#20540;&#20309;&#22312;&#12290;&#25105;&#24515;&#37324;&#24456;&#28165;&#26970;&#65292;&#20182;&#21482;&#26159;&#20026;&#20102;&#36991;&#20813;&#24341;&#36215;&#23447;&#25945;&#20914;&#31361;&#65292;&#25110;&#32773;&#36991;&#20813;&#26174;&#24471;&#29378;&#22916;&#33258;&#22823;&#65292;&#32780;&#22996;&#23113;&#20854;&#35789;&#12290;&#30524;&#21069;&#30340;&#36825;&#20301;&#25945;&#25480;&#65292;&#34429;&#28982;&#20174;&#26469;&#27809;&#26377;&#24471;&#36807;&#22270;&#28789;&#22870;&#65292;&#24456;&#23569;&#26377;&#20154;&#21548;&#35828;&#36807;&#20182;&#30340;&#21517;&#23383;&#65292;&#28982;&#32780;&#20182;&#23545;&#20110;&#35745;&#31639;&#26412;&#36136;&#30340;&#29702;&#35299;&#65292;&#21364;&#27604;&#22270;&#28789;&#26412;&#20154;&#36824;&#35201;&#39640;&#20986;&#24456;&#22810;&#12290;</p>
<p>&#24635;&#30340;&#35828;&#26469;&#65292;&#22270;&#28789;&#26426;&#20063;&#35768;&#19981;&#26159;&#19968;&#25991;&#19981;&#20540;&#65292;&#28982;&#32780;&#30001;&#20110;lambda&#28436;&#31639;&#21487;&#20197;&#26356;&#21152;&#28165;&#26224;&#22320;&#35299;&#37322;&#22270;&#28789;&#26426;&#33021;&#34920;&#31034;&#30340;&#25152;&#26377;&#29702;&#35770;&#65292;&#22270;&#28789;&#26426;&#30340;&#20215;&#20540;&#30456;&#23545;&#26469;&#35828;&#20960;&#20046;&#20026;&#38646;&#12290;Church&#22312;1937&#24180;&#32473;&#22270;&#28789;&#35770;&#25991;&#20889;&#30340; Review&#25351;&#20986;&#65292;&#22270;&#28789;&#26426;&#30340;&#20248;&#21183;&#65292;&#22312;&#20110;&#23427;&#21487;&#20197;&#35753;&#19981;&#25026;&#24456;&#22810;&#25968;&#23398;&#65292;&#19981;&#29702;&#35299;lambda&#28436;&#31639;&#20043;&#31867;&#29702;&#35770;&#30340;&#20154;&#20063;&#21487;&#20197;&#30475;&#24471;&#25026;&#12290;&#25105;&#24590;&#20040;&#35273;&#24471;&#22270;&#28789;&#26426;&#23545;&#20110;&#19981;&#25026;&#24456;&#22810;&#25968;&#23398;&#30340;&#20154;&#65292;&#29702;&#35299;&#36215;&#26469;&#20854;&#23454;&#26356;&#21152;&#30171;&#33510;&#21602;&#65311;&#32780;&#19988;&#23601;&#31639;&#23427;&#30495;&#30340;&#23545;&#8220;&#22806;&#34892;&#8221;&#25110;&#32773;&#8220;&#31528;&#20154;&#8221;&#30340;&#29702;&#35299;&#26377;&#22909;&#22788;&#65292;&#36825;&#20215;&#20540;&#35980;&#20284;&#20063;&#19981;&#22823;&#21543;&#65311;:P&#30005;&#23376;&#35745;&#31639;&#26426;</p>
<p>&#24456;&#22810;&#8220;&#29702;&#35770;&#35745;&#31639;&#26426;&#31185;&#23398;&#23478;&#8221;&#21916;&#27426;&#35828;&#65292;&#22823;&#23478;&#29616;&#22312;&#29992;&#30340;&#35745;&#31639;&#26426;&#65292;&#21482;&#19981;&#36807;&#26159;&#19968;&#20010;&#8220;Universal Turing Machine&#8221;&#12290;&#23601;&#31639;&#20320;&#26681;&#26412;&#19981;&#30693;&#36947;&#22270;&#28789;&#26159;&#35841;&#65292;&#33258;&#24049;&#36763;&#33510;&#35774;&#35745;&#20986;&#19968;&#20010;&#26426;&#22120;&#25110;&#32773;&#35821;&#35328;&#65292;&#20182;&#20204;&#24635;&#21916;&#27426;&#35828;&#65306;&#8220;&#26159;&#22270;&#28789;&#21551;&#21457;&#20102;&#20320;&#65292;&#22240;&#20026;&#20320;&#37027;&#19996;&#35199;&#26159;&#36319;&#22270;&#28789;&#26426;&#31561;&#20215;&#30340;&#65292;&#26159;&#22270;&#28789;&#23436;&#22791;&#30340;&#8230;&#8230;&#8221;</p>
<p>&#37027;&#20040;&#29616;&#22312;&#35753;&#25105;&#20204;&#26469;&#30475;&#30475;&#65292;&#22270;&#28789;&#26412;&#20154;&#21644;&#20182;&#30340;&#29702;&#35770;&#65292;&#30495;&#27491;&#23545;&#30005;&#23376;&#35745;&#31639;&#26426;&#30340;&#21457;&#23637;&#36215;&#36807;&#22810;&#22823;&#30340;&#20316;&#29992;&#21543;&#12290;&#22914;&#26524;&#19968;&#20010;&#20154;&#23545;&#19968;&#20010;&#34892;&#19994;&#36215;&#36807;&#37325;&#22823;&#30340;&#20316;&#29992;&#65292;&#37027;&#25105;&#20204;&#21487;&#20197;&#35828;&#8220;&#27809;&#26377;&#20182;&#19981;&#34892;&#8221;&#12290;&#28982;&#32780;&#20107;&#23454;&#21364;&#26159;&#65292;&#21363;&#20351;&#27809;&#26377;&#22270;&#28789;&#65292;&#35745;&#31639;&#26426;&#25216;&#26415;&#20250;&#29031;&#26679;&#20687;&#20170;&#22825;&#19968;&#26679;&#21457;&#23637;&#65292;&#19997;&#27627;&#19981;&#20250;&#21463;&#21040;&#24433;&#21709;&#12290;&#30475;&#19968;&#30475;&#21382;&#21490;&#65292;&#20320;&#20063;&#35768;&#20250;&#24778;&#35766;&#30340;&#21457;&#29616;&#65292;&#22270;&#28789;&#30340;&#29702;&#35770;&#19981;&#20294;&#27809;&#33021;&#21551;&#21457;&#20219;&#20309;&#35745;&#31639;&#26426;&#30340;&#35774;&#35745;&#65292;&#32780;&#19988;&#22270;&#28789;&#20146;&#33258;&#35774;&#35745;&#30340;&#21807;&#19968;&#19968;&#20010;&#35745;&#31639;&#26426;&#65288;ACE&#65289;&#65292;&#26368;&#21518;&#20063;&#20197;&#24754;&#24808;&#30340;&#22833;&#36133;&#21578;&#32456;&#12290;&#20160;&#20040;&#26159;Universal Turing Machine &#65288;UTM&#65289;</p>
<p>ACE&#22833;&#36133;&#30340;&#19968;&#20010;&#37325;&#35201;&#21407;&#22240;&#65292;&#26159;&#22240;&#20026;&#22270;&#28789;&#36807;&#24230;&#30340;&#30475;&#37325;&#20182;&#33258;&#24049;&#21457;&#26126;&#30340;Universal Turing Machine &#65288;UTM&#65289;&#12290;&#25152;&#20197;&#25105;&#24819;&#39318;&#20808;&#26469;&#35299;&#23494;&#19968;&#19979;&#65292;&#36825;&#20010;&#34987;&#24456;&#22810;&#20154;&#21561;&#24471;&#31070;&#20046;&#20854;&#31070;&#30340;&#65292;&#20284;&#20046;&#20160;&#20040;&#37117;&#21487;&#20197;&#24448;&#19978;&#38754;&#25199;&#30340;UTM&#65292;&#21040;&#24213;&#26159;&#20160;&#20040;&#19996;&#35199;&#12290;</p>
<p>&#35828;&#30333;&#20102;&#65292;UTM&#23601;&#26159;&#19968;&#20010;&#35299;&#37322;&#22120;&#65292;&#23601;&#20687;Python&#25110;&#32773;JavaScript&#30340;&#35299;&#37322;&#22120;&#19968;&#26679;&#12290;&#35745;&#31639;&#26426;&#30340;&#22788;&#29702;&#22120;&#65288;CPU&#65289;&#20063;&#26159;&#19968;&#20010;&#35299;&#37322;&#22120;&#65292;&#23427;&#26159;&#29992;&#26469;&#35299;&#37322;&#26426;&#22120;&#25351;&#20196;&#30340;&#12290;&#37027;&#36825;&#26679;&#35828;&#26469;&#65292;&#20219;&#20309;&#21487;&#32534;&#31243;&#65292;&#20855;&#26377;&#25351;&#20196;&#38598;&#30340;&#26426;&#22120;&#37117;&#26159;UTM&#20102;&#65292;&#25152;&#20197;&#22270;&#28789;&#30340;&#29702;&#35770;&#21551;&#21457;&#20102;&#25152;&#26377;&#36825;&#20123;&#26426;&#22120;&#65311;&#20320;&#23613;&#31649;&#36319;&#25105;&#25199;&#21543; :)</p>
<p>&#20320;&#24212;&#35813;&#30693;&#36947;&#65292;&#22312;&#22270;&#28789;&#30340;UTM&#20986;&#29616;&#20197;&#21069;&#65292;Church&#30340;lambda&#28436;&#31639;&#37324;&#38754;&#26089;&#23601;&#26377;&#35299;&#37322;&#22120;&#30340;&#27010;&#24565;&#20102;&#65292;&#25152;&#20197;UTM&#26681;&#26412;&#19981;&#26159;&#20160;&#20040;&#26032;&#19996;&#35199;&#65292;&#32780;&#19988;&#23427;&#27604;&#36215;lambda&#28436;&#31639;&#30340;&#35299;&#37322;&#22120;&#65292;&#30495;&#26159;&#19985;&#38475;&#21448;&#22797;&#26434;&#12290;&#32780; Church&#20854;&#23454;&#20063;&#19981;&#26159;&#31532;&#19968;&#20010;&#25552;&#20986;&#35299;&#37322;&#22120;&#36825;&#27010;&#24565;&#30340;&#20154;&#65292;&#20687;&#36825;&#31867;&#36890;&#29992;&#30340;&#27010;&#24565;&#65292;&#24050;&#32463;&#24456;&#38590;&#36861;&#28335;&#26159;&#35841;&#8220;&#21457;&#26126;&#8221;&#30340;&#20102;&#12290;&#20063;&#35768;&#24182;&#19981;&#26159;&#26576;&#19968;&#20010;&#20154;&#21457;&#26126;&#20102;&#23427;&#65292;&#32780;&#26159;&#21382;&#21490;&#19978;&#30340;&#24456;&#22810;&#20154;&#12290;</p>
<p>&#35299;&#37322;&#22120;&#36825;&#20010;&#27010;&#24565;&#30340;&#28085;&#20041;&#23454;&#22312;&#26159;&#21253;&#32599;&#19975;&#35937;&#65292;&#20960;&#20046;&#26080;&#22788;&#19981;&#22312;&#12290;&#21482;&#35201;&#26159;&#8220;&#21487;&#32534;&#31243;&#8221;&#30340;&#26426;&#22120;&#65292;&#23427;&#26412;&#36136;&#19978;&#24517;&#28982;&#21253;&#21547;&#19968;&#20010;&#35299;&#37322;&#22120;&#12290;&#19968;&#20010;&#24037;&#31243;&#24072;&#22312;&#19981;&#30693;&#36947;&#35299;&#37322;&#22120;&#36825;&#27010;&#24565;&#30340;&#24773;&#20917;&#19979;&#65292;&#29031;&#26679;&#24456;&#26377;&#21487;&#33021;&#8220;&#19981;&#23567;&#24515;&#8221;&#35774;&#35745;&#20986;&#19968;&#20010;&#21487;&#32534;&#31243;&#30340;&#26426;&#22120;&#65292;&#25152;&#20197;&#22914;&#26524;&#20320;&#25226;&#36825;&#20123;&#20840;&#37117;&#24402;&#32467;&#25104;&#22270;&#28789;&#25110;&#32773;Church&#30340;&#21151;&#21171;&#65292;&#23601;&#22826;&#29301;&#24378;&#20102;&#12290;&#22270;&#28789;&#19982;ACE&#30340;&#25925;&#20107;</p>
<p>&#20107;&#23454;&#19978;&#65292;&#26368;&#26089;&#30340;&#30005;&#23376;&#35745;&#31639;&#26426;&#65292;&#24182;&#19981;&#26159;&#22270;&#28789;&#35774;&#35745;&#30340;&#65292;&#32780;&#26159;&#30005;&#23376;&#24037;&#31243;&#24072;&#36319;&#20854;&#20182;&#19968;&#20123;&#25968;&#23398;&#23478;&#21512;&#20316;&#30340;&#32467;&#26524;&#12290;&#26681;&#25454;&#32769;&#19968;&#36744;&#24037;&#31243;&#24072;&#30340;&#21465;&#36848;&#65292;&#22270;&#28789;&#30340;&#24037;&#20316;&#21644;&#29702;&#35770;&#65292;&#23545;&#20110;&#29616;&#23454;&#30340;&#30005;&#23376;&#35745;&#31639;&#26426;&#35774;&#35745;&#65292;&#20960;&#20046;&#27809;&#26377;&#20219;&#20309;&#30340;&#27491;&#38754;&#20316;&#29992;&#12290;&#24456;&#22810;&#24037;&#31243;&#24072;&#20854;&#23454;&#26681;&#26412;&#19981;&#30693;&#36947;&#22270;&#28789;&#26159;&#35841;&#65292;&#22270;&#28789;&#26426;&#26159;&#20160;&#20040;&#12290;&#20182;&#20204;&#21482;&#26159;&#26681;&#25454;&#23454;&#38469;&#30340;&#38656;&#27714;&#65292;&#35774;&#35745;&#21644;&#21046;&#36896;&#20102;&#37027;&#20123;&#30005;&#36335;&#12290;&#36825;&#23601;&#26159;&#20026;&#20160;&#20040;&#25105;&#20204;&#20170;&#22825;&#30475;&#21040;&#30340;&#30005;&#23376;&#35745;&#31639;&#26426;&#65292;&#36319;&#22270;&#28789;&#26426;&#25110;&#32773;&#22270;&#28789;&#30340;&#20854;&#20182;&#29702;&#35770;&#20960;&#20046;&#23436;&#20840;&#19981;&#25645;&#36793;&#12290;</p>
<p>&#19990;&#30028;&#19978;&#26368;&#26089;&#30340;&#20004;&#21488;&#30005;&#23376;&#35745;&#31639;&#26426;&#65292;ENIAC&#21644;EDVAC&#65292;&#37117;&#26159;&#32654;&#22269;&#20154;&#35774;&#35745;&#21046;&#36896;&#30340;&#12290;&#20854;&#20013;EDVAC&#30340;&#35774;&#35745;&#25253;&#21578;&#65292;&#26159;&#20911;&#35834;&#20381;&#26364;&#65288;von Neumann&#65289;&#21442;&#19982;&#24182;&#31614;&#32626;&#30340;&#12290;&#25552;&#21040;EDVAC&#30340;&#35774;&#35745;&#65292;&#12298;&#22270;&#28789;&#20256;&#12299;&#26377;&#19968;&#27573;&#26377;&#36259;&#30340;&#20171;&#32461;&#65292;&#23427;&#22522;&#26412;&#26159;&#36825;&#26679;&#35828;&#30340;&#65306;&#8220;&#20911;&#35834;&#20381;&#26364;&#22312;Princeton&#30340;&#26102;&#20505;&#65292;&#24456;&#20102;&#35299;&#22270;&#28789;&#24320;&#22825;&#36767;&#22320;&#30340;&#21457;&#26126;&#8212;UTM&#12290;UTM&#21482;&#26377;&#19968;&#26681;&#32440;&#24102;&#65292;&#32780;EDVAC&#25226;&#25351;&#20196;&#21644;&#25968;&#25454;&#25918;&#22312;&#21516;&#19968;&#20010;&#23384;&#20648;&#31354;&#38388;&#65292;&#25152;&#20197;EDVAC&#30340;&#35774;&#35745;&#32943;&#23450;&#26159;&#21463;&#20102;UTM&#30340;&#21551;&#21457;&#12290;&#28982;&#32780;EDVAC&#30340;&#35774;&#35745;&#25253;&#21578;&#65292;&#21364;&#21482;&#23383;&#19981;&#25552;&#22270;&#28789;&#21644;UTM&#30340;&#21517;&#23383;&#65292;&#26356;&#27809;&#26377;&#24341;&#29992;&#22270;&#28789;&#21010;&#26102;&#20195;&#30340;&#35770;&#25991;&#12298;Computable Numbers&#12299;&#8230;&#8230;&#8221;</p>
<p>&#36825;&#20854;&#23454;&#26159;&#22312;&#21547;&#27801;&#23556;&#24433;&#30340;&#35828;&#65292;&#20911;&#35834;&#20381;&#26364;&#21644;EDVAC&#22242;&#38431;&#25220;&#34989;&#20102;&#22270;&#28789;&#30340;&#30740;&#31350;&#25104;&#26524;&#12290;&#29031;&#36825;&#31181;&#27498;&#29702;&#65292;&#25105;&#27927;&#34915;&#26381;&#30340;&#26102;&#20505;&#65292;&#34972;&#23376;&#21644;&#20869;&#35044;&#25918;&#22312;&#21516;&#19968;&#20010;&#26742;&#37324;&#27927;&#65292;&#20063;&#26159;&#21463;&#20102;&#22270;&#28789;&#30340;&#21551;&#21457;&#20102;&#65292;&#23601;&#22240;&#20026;UTM&#21482;&#26377;&#19968;&#26465;&#32440;&#24102;&#65311;&#36825;&#19990;&#30028;&#19978;&#30340;&#20107;&#29289;&#65292;&#36824;&#26377;&#21861;&#19981;&#26159;&#21463;&#20102;UTM&#21551;&#21457;&#30340;&#65311;&#36825;&#35753;&#25105;&#24819;&#36215;&#26576;&#20123;&#20840;&#38752;&#25171;&#19987;&#21033;&#23448;&#21496;&#36186;&#38065;&#30340;&#20844;&#21496;&#65288;patent troll&#65289;&#8230;&#8230; &#20911;&#35834;&#20381;&#26364;&#20316;&#20026;&#19968;&#20195;&#25968;&#23398;&#22823;&#24072;&#65292;&#27604;UTM&#37325;&#22823;&#30340;&#30740;&#31350;&#25104;&#26524;&#22810;&#24471;&#26159;&#20102;&#65292;&#20182;&#20250;&#22312;&#20046;&#25220;&#34989;&#22270;&#28789;&#30340;&#19996;&#35199;&#21527;&#65311;&#20854;&#23454;&#20154;&#23478;&#24656;&#24597;&#26159;&#26681;&#26412;&#27809;&#25226;&#22270;&#28789;&#21644;&#20182;&#30340;&#35770;&#25991;&#24403;&#22238;&#20107;&#12290;&#32780;&#19988;&#20854;&#20182;&#20154;&#65288;&#27604;&#22914;Church&#65289;&#26089;&#23601;&#26377;&#36319;UTM&#31561;&#20215;&#30340;&#24819;&#27861;&#65292;&#32780;&#19988;&#36824;&#26356;&#22909;&#65292;&#26356;&#31616;&#21333;&#12290;&#20043;&#21069;&#25250;&#20102; Church&#30340;&#39118;&#22836;&#65292;&#29616;&#22312;&#23621;&#28982;&#27450;&#21040;&#20911;&#35834;&#20381;&#26364;&#22836;&#19978;&#26469;&#20102;&#12290;&#21710;&#65292;&#30495;&#21463;&#19981;&#20102;&#36825;&#31181;&#19968;&#36744;&#23376;&#21482;&#24819;&#20986;&#36807;&#19968;&#20010;&#28857;&#23376;&#30340;&#20154;&#8230;&#8230;</p>
<p>&#25152;&#20197;&#21548;&#35828;&#32654;&#22269;&#20154;&#36896;&#20986;&#20102;EDVAC&#65292;&#22270;&#28789;&#24320;&#22987;&#21508;&#31181;&#32673;&#24917;&#23241;&#22930;&#24680;&#65292;&#24863;&#21497;&#33258;&#24049;&#33521;&#25165;&#26080;&#29992;&#27494;&#20043;&#22320;&#12290;&#32456;&#20110;&#26377;&#19968;&#22825;&#65292;&#20182;&#30340;&#26426;&#20250;&#26469;&#20102;&#12290;&#22312;EDVAC&#35806;&#29983;&#20960;&#20010;&#26376;&#20043;&#21518;&#65292;&#33521;&#22269;&#22269;&#23478;&#29289;&#29702;&#23454;&#39564;&#23460;&#65288;NPL&#65289;&#32852;&#31995;&#20102;&#22270;&#28789;&#12290;&#20182;&#20204;&#24819;&#36214;&#19978;&#32654;&#22269;&#30340;&#35745;&#31639;&#26426;&#25216;&#26415;&#21457;&#23637;&#65292;&#25152;&#20197;&#24819;&#25307;&#21215;&#22270;&#28789;&#65292;&#35753;&#20182;&#24110;&#24537;&#23665;&#23528;&#19968;&#20010;EDVAC&#30340;&#8220;&#33521;&#22269;&#29305;&#33394;&#29256;&#26412;&#8221;&#12290;&#22270;&#28789;&#35774;&#35745;&#30340;&#26426;&#22120;&#21483;&#20570;ACE&#65288;Automatic Computing Engine&#65289;&#12290;&#26368;&#21021;&#65292;&#22270;&#28789;&#32473;NPL&#19968;&#20010;&#24456;&#23439;&#20255;&#30340;&#34013;&#22270;&#65306;ACE&#21487;&#20197;&#22914;&#27492;&#30340;&#24378;&#22823;&#65292;&#20197;&#33267;&#20110;&#25972;&#20010;&#33521;&#22269;&#21482;&#38656;&#35201;&#36825;&#26679;&#19968;&#21488;&#35745;&#31639;&#26426;&#23601;&#22815;&#20102;&#65292;&#25105;&#20204;&#21487;&#20197;&#25226;&#23427;&#21483;&#20570;&#8220;&#33521;&#22269;&#22269;&#23478;&#35745;&#31639;&#26426;&#8221;&#8230;&#8230; &#28982;&#32780;&#20877;&#22823;&#30340;&#21475;&#21495;&#65292;&#20063;&#38590;&#36867;&#33073;&#29616;&#23454;&#30340;&#26816;&#39564;&#65292; ACE&#39033;&#30446;&#26368;&#32456;&#20197;&#22833;&#36133;&#21578;&#32456;&#12290;</p>
<p>&#12298;&#22270;&#28789;&#20256;&#12299;&#25226;ACE&#22833;&#36133;&#30340;&#36131;&#20219;&#65292;&#25512;&#25176;&#21040;NPL&#21644;&#20854;&#23427;&#20154;&#30340;&#8220;&#36817;&#35270;&#8221;&#21644;&#8220;&#23448;&#20698;&#8221;&#65292;&#28982;&#32780;ACE&#22833;&#36133;&#30340;&#20027;&#35201;&#36131;&#20219;&#65292;&#20854;&#23454;&#22312;&#20110;&#22270;&#28789;&#33258;&#24049;&#65306;&#20182;&#23436;&#20840;&#27809;&#26377;&#35774;&#35745;&#19968;&#21488;&#29616;&#23454;&#30340;&#35745;&#31639;&#26426;&#30340;&#22522;&#26412;&#25216;&#33021;&#65292;&#21364;&#24635;&#26159;&#33258;&#20197;&#20026;&#26159;&#65292;&#35774;&#31435;&#39640;&#22823;&#31354;&#30340;&#30446;&#26631;&#12290;&#22270;&#28789;&#30340;&#35774;&#35745;&#36319;&#24403;&#26102;&#65288;&#21253;&#25324;&#29616;&#22312;&#30340;&#65289;&#25152;&#26377;&#23454;&#29992;&#30340;&#35745;&#31639;&#26426;&#37117;&#26377;&#24040;&#22823;&#30340;&#24046;&#21035;&#12290;&#19981;&#20986;&#20320;&#25152;&#26009;&#65292;&#20182;&#26368;&#21021;&#30340;&#35774;&#35745;&#24605;&#36335;&#65292;&#26159;&#26681;&#25454;&#33258;&#24049;&#20043;&#21069;&#30340;&#35770;&#25991;&#12298;Computable Numbers&#12299;&#37324;&#25552;&#21040;&#30340;&#8220;Universal Turing Machine&#8221;&#65292;&#19981;&#36807;&#20174;&#20013;&#21435;&#25481;&#20102;&#19968;&#20123;&#19981;&#23454;&#38469;&#30340;&#35774;&#35745;&#65292;&#27604;&#22914;&#29992;&#19968;&#26681;&#32440;&#24102;&#26469;&#23384;&#20648;&#25968;&#25454;&#12290;&#36825;&#19968;&#28857;&#25913;&#36827;&#35980;&#20284;&#20570;&#23545;&#20102;&#65292;&#21487;&#26159;&#21602;&#65292;&#20182;&#21448;&#21152;&#20837;&#20102;&#19968;&#20123;&#35753;&#24037;&#31243;&#24072;&#20204;&#26080;&#35821;&#30340;&#35774;&#35745;&#65292;&#32654;&#20854;&#21517;&#26352;&#8220;&#26497;&#31616;&#35774;&#35745;&#8221;&#65288;minimalism&#65289;&#12290;&#27604;&#22914;&#65292;ACE&#30340;&#30828;&#20214;&#21482;&#25552;&#20379;AND, OR, NOT&#20043;&#31867;&#30340;&#36923;&#36753;&#36816;&#31639;&#20316;&#20026;&#8220;&#22522;&#26412;&#25805;&#20316;&#8221;&#65292;&#20854;&#23427;&#30340;&#31639;&#25968;&#25805;&#20316;&#65292;&#21253;&#25324;&#21152;&#20943;&#20056;&#38500;&#65292;&#20840;&#37096;&#29992;&#20195;&#30721;&#26469;&#23454;&#29616;&#12290;&#22270;&#28789;&#22823;&#24072;&#21834;&#65292;&#20320;&#30693;&#19981;&#30693;&#36947;&#26377;&#19968;&#31181;&#37325;&#35201;&#30340;&#25351;&#26631;&#65292;&#21483;&#20570;&#8220;&#25928;&#29575;&#8221;&#65311;</p>
<p>&#36825;&#36824;&#19981;&#31639;&#8230;&#8230; &#21518;&#26469;&#20182;&#26356;&#21152;&#24322;&#24819;&#22825;&#24320;&#65292;&#32456;&#20110;&#25199;&#19978;&#20102;&#8220;&#24605;&#32771;&#26426;&#22120;&#8221;&#65288;thinking machines&#65289;&#8212;&#20182;&#24819;&#35753;ACE&#25104;&#20026;&#21487;&#20197;&#20687;&#20154;&#19968;&#26679;&#24605;&#32771;&#30340;&#26426;&#22120;&#65292;&#36824;&#24819;&#35753;&#36825;&#26426;&#22120;&#33021;&#22815;&#33258;&#24049;&#20889;&#33258;&#24049;&#30340;&#20195;&#30721;&#12290;&#25353;&#29031;&#22270;&#28789;&#30340;&#21407;&#35805;&#65306;&#8220;&#22312;ACE&#30340;&#24037;&#20316;&#20013;&#65292;&#25105;&#23545;&#20154;&#33041;&#24314;&#27169;&#30340;&#20852;&#36259;&#65292;&#27604;&#23454;&#38469;&#30340;&#35745;&#31639;&#24212;&#29992;&#26356;&#24863;&#20852;&#36259;&#12290;&#8221; &#20182;&#26174;&#28982;&#24050;&#32463;&#25226;ACE&#24403;&#25104;&#20102;&#33258;&#24049;&#19968;&#20010;&#20154;&#30340;&#29609;&#20855;&#65292;&#32780;&#19981;&#20877;&#26159;&#35299;&#20915;&#20154;&#20204;&#23454;&#38469;&#38656;&#27714;&#30340;&#24037;&#20855;&#12290;&#21482;&#35201;&#26377;&#20154;&#21453;&#23545;&#36825;&#24819;&#27861;&#65292;&#20182;&#23601;&#20250;&#22066;&#31505;&#35828;&#65292;&#20320;&#26159;&#24597;&#25105;&#30340;&#26426;&#22120;&#22826;&#32874;&#26126;&#20102;&#65292;&#25250;&#20102;&#20320;&#30340;&#39277;&#30871;&#21543;&#65311;&#20854;&#23454;&#22270;&#28789;&#23545;&#20110;&#23454;&#38469;&#30340;&#20154;&#33041;&#24037;&#20316;&#21407;&#29702;&#25152;&#30693;&#29978;&#23569;&#65292;&#22522;&#26412;&#22788;&#20110;&#21021;&#20013;&#29983;&#29702;&#21355;&#29983;&#35838;&#26412;&#27700;&#24179;&#65292;&#28982;&#32780;&#20182;&#24635;&#21916;&#27426;&#23545;&#20154;&#35828;&#65292;&#20154;&#33041;&#19981;&#36807;&#23601;&#26159;&#19968;&#20010;UTM&#12290;&#30475;&#21543;&#65292;&#23427;&#26377;&#36755;&#20837;&#65292;&#36755;&#20986;&#65292;&#29366;&#24577;&#36716;&#25442;&#65292;&#23601;&#36319;UTM&#19968;&#26679;&#8230;&#8230; &#25152;&#35859;&#8220;&#22270;&#28789;&#27979;&#35797;&#8221;&#65288;Turing Test&#65289;&#65292;&#23601;&#26159;&#37027;&#26102;&#20505;&#25552;&#20986;&#26469;&#30340;&#12290;&#24403;&#28982;&#20102;&#65292;&#22240;&#20026;&#20182;&#25199;&#21040;&#20102;&#8220;thinking machine&#8221;&#65292;&#23601;&#26377;&#21518;&#20154;&#25226;&#20182;&#31216;&#20026;&#20154;&#24037;&#26234;&#33021;&#65288;AI&#65289;&#30340;&#40763;&#31062;&#12290;&#20854;&#23454;&#21602;&#65292;&#22270;&#28789;&#27979;&#35797;&#26681;&#26412;&#23601;&#19981;&#33021;&#35828;&#26126;&#19968;&#20010;&#26426;&#22120;&#20855;&#26377;&#20102;&#20154;&#30340;&#26234;&#33021;&#65292;&#23427;&#21482;&#26159;&#22312;&#27979;&#35797;&#19968;&#20123;&#32932;&#27973;&#30340;&#34920;&#35937;&#12290;&#21518;&#26469;&#65292;&#8220;thinking machines&#8221;&#25104;&#20026;&#20102;&#19968;&#31181;&#36890;&#29992;&#30340;&#24140;&#23376;&#65292;&#29992;&#20110;&#31609;&#38598;&#22823;&#31508;&#31185;&#30740;&#32463;&#36153;&#65292;&#26368;&#21518;&#20840;&#37117;&#34880;&#26412;&#26080;&#24402;&#12290;</p>
<p>&#22270;&#28789;&#35774;&#35745;&#20102;&#36825;&#26426;&#22120;&#65292;NPL&#24403;&#26102;&#21364;&#27809;&#26377;&#33021;&#21147;&#21046;&#36896;&#23427;&#12290;&#20110;&#26159;&#20182;&#20204;&#27714;&#21161;&#20110;&#21478;&#22806;&#20004;&#20301;&#23454;&#29616;&#36807;&#35745;&#31639;&#26426;&#30340;&#24037;&#31243;&#24072;&#65306;F. C. Williams&#21644;Maurice Wilkes&#65288;&#21518;&#26469;EDSAC&#35745;&#31639;&#26426;&#30340;&#35774;&#35745;&#32773;&#65289;&#65292;&#35831;&#20182;&#20204;&#24110;&#24537;&#23454;&#29616;&#22270;&#28789;&#30340;&#35774;&#35745;&#12290;&#21487;&#24819;&#32780;&#30693;&#65292;Williams&#21644;Wilkes&#37117;&#34920;&#31034;&#19981;&#21916;&#27426;ACE&#30340;&#35774;&#35745;&#65292;&#32780;&#19988;&#25351;&#20986;&#22270;&#28789;&#30340;&#24615;&#26684;&#19982;&#33258;&#24049;&#30340;&#30740;&#31350;&#39118;&#26684;&#19981;&#21305;&#37197;&#65292;&#19981;&#24895;&#36319;&#20182;&#21512;&#20316;&#65292;&#25152;&#20197;&#21452;&#21452;&#25298;&#32477;&#20102;NPL&#30340;&#36992;&#35831;&#12290;&#26368;&#21518;&#65292; NPL&#26032;&#25104;&#31435;&#20102;&#19968;&#20010;&#30005;&#23376;&#37096;&#38376;&#65292;ACE&#30340;&#24037;&#31243;&#32456;&#20110;&#21487;&#20197;&#24320;&#22987;&#12290;&#28982;&#32780;&#65292;&#26681;&#25454;&#36164;&#28145;&#24037;&#31243;&#24072;&#20204;&#30340;&#35752;&#35770;&#65292;&#35273;&#24471;&#22270;&#28789;&#25552;&#20986;&#30340;&#21046;&#36896;&#19968;&#20010;&#8220;&#30005;&#23376;&#20154;&#33041;&#8221;&#21644;&#8220;&#26234;&#33021;&#26426;&#22120;&#8221;&#65292;&#24182;&#19981;&#26159;&#23454;&#38469;&#21487;&#34892;&#65292;&#25110;&#32773;&#22312;&#30701;&#26399;&#20043;&#20869;&#33021;&#27966;&#19978;&#29992;&#22330;&#30340;&#39033;&#30446;&#65292;&#25152;&#20197;&#20915;&#23450;&#20570;&#19968;&#20123;&#23454;&#38469;&#28857;&#30340;&#20107;&#24773;&#12290;&#22270;&#28789;&#23545;&#27492;&#38750;&#24120;&#24700;&#28779;&#65292;&#21508;&#31181;&#25265;&#24616;&#65292;&#35828;&#21035;&#20154;&#23448;&#20698;&#21834;&#65292;&#36817;&#35270;&#21834;&#65292;&#27809;&#24819;&#35937;&#21147;&#21834;&#20043;&#31867;&#30340;&#65292;&#28982;&#21518;&#24320;&#22987;&#20844;&#24320;&#30340;&#25269;&#21046;NPL&#30340;&#20915;&#23450;&#12290;</p>
<p>&#26368;&#21518;&#24037;&#31243;&#24072;&#20204;&#21644;&#31649;&#29702;&#23618;&#37117;&#21463;&#19981;&#20102;&#20182;&#20102;&#65292;&#37492;&#20110;&#20182;&#21517;&#22768;&#22312;&#22806;&#65292;&#21448;&#19981;&#22909;&#24847;&#24605;&#24320;&#25481;&#20182;&#65292;&#21482;&#22909;&#25552;&#20986;&#19968;&#20010;&#30772;&#22825;&#33618;&#30340;&#25552;&#35758;&#65306;&#30001;NPL&#36164;&#21161;&#65292;&#35753;&#22270;&#28789;&#22238;&#21040;&#21073;&#26725;&#22823;&#23398;&#21435;&#24230;&#24180;&#20551;&#65288;sabbatical&#65289;&#65292;&#20570;&#19968;&#20123;&#32431;&#25968;&#23398;&#30340;&#30740;&#31350;&#12290;&#20110;&#26159;ACE&#22312;&#22270;&#28789;&#19981;&#22312;&#30340;&#24773;&#20917;&#19979;&#65292;&#32456;&#20110;&#24320;&#24037;&#20102;&#8943;&#8943;1950&#24180;&#65292;ACE&#36816;&#34892;&#20102;&#23427;&#30340;&#31532;&#19968;&#20010;&#31243;&#24207;&#12290;&#28982;&#32780;&#24037;&#31243;&#24072;&#20204;&#23454;&#29616;&#30340;ACE&#65292;&#23436;&#20840;&#20559;&#31163;&#20102;&#22270;&#28789;&#30340;&#35774;&#35745;&#65292;&#20197;&#33267;&#20110;&#23454;&#38469;&#30340;&#26426;&#22120;&#21644;&#22270;&#28789;&#30340;&#35774;&#35745;&#20043;&#38388;&#65292;&#20960;&#20046;&#27809;&#26377;&#20219;&#20309;&#30456;&#20284;&#24615;&#12290;&#19968;&#24180;&#20043;&#21518;&#65292;&#22270;&#28789;&#36824;&#24819;&#22238;&#21040;NPL&#65292;&#32487;&#32493;&#24433;&#21709;ACE&#30340;&#35774;&#35745;&#65292;&#28982;&#32780; NPL&#30340;&#39046;&#23548;&#20204;&#21364;&#24314;&#35758;&#20182;&#32487;&#32493;&#30041;&#22312;&#22823;&#23398;&#37324;&#20570;&#32431;&#29702;&#35770;&#30340;&#30740;&#31350;&#65292;&#24182;&#19988;&#35753;&#26364;&#24443;&#26031;&#29305;&#22823;&#23398;&#32473;&#20182;&#19968;&#20010;&#32844;&#20301;&#12290;&#26368;&#21518;&#22270;&#28789;&#25509;&#21463;&#20102;&#36825;&#20010;&#24314;&#35758;&#65292;&#36825;&#19979;&#22823;&#23478;&#20249;&#20799;&#37117;&#26494;&#20102;&#19968;&#21475;&#27668;&#8230;&#8230; :P</p>
<p>&#22270;&#28789;&#35774;&#35745;&#30340;&#21807;&#19968;&#19968;&#20010;&#35745;&#31639;&#26426;ACE&#65292;&#32456;&#31350;&#20197;&#22270;&#28789;&#23436;&#20840;&#36864;&#20986;&#25972;&#20010;&#39033;&#30446;&#32780;&#21578;&#32456;&#12290;&#20170;&#22825;&#22238;&#22836;&#30475;&#26469;&#65292;&#22914;&#26524;&#24403;&#26102;&#22270;&#28789;&#30041;&#19979;&#26469;&#20102;&#65292;NPL&#30495;&#30340;&#25353;&#29031;&#22270;&#28789;&#30340;&#24847;&#24605;&#26469;&#20570;&#65292;ACE&#24656;&#24597;&#30452;&#21040;&#20170;&#22825;&#37117;&#36896;&#19981;&#20986;&#26469;&#12290;&#30001;&#20110;&#22270;&#28789;&#19981;&#20999;&#23454;&#38469;&#30340;&#35774;&#35745;&#21644;&#39640;&#20658;&#30340;&#24615;&#26684;&#65292;NPL&#22833;&#21435;&#20102;&#26368;&#20248;&#31168;&#30340;&#20154;&#30340;&#24110;&#21161;&#12290;1949&#24180;&#65292;Maurice Wilkes&#25353;&#29031;EDVAC&#30340;&#24605;&#36335;&#65292;&#25104;&#21151;&#21046;&#36896;&#20102;EDSAC&#65292;&#36895;&#24230;&#26159;ACE&#30340;&#20004;&#20493;&#20197;&#19978;&#65292;&#32780;&#19988;&#26356;&#21152;&#23454;&#29992;&#12290;&#25152;&#20197;&#20320;&#30475;&#21040;&#20102;&#65292;&#22270;&#28789;&#24182;&#19981;&#26159;&#19968;&#20010;&#23454;&#24178;&#23478;&#65292;&#20182;&#30340;&#21452;&#33050;&#39128;&#22312;&#21322;&#31354;&#20013;&#12290;&#20182;&#30340;&#29702;&#35770;&#65292;&#20182;&#35774;&#35745;&#30340;&#26426;&#22120;&#65292;&#20182;&#30340;&#20195;&#30721;&#65292;&#20840;&#37117;&#20572;&#30041;&#22312;&#32440;&#19978;&#12290;&#20182;&#24182;&#27809;&#26377;&#24110;&#21161;&#36896;&#20986;&#20219;&#20309;&#19968;&#21488;&#23454;&#38469;&#21487;&#29992;&#30340;&#35745;&#31639;&#26426;&#65292;&#20182;&#23545;&#35745;&#31639;&#26426;&#30340;&#24037;&#31243;&#23454;&#29616;&#20960;&#20046;&#27809;&#26377;&#20219;&#20309;&#26377;&#30410;&#30340;&#24433;&#21709;&#12290;&#21487;&#24796;&#30340;&#26159;&#65292;&#26377;&#20123;&#20154;&#21916;&#27426;&#25226;&#23454;&#24178;&#23478;&#20204;&#21315;&#36763;&#19975;&#33510;&#36896;&#20986;&#26469;&#65292;&#30495;&#27491;&#21487;&#20197;&#29992;&#30340;&#19996;&#35199;&#65292;&#29301;&#24378;&#38468;&#20250;&#22320;&#24402;&#21151;&#20110;&#26576;&#20123;&#39640;&#35848;&#38420;&#35770;&#30340;&#29702;&#35770;&#23478;&#65292;&#20223;&#20315;&#37027;&#26159;&#29702;&#35770;&#23478;&#30340;&#21151;&#21171;&#20284;&#30340;&#12290;&#36825;&#20063;&#35768;&#23601;&#26159;&#20026;&#20160;&#20040;&#22270;&#28789;&#34987;&#20182;&#20204;&#31216;&#20026;&#8220;&#35745;&#31639;&#26426;&#20043;&#29238;&#8221;&#21543;&#12290;</p>
<p>&#22914;&#26524;&#23545;ACE&#21644;&#20854;&#23427;&#26089;&#26399;&#35745;&#31639;&#26426;&#24863;&#20852;&#36259;&#65292;&#20320;&#21487;&#20197;&#21442;&#32771;&#19968;&#19979;&#26356;&#35814;&#32454;&#30340;&#36164;&#26009;&#12290;&#20320;&#20063;&#21487;&#20197;&#30475;&#19968;&#30475;&#12298;&#22270;&#28789;&#20256;&#12299;&#65292;&#34429;&#28982;&#23427;&#35266;&#28857;&#33618;&#21776;&#65292;&#23545;&#22270;&#28789;&#21508;&#31181;&#20559;&#34962;&#65292;&#28982;&#32780;&#22270;&#28789;&#21644;&#20854;&#20182;&#20154;&#30340;&#36890;&#20449;&#65292;&#22522;&#26412;&#30340;&#21490;&#23454;&#65292;&#20182;&#24212;&#35813;&#19981;&#22909;&#24847;&#24605;&#31713;&#25913;&#12290;&#24635;&#32467;</p>
<p>&#25105;&#35828;&#36825;&#20123;&#26159;&#20026;&#20102;&#20160;&#20040;&#21602;&#65311;&#25105;&#24403;&#28982;&#19981;&#26159;&#24819;&#21542;&#35748;&#22270;&#28789;&#25152;&#20570;&#20986;&#30340;&#36129;&#29486;&#12290;&#20687;&#35768;&#22810;&#30340;&#35745;&#31639;&#26426;&#24037;&#20316;&#32773;&#19968;&#26679;&#65292;&#20182;&#30340;&#26576;&#20123;&#24037;&#20316;&#24403;&#28982;&#26159;&#26377;&#24847;&#20041;&#30340;&#12290;&#28982;&#32780;&#37027;&#31181;&#24847;&#20041;&#24182;&#19981;&#20687;&#24456;&#22810;&#20154;&#25152;&#21561;&#22040;&#30340;&#37027;&#20040;&#20255;&#22823;&#65292;&#23427;&#20204;&#29978;&#33267;&#19981;&#21253;&#21547;&#24456;&#22810;&#30340;&#21019;&#26032;&#12290;</p>
<p>&#25105;&#35273;&#24471;&#24456;&#22810;&#21518;&#20154;&#32473;&#22270;&#28789;&#24102;&#19978;&#30340;&#20809;&#29615;&#65292;&#25513;&#30422;&#20102;&#22826;&#22810;&#20854;&#23427;&#20540;&#24471;&#25105;&#20204;&#23398;&#20064;&#21644;&#23562;&#25964;&#30340;&#20154;&#65292;&#32473;&#20154;&#20204;&#23545;&#20110;&#35745;&#31639;&#26426;&#31185;&#23398;&#30340;&#27010;&#24565;&#36896;&#25104;&#20102;&#35823;&#23548;&#12290;&#35745;&#31639;&#26426;&#31185;&#23398;&#19981;&#26159;&#22270;&#28789;&#19968;&#20010;&#20154;&#36896;&#20986;&#26469;&#30340;&#65292;&#22270;&#28789;&#24182;&#19981;&#26159;&#35745;&#31639;&#26426;&#31185;&#23398;&#30340;&#40763;&#31062;&#65292;&#20182;&#29978;&#33267;&#19981;&#26159;&#22312;&#30772;&#35299;Enigma&#23494;&#30721;&#21644;&#30005;&#23376;&#35745;&#31639;&#26426;&#35806;&#29983;&#36807;&#31243;&#20013;&#36215;&#26368;&#37325;&#35201;&#20316;&#29992;&#30340;&#20154;&#12290;</p>
<p>&#35768;&#35768;&#22810;&#22810;&#30340;&#35745;&#31639;&#26426;&#31185;&#23398;&#23478;&#21644;&#30005;&#23376;&#24037;&#31243;&#24072;&#20204;&#65292;&#26159;&#20182;&#20204;&#36896;&#23601;&#20102;&#20170;&#22825;&#30340;&#35745;&#31639;&#31185;&#23398;&#12290;&#20182;&#20204;&#30340;&#32874;&#26126;&#25165;&#26234;&#21644;&#36129;&#29486;&#65292;&#19981;&#24212;&#35813;&#34987;&#22270;&#28789;&#30340;&#20809;&#29615;&#25152;&#25513;&#30422;&#65292;&#20182;&#20204;&#24212;&#35813;&#21463;&#21040;&#20687;&#36319;&#22270;&#28789;&#19968;&#26679;&#30340;&#23562;&#25964;&#12290;&#24076;&#26395;&#22823;&#23478;&#19981;&#35201;&#20877;&#31070;&#21270;&#22270;&#28789;&#65292;&#19981;&#35201;&#20877;&#31070;&#21270;&#20219;&#20309;&#20154;&#12290;&#19981;&#35201;&#22240;&#20026;&#33180;&#25308;&#26576;&#20123;&#20154;&#65292;&#32780;&#22833;&#21435;&#21521;&#21478;&#19968;&#20123;&#20154;&#23398;&#20064;&#30340;&#26426;&#20250;&#12290;</p>
<p>&#25991;&#65295;&#27491;&#20041;&#30340;&#33457;&#29983;&#65288;&#31616;&#20070;&#20316;&#32773;&#65289;&#21407;&#25991;&#38142;&#25509;&#65306;http://www.jianshu.com/p/6918c531945b&#33879;&#20316;&#26435;&#24402;&#20316;&#32773;&#25152;&#26377;&#65292;&#36716;&#36733;&#35831;&#32852;&#31995;&#20316;&#32773;&#33719;&#24471;&#25480;&#26435;&#65292;&#24182;&#26631;&#27880;&#8220;&#31616;&#20070;&#20316;&#32773;&#8221;&#12290;</p>
</body>
</html>
