<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title>&#29983;&#27963;&#26041;&#24335;</title>
  <style type="text/css">code{white-space: pre;}</style>
</head>
<body>
<div id="header">
<h1 class="title">&#29983;&#27963;&#26041;&#24335;</h1>
</div>
<h1 id="&#29983;&#27963;&#26041;&#24335;">&#29983;&#27963;&#26041;&#24335;</h1>
<p>&#25105;&#21388;&#24694;&#25152;&#26377;&#38656;&#35201;&#25490;&#38431;&#31561;&#20505;&#30340;&#39184;&#21381;&#12290;&#26080;&#35770;&#37027;&#39184;&#21381;&#21517;&#22768;&#22914;&#20309;&#26174;&#36203;&#65292;&#26080;&#35770;&#20182;&#20204;&#30340;&#33756;&#32948;&#22810;&#20040;&#31934;&#32654;&#65292;&#22914;&#26524;&#25105;&#36319;&#20320;&#19968;&#36215;&#22312;&#38376;&#21475;&#25490;&#38431;&#31561;&#20505;&#65292;&#26379;&#21451;&#65292;&#20320;&#35201;&#30693;&#36947;&#25105;&#21482;&#26159;&#32473;&#20320;&#38754;&#23376;&#65292;&#32780;&#32477;&#19981;&#20250;&#26159;&#22240;&#20026;&#39184;&#21381;&#30340;&#39277;&#33756;&#22909;&#21040;&#20540;&#24471;&#25105;&#25490;&#38431;&#12290;</p>
<p>&#25105;&#19981;&#21916;&#27426;&#37027;&#20123;&#20511;&#22242;&#36141;&#12289;&#20419;&#38144;&#26469;&#25307;&#24469;&#39038;&#23458;&#30340;&#24215;&#38138;&#12290;&#26377;&#20123;&#24215;&#38138;&#20320;&#32473;&#20010;&#22909;&#35780;&#20182;&#23601;&#32473;&#20320;&#36820;&#29616;&#65292;&#36825;&#26679;&#30340;&#22320;&#26041;&#25105;&#19981;&#21916;&#27426;&#12290;&#26377;&#20123;&#24215;&#38138;&#20320;&#21152;&#20102;&#20182;&#20204;&#30340;&#20844;&#20247;&#21495;&#23601;&#21487;&#20197;&#20248;&#24800;&#24456;&#22810;&#65292;&#36825;&#26679;&#30340;&#24215;&#38138;&#25105;&#19981;&#20250;&#21435;&#12290;</p>
<p>&#36824;&#26377;&#20123;&#29609;&#31215;&#20998;&#30340;&#22320;&#26041;&#65292;&#31215;&#20998;&#22810;&#23569;&#21487;&#20197;&#25442;&#26576;&#20123;&#19996;&#35199;&#65292;&#25105;&#23545;&#27492;&#24456;&#21388;&#28902;&#65292;&#20063;&#20174;&#26469;&#19981;&#20250;&#29992;&#31215;&#20998;&#21435;&#25442;&#20160;&#20040;&#12290;&#21363;&#20351;&#37027;&#31215;&#20998;&#21487;&#20197;&#25442;&#19968;&#24352;&#26426;&#31080;&#65292;&#19968;&#22330;&#26053;&#36884;&#65292;&#21487;&#26159;&#25105;&#30495;&#30340;&#27809;&#26377;&#32784;&#24515;&#21435;&#25910;&#38598;&#20219;&#20309;&#31215;&#20998;&#12290;</p>
<p>&#25105;&#19981;&#21916;&#27426;&#28404;&#28404;&#25171;&#36710;&#12289;&#24555;&#30340;&#25171;&#36710;&#21644;&#20248;&#24067;&#30776;&#38065;&#25289;&#23458;&#30340;&#26041;&#24335;&#65292;&#25152;&#20197;&#25105;&#30340;&#25163;&#26426;&#37324;&#24182;&#27809;&#26377;&#23433;&#35013;&#36825;&#20123;&#19996;&#35199;&#12290;&#25105;&#26356;&#21916;&#27426;&#22352;&#20844;&#20132;&#65292;&#33457;&#26356;&#22810;&#30340;&#38065;&#25171;&#30340;&#65292;&#25110;&#32773;&#22810;&#36208;&#36335;&#19968;&#20010;&#23567;&#26102;&#65292;&#32780;&#19981;&#24895;&#21483;&#20248;&#24067;&#12290;&#25105;&#23545;&#26381;&#21153;&#24577;&#24230;&#20043;&#31867;&#30340;&#19996;&#35199;&#19981;&#25935;&#24863;&#65292;&#20294;&#26159;&#25105;&#23545;&#36825;&#31181;&#25171;&#36710;&#36824;&#20808;&#32473;&#34917;&#36148;&#30340;&#30340;&#33829;&#38144;&#26041;&#24335;&#24863;&#21040;&#24694;&#24515;&#12290;&#20320;&#20204;&#19981;&#35201;&#24314;&#35758;&#25105;&#35013;&#20010;&#20248;&#24067;&#65292;&#20063;&#19981;&#35201;&#25351;&#26395;&#25105;&#24110;&#20320;&#29992;&#20248;&#24067;&#21483;&#36710;&#12290;</p>
<p>&#25105;&#23545;&#22823;&#21830;&#22330;&#27627;&#26080;&#28608;&#24773;&#12290;&#24403;&#25105;&#22312;&#19978;&#28023;&#30340;&#26102;&#20505;&#65292;&#40857;&#20043;&#26790;&#21644;&#29615;&#29699;&#28207;&#20043;&#31867;&#30340;&#36229;&#22823;&#22411;&#21830;&#22330;&#20165;&#20165;&#26159;&#25105;&#21644;&#26379;&#21451;&#20204;&#32858;&#39184;&#30340;&#22320;&#26041;&#12290;&#22914;&#26524;&#32858;&#39184;&#22320;&#28857;&#26159;&#25105;&#20915;&#23450;&#30340;&#65292;&#26159;&#19981;&#20250;&#21435;&#36825;&#20123;&#22823;&#21830;&#22330;&#30340;&#12290;&#36825;&#20123;&#21830;&#22330;&#37324;&#27809;&#26377;&#25105;&#35201;&#20080;&#30340;&#30340;&#19996;&#35199;&#12290;&#19968;&#26679;&#37117;&#19981;&#20250;&#26377;&#12290;&#25105;&#36141;&#29289;&#30340;&#22320;&#26041;&#65292;&#19968;&#33324;&#26159;&#23567;&#21306;&#38376;&#21475;&#30340;&#20116;&#37329;&#24215;&#65292;&#23567;&#21306;&#37324;&#30340;&#23567;&#36229;&#24066;&#65292;&#28120;&#23453;&#12290;</p>
<p>&#22914;&#26524;&#25105;&#36319;&#20320;&#19968;&#36215;&#36891;&#21335;&#20140;&#36335;&#65292;&#20063;&#35768;&#21807;&#19968;&#26377;&#20852;&#36259;&#30340;&#36141;&#29289;&#26159;&#22312;&#36335;&#36793;&#25674;&#20080;&#19968;&#20018;&#29038;&#29087;&#30340;&#20851;&#19996;&#29038;&#65292;&#25110;&#32773;&#19968;&#30418;&#33261;&#35910;&#33104;&#12290;&#37027;&#20123;&#33457;&#33457;&#32511;&#32511;&#30340;&#19987;&#21334;&#24215;&#65292;&#21508;&#31181;&#26102;&#23578;&#21697;&#29260;&#65292;&#21508;&#31181;&#31934;&#21697;&#19987;&#26588;&#65292;&#25105;&#30495;&#30340;&#27627;&#26080;&#20852;&#36259;&#12290;&#25105;&#20063;&#19981;&#35748;&#24471;&#37027;&#20123;&#21697;&#29260;&#12290;</p>
<p>&#19968;&#26086;&#20320;&#36827;&#20837;&#19978;&#28023;&#36825;&#26679;&#30340;&#22478;&#24066;&#65292;&#20320;&#23601;&#35273;&#24471;&#24403;&#20195;&#30340;&#37117;&#24066;&#22522;&#26412;&#19978;&#37117;&#26159;&#20026;&#39640;&#24230;&#21830;&#21697;&#21270;&#30340;&#26102;&#39654;&#22899;&#20154;&#32780;&#35774;&#32622;&#30340;&#12290;&#30007;&#20154;&#30340;&#39118;&#21619;&#19968;&#28857;&#37117;&#24863;&#21463;&#19981;&#21040;&#12290;&#25110;&#32773;&#30007;&#20154;&#30340;&#29983;&#27963;&#26041;&#24335;&#24050;&#32463;&#27604;&#22899;&#20154;&#36824;&#31934;&#33268;&#20102;&#12290;</p>
<p>&#25105;&#26366;&#35797;&#22270;&#22312;&#19978;&#28023;&#34903;&#22836;&#25214;&#19968;&#20123;&#26426;&#26800;&#21152;&#24037;&#30340;&#22320;&#26041;&#65292;&#26080;&#35770;&#26159;&#36710;&#24202;&#12289;&#38115;&#24202;&#12289;&#32447;&#20999;&#21106;&#65292;&#20294;&#26159;&#24456;&#38590;&#25214;&#21040;&#12290;&#25105;&#20063;&#26366;&#24076;&#26395;&#22312;&#34903;&#22836;&#30475;&#21040;&#19968;&#20123;&#24037;&#21378;&#65292;&#20294;&#26159;&#24037;&#21378;&#20284;&#20046;&#24050;&#32463;&#23436;&#20840;&#28040;&#22833;&#12290;</p>
<p>&#32780;&#37027;&#20123;&#24191;&#21578;&#65292;&#37027;&#20123;&#21697;&#29260;&#65292;&#37027;&#20123;&#27169;&#29305;&#65292;&#37027;&#20123;&#34903;&#22836;&#25955;&#21457;&#30340;&#20256;&#21333;&#25991;&#26696;&#65292;&#37117;&#35753;&#25105;&#35273;&#24471;&#36825;&#22478;&#24066;&#31163;&#25105;&#24456;&#36965;&#36828;&#12290;&#36825;&#22478;&#24066;&#23545;&#25105;&#26159;&#22914;&#27492;&#30340;&#30095;&#20919;&#65292;&#37027;&#20123;&#28783;&#32418;&#37202;&#32511;&#30340;&#22330;&#25152;&#65292;&#26159;&#20026;&#21035;&#20154;&#20934;&#22791;&#30340;&#65292;&#19981;&#26159;&#20026;&#25105;&#12290;</p>
<p>&#25110;&#35768;&#26377;&#19968;&#20123;&#25991;&#33402;&#20154;&#65292;&#20182;&#20204;&#21435;&#21654;&#21857;&#21381;&#65292;&#21435;&#37202;&#21543;&#65292;&#21435;&#30000;&#23376;&#22346;&#65292;&#21435;&#30475;&#35805;&#21095;&#12290;&#32780;&#36825;&#20123;&#22312;&#25105;&#30475;&#26469;&#24050;&#32463;&#19981;&#26159;&#25991;&#33402;&#65292;&#32780;&#26159;&#38590;&#20197;&#23481;&#24525;&#30340;&#24694;&#20439;&#12290;</p>
<p>&#29978;&#33267;&#65292;&#23545;&#34903;&#22836;&#22899;&#20154;&#30340;&#26576;&#31181;&#36208;&#36335;&#23039;&#21183;&#20063;&#36234;&#26469;&#36234;&#30475;&#19981;&#24815;&#12290;&#37027;&#31181;&#23039;&#21183;&#37324;&#21253;&#21547;&#30528;&#19968;&#31181;&#21830;&#21697;&#21270;&#30340;&#35757;&#32451;&#65292;&#35753;&#20320;&#24863;&#21040;&#20154;&#37117;&#26159;&#20986;&#26469;&#28436;&#30340;&#65292;&#37117;&#26159;&#28436;&#22909;&#20102;&#21435;&#21334;&#30340;&#12290;</p>
<p>&#26377;&#20154;&#35828;&#25105;&#26159;&#20010;&#24456;&#22909;&#29031;&#39038;&#30340;&#20154;&#65292;&#38543;&#20415;&#21507;&#20160;&#20040;&#34903;&#22836;&#24555;&#39184;&#21644;&#20302;&#26723;&#26053;&#39302;&#23601;&#21487;&#20197;&#36807;&#24471;&#24320;&#24515;&#12290;&#20294;&#26159;&#25105;&#20063;&#26159;&#20010;&#24456;&#38590;&#21462;&#24742;&#30340;&#20154;&#65292;&#20320;&#25226;&#20320;&#35748;&#20026;&#26368;&#22909;&#30340;&#19996;&#35199;&#32473;&#25105;&#65292;&#21364;&#26410;&#33021;&#24847;&#35782;&#21040;&#37027;&#19996;&#35199;&#22312;&#25105;&#30524;&#37324;&#20998;&#25991;&#19981;&#20540;&#12290;</p>
<p>&#21035;&#36319;&#25105;&#35848;&#27969;&#34892;&#30340;&#20070;&#21333;&#65292;&#27969;&#34892;&#30340;&#30005;&#24433;&#65292;&#25105;&#37117;&#27809;&#30475;&#36807;&#12290;&#22823;&#23478;&#37117;&#22312;&#32842;&#30340;&#12298;&#19977;&#20307;&#12299;&#65292;&#25105;&#19968;&#39029;&#37117;&#27809;&#32763;&#36807;&#65292;&#20063;&#19981;&#20250;&#26377;&#20852;&#36259;&#21435;&#30475;&#12290;&#20063;&#35768;&#25105;&#20598;&#23572;&#20250;&#30475;&#19968;&#37096;&#20960;&#21313;&#24180;&#21069;&#30340;&#32769;&#30005;&#24433;&#65292;&#20294;&#26159;&#22823;&#27010;&#19982;&#27969;&#34892;&#26080;&#20851;&#12290;&#25105;&#23545;&#19990;&#30028;&#26479;&#29699;&#36187;&#27627;&#26080;&#20852;&#36259;&#65292;&#20320;&#20204;&#29087;&#30693;&#30340;&#37027;&#20123;&#29699;&#26143;&#25105;&#19968;&#20010;&#37117;&#19981;&#35748;&#35782;&#12290;&#25105;&#27809;&#26377;&#32929;&#31080;&#25143;&#22836;&#65292;&#35273;&#24471;&#19968;&#20010;&#20154;&#25171;&#29702;&#33258;&#24049;&#30340;&#32929;&#31080;&#12289;&#26102;&#21051;&#30447;&#30528;&#32929;&#24066;&#65292;&#37027;&#26159;&#25226;&#33258;&#24049;&#30340;&#38386;&#26247;&#32473;&#31967;&#36427;&#20102;&#12290;&#25105;&#27704;&#36828;&#19981;&#20250;&#26377;&#28909;&#24773;&#21435;&#30475;&#32929;&#24066;&#30340;&#12290;</p>
<p>&#25105;&#23545;&#23618;&#20986;&#19981;&#31351;&#30340;&#26032;&#21517;&#35789;&#24863;&#21040;&#21388;&#28902;&#12290;&#25110;&#32773;&#35828;&#25105;&#23545;&#19990;&#30028;&#24635;&#20307;&#19978;&#36234;&#26469;&#36234;&#21388;&#20518;&#12290;&#25105;&#36824;&#27809;&#21040;&#25233;&#37057;&#30151;&#30340;&#22320;&#27493;&#65292;&#20063;&#27809;&#20559;&#25191;&#21040;&#19982;&#20320;&#20204;&#20316;&#23545;&#12290;&#19990;&#30028;&#24456;&#22823;&#65292;&#26377;&#37027;&#20040;&#22810;&#35282;&#33853;&#65292;&#24456;&#22810;&#19996;&#35199;&#26159;&#21487;&#20197;&#23436;&#20840;&#28448;&#35270;&#30340;&#65292;&#26080;&#35770;&#23427;&#22810;&#20040;&#20027;&#27969;&#12290;</p>
<p>&#25991;&#65295;&#39281;&#37257;&#35930;&#65288;&#31616;&#20070;&#31614;&#32422;&#20316;&#32773;&#65289;&#21407;&#25991;&#38142;&#25509;&#65306;http://www.jianshu.com/p/9ab34dd5a1ed&#33879;&#20316;&#26435;&#24402;&#20316;&#32773;&#25152;&#26377;&#65292;&#36716;&#36733;&#35831;&#32852;&#31995;&#20316;&#32773;&#33719;&#24471;&#25480;&#26435;&#65292;&#24182;&#26631;&#27880;&#8220;&#31616;&#20070;&#31614;&#32422;&#20316;&#32773;&#8221;&#12290;</p>
</body>
</html>
